[
  {
    "title": "0-X MASH als zeitkontinuierliche Pipeline ADC basierend auf zeitverschachtelten SAR",
    "abstract": "Zeitkontinuierliche (CT) Analog-Digital-Wandler (ADC) bieten große Vorteile in Bezug auf Geschwindigkeit, Ansteuerbarkeit und Leistungseffizienz. Eine vielversprechende Architektur ist der sogenannte CT-Pipeline-ADC, der als 0-X MASH Delta-Sigma-Modulator implementiert werden kann. Nach dem Stand der Technik wird die grob auflösende Quantisierungsstufe üblicherweise mit einem niedrig auflösenden Successive Approximation Register (SAR) ADCC realisiert, was zur Bildung eines Residuums dient, das eine Zwischenverstärkung (ISG) und danach einen fein auflösenden ADCF durchläuft; letzterer wird üblicherweise als CT DSM realisiert ist. Die niedrige Auflösung des ADCC führt zu einem größeren Residiuum, was wiederum das ISG einschränkt und damit höhere Anforderungen an den ADCF stellt. Außerdem hat der DACC, der zur Bildung des Residuums verwendet wird und vom ADCC gespeist wird, zwar eine geringe Auflösung, benötigt aber die volle Linearität des gesamten CT-Pipeline-ADC. Der Stand der Technik verwendet digitale Kalibrierung, deren Komplexität in den meisten Veröffentlichungen nicht bekannt gemacht wird. In der ersten Projektphase wurde die Möglichkeit untersucht, zeitverschachtelte Quantisierung (TI) mit Hilfe von TI-SAR zu nutzen, um 0-X MASH DSM ADC zu implementieren. Es wurde eine Lösung für einen intrinsisch linearen DACC gefunden, der mit einem digitalen DSM (DDSM) realisiert wird. Dadurch kann der grobe ADCC durch einen TI-SAR implementiert werden, dessen TI-Ausgang in einen einzigen linearen DACC eingespeist wird, wodurch jegliche TI-Nicht-Idealitäten vermieden werden. Ein neuartiger TI-SAR wurde in einem 22nm CMOS-Prozess implementiert. Weitere Untersuchungen wurden zum erforderlichen Allpassfilter für die Rückstandsbildung und zu den Anforderungen an die digitale Cancellation Logic durchgeführt. In der zweiten Projektphase soll das gefundene DDSM-basierte DACC in einer möglichst wenig komplexen Implementierung realisiert werden, um einen GHz-Betrieb zu ermöglichen. Die optimale Position des ISG wird untersucht und seine Abhängigkeit vom out-of-band Quantisierungsrauschen des DDSM analysiert. Wir streben eine vollständige Implementierung dieses neuartigen CT-Pipeline-ADCs an, der auf dem TI-SAR, dem innovativen DDSM-DACC, einem nachfolgenden DSM, und einer digitalen Löschlogik mit reduzierter Komplexität basiert.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/392004833"
  },
  {
    "title": "100 GHz Echtzeitmessplatz",
    "abstract": "Das Fachgebiet „Mixed Signal Circuit Design“ (MSC) der Technischen Universität Berlin unter der Leitung von Prof. Dr.-Ing. Friedel Gerfers entwickelt mit seinen Forschungsgruppen „Wireline Communication Systems“ und „Wireless Communication Systems“ Schaltungen und Systeme für kabelgebundene und kabellose Hochgeschwindigkeitskommunikation sowie automotive Anwendungen. Aktuelle Projekte beinhalten komplette Transceiver sowie Transceiver-Komponenten – mit Datenumsetzern als Kernkompetenz.Kabelgebunden wird an Transceivern mit Datenraten von bis zu 224 Gbit/s (112 GBaud PAM4) gearbeitet, sowie an Komponenten, beispielsweise VCSEL sowie optischen Modulatoren, mit Symbolraten von bis zu 150 GBaud, um die Entwicklung aktueller und zukünftiger Übertragungstechnologien in Rechenzentren (400 und 800 Gigabit Ethernet) voranzubringen. Kabellos werden für die zu entwickelnden Kommunikationssysteme mit Datenraten von über 100 Gbit/s Frequenzbereiche bis zum D-Band (bis 170 GHz) verwendet, insbesondere für die nächste Mobilfunkgeneration „6G“. Um über die für diese Forschung notwendigen Charakterisierungsmöglichkeiten zu verfügen, wird im vorliegenden Antrag ein 100 GHz Echtzeitmessplatz sowie in einem parallel gestellten Antrag ein W- und D-Band Spektralmessplatz (75-170 GHz) beantragt.Der 100 GHz Echtzeitmessplatz besteht aus der Bandbreitenerweiterung eines bereits vorhandenen 70 GHz Echtzeit-Oszilloskops, welches ebenfalls durch einen Forschungsgroßgeräteantrag im Jahre 2019 finanziert wurde, jedoch zum damaligen Zeitpunkt weder der Projektbedarf noch die Finanzierungsmöglichkeit einer Bandbreitenerweiterung auf 100 GHz bestand. Die aktuelle Notwendigkeit der Bandbreitenerweiterung auf 100 GHz sowie der bisherige Einsatz des vorhandenen 70 GHz Echtzeit-Oszilloskops werden in diesem Antrag dargestellt.Der 100 GHz Echtzeitmessplatz wird in der genannten aktuellen Forschung z.B. zur Messung von Augendiagrammen und deren charakteristischen Eigenschaften (Augenöffnung, Bitfehlerrate, Intersymbolinterferenz, Rausch- und Jitter-Analyse) sowie zur Linearitätsbetrachtung durch Untersuchung von Einzeltönen bis hin zu höheren Harmonischen (z.B. 7. Ordnung) benötigt. Hierbei werden für zuverlässige Analysen breitbandige, zusammenhängende Datenströme aufgenommen, weshalb die unter-abtastende Architektur eines Sampling-Oszilloskops nicht verwendet werden kann.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/511745882"
  },
  {
    "title": "15-Kanal Projektion für Festsitzsimulator",
    "abstract": "Ein System zur realitätsnahen Flugsimulation unter Einbeziehung des menschlichen Piloten steht an der Technischen Universität Braunschweig bisher nicht zur Verfügung. Das Institut für Luft- und Raumfahrtsysteme wirkt aus diesem Grund am Aufbau des Simulatorzentrums am Deutschen Zentrum für Luft- und Raumfahrt mit. Das neu entstehende und gemeinsam genutzte Zentrum für Flugsimulation umfasst unter anderem einen Festsitzsimulator für den das beantragte Projektionssystem vorgesehen ist. Dessen Modularität erlaubt wahlweise den Einsatz des Projektionssystems mit dem Cockpit eines Airbus A320 oder Eurocopter EC135.Die Arbeitsgruppen am Campus Forschungsflughafen und mithin das Institut für Luft- und Raumfahrtsysteme sind mit dem DLR Braunschweig insbesondere über das Projekt Bürgernahes Flugzeug vernetzt und bilden gemeinsam den zentralen Forschungsbereich der Luft- und Raumfahrt der TU Braunschweig. Im Zentrum der Betrachtungen steht die Untersuchung des dynamischen Verhaltens von Dreh- und Starrflüglern in Interaktion mit dem menschlichen Bediener. Untersucht werden Verfahren und Methoden zur fehlertoleranten und robusten Unterstützung des Piloten in kritischen Flugphasen und bei Systemdegradation.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/219661999"
  },
  {
    "title": "1-Bit 3-Dimensionale Bildgebung",
    "abstract": "Time-of-Flight (ToF)-Kameras sind 3D-Bildgebungssysteme, die die Geometrie einer Szene erfassen können. Normalerweise wird das Quantisierungsschema kaum beachtet und eine gleichmäßige Quantisierung der Messungen mit einer ausreichenden Anzahl von Bits angenommen. In diesem Projekt wollen wir an die neuesten Ergebnisse anknüpfen, die zeigen, dass zuverlässige 3D-Mehrwegbilder aus Ein-Bit-quantisierten Daten gewonnen werden können. Das erste Ein-Bit-ToF-Pixel wird entwickelt, hergestellt und evaluiert. Die Fähigkeit, zuverlässige 3D-Bilder aus Ein-Bit-Daten zu erhalten, ermöglicht eine massive Reduzierung der von der Kamera zu erfassenden und zu übertragenden Daten. Dies reduziert die Hardware-Anforderungen in Bezug auf Speicher und Bandbreite. Darüber hinaus handelt es sich bei der Ein-Bit-ToF-Bildgebung um eine neue Form des inversen Problems, bei dem die Messungen einer nichtlinearen Transformation unterzogen wurden. Die Verringerung des Datenflusses pro Pixel ermöglicht auch größere ToF-Pixelarrays und ebnet den Weg für die Megapixel-ToF-Bildgebung. Die binäre Natur der Messungen macht auch ADC-Bänke überflüssig, was Platz auf den Chips spart und diese Entwicklung weiter vorantreibt. Obwohl bisher alle existierenden ToF-Kameras auf einer gleichmäßigen Quantisierung beruhen, haben Vorarbeiten von Dr. Heredia Conde die Durchführbarkeit des vorgeschlagenen Konzepts mit Hilfe realistischer Simulationen nachgewiesen. Diese ersten Ergebnisse deuten darauf hin, dass ein solches Ein-Bit-ToF-Pixel bei gleichem Bit-Budget eine bessere Leistung aufweisen würde als alternative Erfassungssysteme, die auf unterschiedlichen Kompromissen zwischen der Anzahl der Messungen und der Bittiefe beruhen. In diesem Projekt werden wir die erste Ein-Bit-ToF-Kamera entwerfen und konstruieren. Diese Hardware-Neuheit wird mit einem algorithmischen Gegenstück gekoppelt, das die Geometrie der beobachteten Szene aus den Messungen abschätzen kann. Das Ergebnis wird ein neuartiges zeitaufgelöstes Bildgebungssystem sein, bei dem die Informationen zunächst in leichtgewichtige Ströme von Ein-Bit-Daten kodiert und dann in ein oder mehrere Tiefenbilder dekodiert werden. Die Entwicklung eines Ein-Bit-3D-Bildgebungssystems soll wie folgt ablaufen: Zunächst wird die Architektur des Ein-Bit-Pixels entworfen und simuliert. Dann wird ein einzelnes Pixel oder ein kleines Array zu Testzwecken hergestellt. Aufbauend auf den Erkenntnissen aus diesem ersten Gerät wird ein komplettes Array von ToF-Pixeln hergestellt und mit einem modulierten NIR-Beleuchtungssystem und einem Steuerschaltkreis integriert. Die notwendigen Algorithmen zur Rekonstruktion der 3D-Geometrie der Szene aus den gewonnenen Ein-Bit-Daten werden entwickelt. Dazu gehört auch die Entflechtung mehrerer überlagernden Lichtechos pro Pixel. Schließlich soll die Gesamtleistung des Systems als 3D-Abbildungssensor systematisch evaluiert und mit dem Stand der Technik sowie mit den Ergebnissen aus Simulationen verglichen werden.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/514479946"
  },
  {
    "title": "1-D Multi-Gate FETs: Einstellen der Potentiallandschaft auf der Nanometerskala",
    "abstract": "Eindimensionale Materialien wie Nanodrähte und Nanoröhrchen werden seit einigen Jahren intensiv für den Einsatz in einer zukünftigen Nanoelektronik untersucht. Der Grund für das große Interesse ist zum einen der kleinen Geometrie geschuldet, die eine optimale Skalierbarkeit von elektronischen Bauelementen auf Grund der ausgezeichneten elektrostatischen Kontrolle in z.B. wrap-gate Strukturen erlaubt. Darüber hinaus weisen Nanodrähte bzw. Nanoröhrchen eindimensionalen elektronischen Transport auf, der eine Reihe von Vorteilen wie z.B. lange mittlere freie Weglängen oder eine hohe Linearität der Eingangskennlinien bietet. Die Kombination aus 1-D Transporteigenschaften und exzellenter Gatekontrolle ermöglicht es, den Potentialverlauf innerhalb des Bauelementes zu kontrollieren. Obwohl es inzwischen gängige Praxis ist, Gateelektroden zur gezielten Manipulation des Potentialverlaufs in Transistoren basierend auf neuartigen Materialien zu verwenden, so sind bisher nur Bauelemente mit entweder einer kleinen Zahl von Gates realisiert worden, oder diese Gates weisen Längen von mehreren zehn bis hundert Nanometern auf und/oder sind relativ weit voneinander entfernt. Mit einer solchen Anordnung lässt sich eine gezielte Manipulation des Potentialverlaufes auf der Nanometerskala nicht erreichen. Das Ziel des vorliegenden Projektantrages ist es eine 1-D Multi-Gate Architektur zu realisieren, in der eine größere Anzahl von Gateelektroden (ungefähr 10 oder mehr) mit Längen von wenigen Nanometern in direkter Nachbarschaft (ebenfalls wenige Nanometer voneinander entfernt) platziert werden. Dieses Layout erlaubt ein Zuschneiden des Potentialverlaufes des Leitungs- und Valenzbandes auf der Nanometerskala auf Grund der ausgezeichneten Gatekontrolle in 1-D Nanostrukturen und ermöglicht somit das volle Potential von 1-D Strukturen für die Nanoelektronik zu eruieren. Zwei verschiedene Demonstratoren/Bauelemente werden in diesem Zusammenhang erforscht: Zum einen ein Gate-induziertes Übergitter in Kohlenstoffnanoröhrchen und/oder InAs Nanodrähten. Mit geeigneten Dimensionen lässt sich mit diesem Übergitter ein Energiefilter erzeugen, der Bauelemente ermöglicht, die bei sehr kleinen Spannungen betrieben werden können und somit nanoelektronische Systeme mit sehr geringem Energieverbrauch ermöglichen. Zum anderen soll der Potentialverlauf in den 1-D Bauelementen so manipuliert werden, dass sie eine maximale Linearität der Eingangskennlinien aufweisen.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/266030637"
  },
  {
    "title": "1T1R – 2D-FET und VCM-Bauteil BEOL Integration\r\n\r\n\r\n          (B02)",
    "abstract": "Eines der Hauptmerkmale, die den Ansatz des Active-3D sehr lohnend machen, ist die Tatsache, dass Schalt- und Speicherbauelemente in unmittelbarer Nähe platziert werden können. Die Aufgabe dieses Projekts ist es, das Potenzial von 1T1R Elementen, die vollständig in die Metallisierung integriert werden können, zu bewerten. Diese werden durch die gemeinsame Integration eines 2D-FET und eines abrupt schaltenden valence change memory (VCM)-Bauelements realisiert werden. In diesem Sinne demonstriert B02 bereits die Kombination von zwei neuen Elementen als Ausgangspunkt für weitere Phasen des TRR. Darüber hinaus ermöglicht dieses Basiselement die energieeffiziente Matrix-Vektor-Multiplikation in Kreuzpunkt-Matrizen von 1T1R-Elementen unter Ausnutzung der Kirchhoffschen Gesetze.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/555743320"
  },
  {
    "title": "TRR 404: \r\n        Zukunftsweisende Elektronik durch aktive Bauelemente in drei Dimensionen (Active-3D)",
    "abstract": "Die Halbleitertechnologie ist das Herzstück fast aller Produkte und Dienstleistungen unserer Gesellschaft. Möglich wurde dies durch immer kleinere, billigere und energieeffizientere Bauteile, der Transistoren, aus denen integrierte Schaltungen und Systeme bestehen. Die Verkleinerung der physischen Größe des Transistors führte zu niedrigeren Kosten pro Funktion, höherer Verarbeitungsgeschwindigkeit und verbesserter Energieeffizienz. In den letzten Jahren hat sich die tatsächliche Größe eines Transistors jedoch nicht mehr wesentlich verringert. Stattdessen wurde das Mooreschen Gesetzes durch die Eliminierung unbenutzter Bereiche unter Verwendung neuer Bauelementearchitekturen in einem Technologie-/Schaltungs-Co-Design realisiert. Mit neuartigen 3D-Transistoren werden Verbesserungen im Sinne des Mooreschen Gesetzes erwartet. Vor kurzem wurde die heterogene Systemintegration eingeführt, bei der mehrere Chips in einem Gehäuse kombiniert werden. Diese Entwicklungen vergrößern jedoch die Nutzfläche eines Chips, entweder durch Verringerung des unbenutzten Raums zwischen den Bauelementen und/oder durch Vergrößerung des Chips und gehen daher nicht auf das Hauptproblem ein: den Energieverbrauch. Der zunehmend verbreitete Einsatz von maschinellem Lernen und künstlicher Intelligenz geht mit einem exponentiellen Anstieg des Stromverbrauchs einher und die räumliche Trennung von Speicher und Logik auf der Fläche heutiger Chips führt zum sogenannten \"von-Neumann-Engpass\". Dieser TRR wird das Volumen über der Chipfläche nutzen, indem aktive Bauelemente in die Metallisierung (engl. Back-End of Line (BEOL)) integriert werden, die Logik- und Speicherfunktionen sowie aktive Verbindungen er-möglichen. Innovative Bauelemente werden auf Basis neuer Materialien entwickelt und in Schaltungen und Systeme integriert, die Verbesserungen in Bezug auf die Schlüsselindikatoren Leistung, Verarbeitungsgeschwindigkeit und Fläche versprechen. Unser Material/Technologie/Schaltkreis-Co-Design-Ansatz bietet nahezu unbegrenzte Möglichkeiten, Schaltkreisfunktionalitäten über das bisher der passiven Verdrahtung vorbehaltenen Volumen zu verteilen und so den Platz auf dem Chip voll auszunutzen. Die Realisierung einer solchen aktiven Verdrahtung (engl. Active BEOL) erfordert die Integration und Anpassung einer großen Anzahl verschiedener Materialien, hochentwickelte Fertigungstechnologien, ein tiefgreifendes Verständnis der Wechselwirkung zwischen Materialien, ihrer Verarbeitung und den daraus resultierenden Bauelementeigenschaften sowie eine völlig neue Sichtweise beim Schaltungs- und Systemdesign. Dafür arbeitet der TRR mit renommierten Experten aus Dresden und Aachen. Darüber hinaus bringen beide Standorte eine hochkarätige Infrastruktur für die Mikro- und Nanofabrikation mit. Mit dem TRR \"Elektronik der nächsten Generation mit aktiven Bauelementen in drei Dimensionen (Active-3D)\" wird Deutschland und Europa in der Mikroelektronikgrundlagenforschung gestärkt.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/528378584"
  },
  {
    "title": "256GS/s Arbiträrgenerator",
    "abstract": "Das Fachgebiet \"Mixed Signal Circuit Design\" der Technischen Universität Berlin unter der Leitung von Prof. Dr.-Ing. Friedel Gerfers entwickelt mit seinen Forschungsgruppen \"Wireline Communication Systems\" und \"Wireless Communication Systems\" Schaltungen und Systeme für kabelgebundene und kabellose Hochgeschwindigkeitskommunikation sowie automotive Anwendungen. Kabelgebunden wird an Transceivern mit Datenraten von bis zu 448Gbit/s gearbeitet, sowie an Komponenten, beispielsweise VCSEL und elektro-optische Treiber, mit Symbolraten von 150GBaud und mehr, um die Entwicklung aktueller und zukünftiger Übertragungstechnologien voranzubringen. Kabellos werden für die zu entwickelnden Kommunikationssysteme mit Datenraten von über 100Gbit/s Frequenzbereiche bis zum D-Band (bis 170 GHz) verwendet, insbesondere für die nächste Mobilfunkgeneration \"6G\". Damit diese Forschung adressiert und hochgenau charakterisiert werden kann, wird mit dem vorliegenden Antrag ein 256GS/s Arbiträrgenerator mit 5Vppd Amplitude und 80GHz Bandbreite für die hochgenaue breitbandige Signalanalyse beantragt. Der Generator hat für das Fachgebiet zwei Haupteinsatzziele: 1. Modulationsquelle im forschungsspezifischen \"Messplatz für die breitbandige Vektorsignalanalyse modulierter Signale im D-Band (110-170 GHz)\"; 2. Eigenständige Signalquelle zur Erzeugung arbiträrer, systemangepasster Signale insbesondere mit höchster Abtastrate, analoger Bandbreite und Signalamplitude. Der \"Messplatz für die breitbandige Vektorsignalanalyse modulierter Signale im D-Band (110-170GHz)\" wird für die Entwicklung zukunftsorientierter kabelloser Übertragungstechniken mit einer Kombination aus ultrahoher Bandbreite, komplexer Modulationsverfahren (von 256QAM und mehr) und hoher Signalfrequenzen z.B. für den Mobilfunkstandard \"6G\", benötigt. Hierfür werden mit dem 256GS/s Arbiträrgenerator insbesondere Signale für Konstellationsdiagramme erzeugt und deren charakteristische Werte, wie EVM (Error-Vector-Magnitude), analysiert. Bis auf den 256GS/s Arbiträrgenerator sind alle Komponenten des Messplatzes, teils gefördert durch vorherige Anträge, bereits am Fachgebiet MSC vorhanden. Der Einsatz des 256GS/s Arbiträrgenerators als eigenständige Signalquelle dient unter anderem der Entwicklung von Transceivern und Sub-Komponenten, wie Verstärkern und Datenwandlern, von kabel- bzw. fasergebundenen Kommunikationssystemen, mit dem Ziel energieeffizienterer und zukunftssicherer Technologien für Rechenzentren. Hierfür erzeugt der Arbiträrgenerator modulierte Signale mit kanalkompensierender Vorverzerrung, die als Augendiagramme (mit Augenöffnung, Bitfehlerrate, Intersymbolinterferenz, Rauschen und Jitter) mit einem 100GHz Echtzeit-Oszilloskop (bereits vorhanden) analysiert werden. Zusammengefasst wird in diesem Antrag die aktuelle Notwendigkeit der Beschaffung sowie der Leistungsklasse eines 256GS/s Arbiträrgenerators für die hochgenaue breitbandige Analyse zukünftiger mobiler und fasergebundener Systeme dargestellt.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/544829238"
  },
  {
    "title": "2D-Feldeffekttransistoren\r\n\r\n\r\n          (A06)",
    "abstract": "2D-Materialien versprechen eine weitere Skalierung der Bauelemente und eine Verbesserung der Bauelementleistung und werden bereits für die Elektronik der Zukunft in Betracht gezogen. Die Gruppe bei AMO in Aachen ist führend in der Erforschung praktischer Bauelemente auf der Basis von 2D-Materialien. Die Gruppe in Dresden hat herausragende Ergebnisse in der Synthese von 2D Materialien erzielt. Da hier das Kanalmaterial vom Wafer entkoppelt ist, bietet sich die Integration in das BEOL an, auch wenn noch einige wichtige Probleme zu lösen sind. Im Rahmen des TRR wird dieses Projekt lateralen Bauelemente mit verschiedenen Leistungsstufen liefern.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/555733522"
  },
  {
    "title": "2D-Leuchtdioden mit lateralem Auskoppeltaper",
    "abstract": "Keine Zusammenfassung vorhandenDFG-VerfahrenSachbeihilfen",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/5089328"
  },
  {
    "title": "2D polarisationsaufgelöste optische Spektroskopie an Makromolekülen (konjugierte Polymere und Proteine) in verschiedenen Umgebungen zur Untersuchung der Konformation, Aggregation und des Energieübertrags mit der Prämisse zur Verbesserung organischer Solarzellen beizutragen.",
    "abstract": "In diesem Projekt sollen Konformation und Aggregation von Makromolekülen mithilfe von kürzlich entwickelten 2D-polarisationsaufgelösten Bildgebungsverfahren (2D POLIM) untersucht werden. Das vertiefte Verständnis der Organisationsstruktur dieser Moleküle und des von der umgebenden Matrix ausgeübten Einflusses auf dieselbe zielen auf eine Verbesserung der Anwendung im Bereich der organischen Elektronik. \u000bZu diesem Zweck sollen zum einen konjugierte Polymere untersucht werden, die aufgrund ihrer elektrischen und optischen Eigenschaften in der organischen Elektronik eingesetzt werden. Von der Anwendung von 2D POLIM auf hochverdünnte Lösungen konjugierter Polymere in Flüssigkristallen (LC) erwarten wir neue Erkenntnisse sowohl über die Topologie der Polymerketten und ihrer Aggregation als auch über das Ausmaß des Energietransfers in diesen Objekten. Flüssigkristalle bieten im Gegensatz zu amorphen Polymeren eine bekannte Ordnungsstruktur, die mithilfe von Temperaturvariation und elektrischen Feldern kontrolliert werden kann. Noch immer fehlen zuverlässige Angaben über die Konformationen der Polymerketten, den Grad der Aggregation und die Energieübertragungseffizienz. Solche Erkenntnisse sind insbesondere für die organische Elektronik von hoher Relevanz, denn die Morphologie der Polymerketten scheint ein Schlüssel für die Performanz elektronischer Anwendungen zu sein.\u000bDes weiteren erwarten wir von der Untersuchung von Biopolymeren in Zellen und in vitro neue Erkenntnisse über ihre komplexen Organisationspfade und deren Zusammenhang mit ihrer Funktionalität. Funktionale Strukturen spielen insbesondere in der Zellbiologie eine große Rolle. Vom Studium biologischer Materialien erwarten wir daher weitere Hinweise für die Verbesserung organischer Solarzellen. Erste Untersuchungen erwiesen die Überlegenheit von 2D POLIM bei der Auflösung von Strukturen in biomedizinischen Proben gegenüber herkömmlichen Techniken der Fluoreszenzspektroskopie. In Zusammenarbeit mit dem Wallenberg Neuroscience Center, Bio-Medical Center der Universität Lund sollen Aggregationsstufen von Proteinen erforscht werden. Die strukturaufgelöste Abbildung von Energietransfer und Orientierung der Proteine und Proteinaggregate stellt im Vergleich zu den Möglichkeiten anderer Fluoreszenzmikroskopietechniken einen direkteren Zugang zu möglichen Interaktionen der Proteine dar. \u000bDie Ergebnisse aus diesen Untersuchungen können insbesondere zu Verbesserungen für organische bulk-heterojunction Solarzellen beitragen. Dabei ermöglicht uns die bestehende Zusammenarbeit mit dem schwedischen Zentrum für organische Elektronik (COE) den direkten Test gewonnener Erkenntnisse an entsprechend gestalteten Materialien und Strukturen für solche Solarzellen.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/256530768"
  },
  {
    "title": "2-Photonen-Polymerisations-Workstation",
    "abstract": "Das beantragte Forschungsgroßgerät ist eine Anlage zur 2-Photonen-Polymerisation, die zur Herstellung von SD-Strukturen im Nanometerbereich, insbesondere für Anwendungen der Mikrosystemtechnik in den Lebenswissenschaften, eingesetzt werden soll. Sie ermöglicht z.B. die Fertigung von feinporigen Filterstrukturen sowie von Scaffolds zur gezielten Ansiedelung von Zellmaterial. Durch das gezielte Fokussieren eines fs-Lasers in das Volumen eines Photopolymers wird eine auf das Fokusvolumen beschränkte lokale Polymerisation ausgelöst, was die Fertigung von SD-Strukturen mit kleinsten Dimensionen im Nanometerbereich ermöglicht. Die Anlage ist eine ideale Ergänzung zur bereits installierten fs-Laser-Mikrostrukturierungsanlage und dem damit verbundenen Ausbau des Schwerpunktes der Lasermikrofertigung am IMT. Sie schärft so das Profil des IMT in Bezug auf neue Mikrofertigungsverfahren und den damit möglichen Anwendungen insbesondere in den Lebenswissenschaften und für die Forschung im Zentrum für Pharmaverfahrenstechnik (PVZ). Für die Zukunftssicherung und Neuausrichtung des Instituts ist diese Investition zwingend notwendig und integraler Bestandteil des mit der Berufung von Prof. Dietzel verbundenen Zukunfts- und Forschungskonzepts.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/290826840"
  },
  {
    "title": "300-GHz-Sender mit steuerbaren holographischen Antennen - HoloOnC",
    "abstract": "Bei Millimeterwellensystemen über 100 GHz für Kommunikations- und Sensorikanwendungen besteht eine wesentliche Herausforderung darin eine hohe EIRP (Equivalent Isotropic Radiated Power) zu erreichen, d.h. hohe gerichtete Sendeleistung bereitzustellen. Dies gilt insbesondere für Sender, die nicht mit Röhren, sondern mit integrierten Schaltungen (ICs) aufgebaut sind. Gründe dafür sind u.a. die begrenzte maximale Ausgangsleistung der Leistungsverstärker, die begrenzte Effizienz integrierter Antennen und verlustbehaftete Aufbau- und Verbindungstechnik beim Anbinden der ICs. Die Effizienz (PAE) von Leistungsverstärkern liegt über 100 GHz meist bei nur wenigen Prozent; bei siliziumbasierter Chiptechnologie wird diese durch die vergleichsweise geringe Durchbruchsspannung zusätzlich eingeschränkt. Da die Ausgangsleistung integrierter Sendeantennen für viele Millimeterwellenanwendungen nicht ausreicht, ist eine Bündelung des ausgesendeten Strahls nötig, um ein hohes EIRP zu realisieren. Dabei wird aber in vielen Anwendungen eine Strahlschwenkung benötigt, um die abgestrahlten Signale situativ in eine bestimmte Richtung zu lenken. Hier setzt dieser Projektantrag an und schlägt ein neues Konzept zur Strahlbündelung- und Schwenkung vor. Dabei soll ein neues Grundkonzept erforscht werden, bei dem holographische Antennen erstmals steuerbar, d.h. mit der Möglichkeit einer Strahlschwenkung, ausgelegt werden. Die eigentliche Strahlschwenkung erfolgt dabei über ein adaptives Hologramm, das durch integrierte Schalter im Hologramm verändert werden kann. Das Konzept ist für den oberen Millimeterwellenbereich gedacht, sodass die schwenkbare holographische Antenne als Chip-integrierte Antenne in einem IC umgesetzt werden soll. Im Projekt sollen die Wirkzusammenhänge des neuen holographischen Antennenkonzepts erarbeitet werden. Darauf aufbauend wird eine Designmethodik für die Antennen- und Schaltungsauslegung abgeleitet. Mittels eines Demonstrators erfolgt am Ende des Projekts die Verifikation. Das neue Konzept baut auf den Themen integrierte Antennen, holographische Antennen sowie Leistungserzeugung und integrierte Schalter auf, für die die Antragsteller umfangreiche Vorarbeiten mitbringen.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/556676862"
  },
  {
    "title": "3D-Drucker basierend auf der Zwei-Photonen-Polymerisation für maskenlose Mikrofabrikation (Teilfinanzierung)",
    "abstract": "Dieser Antrag befasst sich mit der Beschaffung eines 3D-Druckersystems auf der Grundlage der Zwei-Photonen-Polymerisation (\"3D-Drucker\") für die Herstellung komplexer 2,5D- und 3D-Mikrostrukturen mit höchster Auflösung und Genauigkeit. Gegenwärtig ist die Integration neuartiger Quantensysteme häufig durch die Beschränkungen konventioneller Fertigungstechniken begrenzt. Solche Quantensysteme erfordern häufig hybride elektro-photonische Schnittstellen und Verbindungen, die mit herkömmlichen Mikrofabrikationstechniken nur sehr schwierig bzw. überhaupt nicht zu realisieren sind. Dies gilt sowohl für Forschungssysteme als auch für die Massenproduktion. Der 3D-Drucker wird zur kompakten Integration der erforderlichen Kontrollstrukturen sowohl für spin- als auch für atombasierte Qubits eingesetzt, die eine präzise Erzeugung von hochfrequenten magnetischen bzw. elektrischen Feldern erfordern. Anwendungen solcher Quantensysteme, insbesondere im Bereich der biomedizinischen Sensorik, erfordern zudem häufig die präzise Handhabung und Kontrolle von Flüssigkeiten durch mikrofluidische Strukturen, die in das Quantendevice integriert werden müssen. Die sich daraus ergebenden Strukturen lassen sich mit herkömmlichen planaren, reinraumbasierten Fertigungsmethoden nur sehr schwer und/oder zeitaufwändig herstellen. Um die Herstellung der oben genannten Strukturen zu ermöglichen, muss das geforderte System die 3D-Fertigung von Mikrostrukturen mit einer Auflösung und Genauigkeit im (Sub-)Mikrometerbereich im Wafermaßstab ermöglichen, einschließlich der Möglichkeit des direkten Drucks von mikrooptischen Elementen wie Linsen, Beugungsgittern und faseroptischen Kopplern. Um eine potenzielle Skalierbarkeit der Fertigung zu ermöglichen, ist eine automatische Ausrichtung des 3D-Drucks auf vorhandene optische Elemente wie Fasern und photonische Chips erforderlich. Insgesamt ermöglicht dies eine Integration komplexer hybrider photonisch-elektronischer Nano-/Mikrosysteme mit Fähigkeiten, die den derzeitigen Stand der Technik erheblich erweitern. Da der 3D-Drucker selbst nur nichtleitende Polymere drucken kann, werden wir verschiedene Methoden anwenden, z.B. den 3D-Aerosol-Druck, um die erforderlichen leitfähigen Strukturen für die Erzeugung der magnetischen und elektrischen HF-Felder zur Qubit-Steuerung herzustellen. Darüber hinaus können wir die hohe Präzision des 3D-Druckers nutzen, um Stützstrukturen mit variablen Durchmessern, dünnen Wänden und hohen Aspektverhältnissen zu drucken, um 3D-Spulenstrukturen mit dem in unserem Labor etablierten 3D-Drahtbondverfahren mit isolierten Bonddrähten herzustellen. Solche 2,5D- und 3D-Geometrien weisen eine wesentlich bessere Feldhomogenität auf als rein planare Geometrien, die für die meisten modernen gepulsten Kontrollsequenzen erforderlich sind. Zusammenfassend werden wir den beantragten 3D-Drucker für die Entwicklung neuartiger Konzepte für die hybride Integration von Quantendevices sowie weiteren intelligente Sensoren einsetzen.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/538872077"
  },
  {
    "title": "3D Drucker für additiv gefertigte Elektronik, Teilfinanzierung",
    "abstract": "Digitalisierung, Künstliche Intelligenz und Industrie 4.0 sind Schlüsselbereiche, in denen das Fertigungsverfahren „Additively Manufacturing Electronics“ (AME) eine bedeutende Rolle spielen. Die Integration von Elektronik in Bauteile erlaubt die Entwicklung intelligenter Sensoren und vernetzte Systeme bei gesteigerter Effizienz und Produktivität. AME ermöglicht die schnelle Prototypenerstellung und Produktentwicklung, wodurch Forschungseinrichtungen und Unternehmen ihre Innovationsprozesse optimieren können. Die maßgeschneiderten Lösungen und die Designfreiheit von AME unterstützen die Anpassung an die spezifischen Anforderungen dieser zukunftsweisenden Bereiche. Durch die Anschaffung eines 3D-AME-Druckers wird die Professur für Mikroelektronik der Universität Freiburg in die Lage versetzt, ihre selbstentwickelten und gefertigten anwendungsbezogenen integrierten Schaltungen (engl. „application specific integrated circuits“, ASIC) mittels hochmoderner Fertigungsverfahren zu komplexen Systemen auszuformen. Der beantragte 3D-AME-Drucker wird dafür das kointegrierte Drucken von Dielektrika und Metallen ermöglichen, wobei mittels Inkjet-Technologie UV-gehärtete dielektrische Materialien mit IR-gesinterten Silber-Nanopartikeln kombiniert werden, um hochauflösende elektrische Strukturen herzustellen. Ein derart kointegrierter Druck in beliebigen dreidimensionalen Geometrien erlaubt es, die gefertigten ASICs auf innovative Weise elektrisch zu kontaktieren und gleichzeitig vor äußeren Einflüssen zu schützen. Somit sind statt der typischerweise planaren Kombination elektrischer Bauteile bei gängiger Printed-Circuit-Boards-(PCB)-Montage auch gestapelte, orthogonale oder sogar sphärische Anordnungen von Einzelkomponenten möglich, wodurch deutlich kleinere Bauformen erreicht werden. Das Druckverfahren und die geringen Fertigungstemperatur erlauben das Pausieren des Drucks und damit das package-freie Einbetten von ASICs als sogenannte Bare Dies, wodurch die Bauform minimiert und gleichzeitig Signalqualitäten wegen des Verzichts auf Bonddrähte und kürzerer Leitungen verbessert werden. Auch kann die Leitungsführung selbst revolutioniert werden, indem innerhalb des 3D-gedruckten Gehäuses Leitungen vollumfänglich abgeschirmt, in größeren Gruppen verdrillt oder deren Impedanzen fein abgestimmt werden. Die Herstellung passiver elektrischer Komponenten und 3D-Antennen ist ebenfalls möglich, womit letztendlich eine Verschmelzung von PCB, passiven Komponenten und ASIC zu einer hochintegrierten mikroelektronischen Einheit erreicht wird. Letztendlich reduziert ein 3D-AME-Drucker den Bedarf an externer Fertigung und erweitert die Möglichkeiten der Technischen Fakultät zur Fertigung multiphysikalischer Mikrosysteme. Forciert werden Forschungen zu multiphysikalischer Senorik und hochintegrierter Brain-Machine-Interfaces. In der Lehre ermöglicht der Drucker das praktische Erfahren parasitärer ASIC-Effekte und deren Auswirkungen auf empfindliche Schaltungen.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/539303076"
  },
  {
    "title": "3D-fähiger Multimaterialdrucker",
    "abstract": "Zur nachhaltigen Verstärkung der seit vier Jahren äußerst positiv und erfolgreich verlaufenden Aktivitäten der OHM-CMP im Bereich der elektrischen Funktionalisierung von dielektrischen Oberflächen (gedruckte Elektronik) ist die Beschaffung eines seriennahen, 3D-fähigen Multimaterialdrucksystems erforderlich. Im Einzelnen sind hierbei folgenden Gründe anzuführen: Die technische Leistungsfähigkeit des installierten Labor-Drucksystems ist infolge seines Aufbaus technisch beschränkt (z.B. stark limitierte 3D-Fähigkeit) und für zukünftige Forschungsaktivitäten nicht mehr ausreichend (Multimaterialverarbeitung z.B. von keramischen Materialien, Genauigkeit, Prozesskontrolle etc.). Im Sinne des Erkenntnistransfers in die Wirtschaft und der industrienahe Weiterentwicklung der digitalen Druckprozesse ist seriennahes Druckequipment erforderlich. Die Vielzahl aktuell laufender und geplanter Forschungsprojekte zum Inkjetdruck sowie die hierbei durchzuführenden Arbeiten, die von wissenschaftlichen Mitarbeitern, Master- und Bachelorarbeitern sowie von studentischen Hilfskräften bewältigt werden, führen zu einer Überauslastung des Systems. Aus Kapazitätsgründen ist eine Erweiterung erforderlich.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/391654033"
  },
  {
    "title": "3D-gedruckte dielektrische Strukturen für THz-Anwendungen\r\n\r\n\r\n          ((2)-C13)",
    "abstract": "Das Ziel dieses Projekts ist es, monolithische 3D THz Keramikkomponenten für ultra-exakte Lokalisierungsanwendungen im mm- und sub-mm Wellenlängenbereich möglich zu machen. Für diesen Zweck wird „Lithography-based Ceramic Manufacturing“ als eine neu entwickelte 3D-Drucktechnologie in die THz-Forschung eingebracht. Ohne bisherige THz Anwendung dieser Technik, wird das Projekt die Technologie für die Anwendbarkeit im mm- und sub-mm Wellenlängenbereich weiterentwickeln, um eine bisher nie dagewesene THz-Bauteilkomplexität möglich zu machen. Hiermit geht dieses Projekt nicht nur über den Stand der Technik klassischer 2.5D Herstellungsmethoden, sondern auch über den Stand der Technik gegenwärtiger 3D-Drucktechnologien hinaus.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/419393123"
  },
  {
    "title": "TRR 196: \r\n        Mobile Material-Charakterisierung und -Ortung durch Elektromagnetische Abtastung",
    "abstract": "Vor mehr als 100 Jahren erfanden Wissenschaftler einen mobilen Bildempfänger (den Fotoapparat), um überall fotografieren zu können. Vor mehr als 30 Jahren erfanden Ingenieure einen mobilen Nachrichtensender und -empfänger (das Mobiltelefon), um überall telefonieren zu können. Vor fast 8 Jahren begannen wir mit der Erforschung eines mobilen MAteRIaltranscEivers, um überall Materialien kartieren zu können. Jetzt, in der letzten Förderphase, wollen wir der Vision von MARIE näherkommen, indem wir die automatische Generierung der Materialkarte in den besonders herausfordernden, zeitlich veränderlichen Umgebungen erforschen. Alle dafür erforderlichen Erfindungen basieren auf technologischen Fortschritten, um von elektronischen, photonischen und mikromechanischen Komponenten über integrierte Schaltkreise zu kompakten mobilen Geräten zu gelangen. Ziel ist es, die Eigenschaften heutiger statischer und sperriger Materialcharakterisierungssysteme auf mobile Materialtransceiver zu übertragen. Dies wird (analog zum Übergang vom Festnetz zum Mobiltelefon) aufgrund der Mobilität und Kompaktheit zu bedeutenden Innovationen in einem breiten Spektrum gesellschaftlicher Anwendungen führen: die mobile Detektion des Brandherdes oder bewusstloser Personen in einem brennenden Gebäude, die Echtzeitdetektion von Kabeln und Artefakten in Wänden, oder allgemein die autonome Erstellung von Materialkarten, z.B. zur Lokalisierung und Klassifizierung von Objekten in beliebigen Innen- und Außenbereichen. Die Trägerfrequenz von MARIE reicht von 250 GHz (in der ersten Förderphase) bis zu 5 THz (in der zweiten Förderphase) und bis zu 6 THz in der dritten Förderphase, wodurch eine Vielzahl von Materialien detektiert und aufgrund der enormen Bandbreite Materialkarten mit besonders hoher Auflösung erstellt werden können. In der ersten und zweiten Phase von MARIE wurden vier große Forschungsherausforderungen angegangen: die umfassende Messung und Modellierung der THz-Wellenausbreitung, die kompakte Realisierung von THz-Transceivern, die statische und mobile Charakterisierung von Materialien sowie die präzise Lokalisierung solcher Materialien. In der dritten Phase werden diese vier \"Grand Challenges\" in drei großen, stark kooperativen \"Lead Projects\" zusammengeführt: Lokalisierung, Bildgebung und Kartierung. Diese sind vertikal strukturiert und werden durch Experimente, Modellierungen und Simulationen verifiziert. Ergänzend dazu ist MARIE in drei horizontal strukturierte Hauptforschungsbereiche gegliedert: Chips from Technology (C) erforscht neue dynamische Transceivertechnologien für integrierte Schaltungen; Modelle aus Messungen (M) modelliert die dynamische Materialcharakterisierung und -lokalisierung aus umfangreichen Messkampagnen; und Systeme aus Konzepten (S) untersucht wegweisende Signalverarbeitungskonzepte für dynamische Materialkartierungen. Aufbauend auf diesem Know-how soll in der dritten Förderphase die Vision des Mobile MAteRIal TranscEi-vers erreicht werden.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/287022738"
  },
  {
    "title": "3D Integration nichtflüchtiger nanomagnetischer Logik",
    "abstract": "In nanomagnetischer Logik (NML) ist ein logischer Zustand durch die Magnetisierungsrichtung eines einzelnen Nanomagneten gegeben. Die Wechselwirkung zwischen benachbarten Magneten durch magnetische Feldkopplung wird für Logikoperationen genutzt. Dieses Prinzip wurde bisher für Nanomagnete innerhalb einer magnetischen Schicht genutzt. In dem laufenden DFG-Projekt Feldgekoppelte Schaltungen in magnetischen Mehrlagenschichten (2009-2012) haben wir die Technologie und alle grundlegenden Komponenten für Systeme mit vertikaler Magnetisierung entwickelt. Dazu haben wir eine neue Technik entwickelt, um mit lokaler FIB-Bestrahlung die magnetischen Eigenschaften der Magnete einzustellen und die Richtung des Signalflusses zwischen benachbarten Magneten zu kontrollieren. So konnten wir eine Kette mit gerichtetem Signalfluss und ein Mehrheitsgatter realisieren. Dies ist ein universelles Gatter, das als NAND- oder NOR-Gatter programmiert werden kann, und es ist der Grundbaustein der nanomagnetischen Logik.In dem beantragten Folgeprojekt wollen wir diese Methoden anwenden, um Feldkopplung zwischen Magneten in dreidimensionaler Anordnung zu realisieren. Damit kann Feldkopplung in allen Richtungen sowohl für dreidimensionale Logikgatter wie auch für Signalführung genutzt werden. Dies führt zu einer echten und hochdichten 3D-Integration. Mit unserer Technik der lokalen Bestrahlung zusammen mit den dreidimensionalen Geometrien, die wir in diesem Projekt entwickeln wollen, kann gerichteter Signalfluss in drei Dimensionen erzielt werden. Dies ermöglicht Signalkreuzungen, was bisher ein Haupthindernis für die Verwirklichung komplexer NML Systeme ist. Erste Experimente zeigen bereits, dass die Herstellung von 3D magnetischen Mehrlagenschichten möglich und die vertikale Kopplung ausreichend ist. Eingangs- und Ausgangsschnittstellen, die wir entwickelt haben, um NML in eine elektronische Umgebung einbetten zu können, wollen wir in die 3D-Architektur übernehmen. Für die Takt- und Energieversorgung nutzen wir ein externes magnetisches Feld. Hier wollen wir die Zusammenhänge zwischen Amplitude, Frequenz, lokaler Feldverteilung und dem Schaltverhalten der NML-Gatter mit Simulationen und Experimenten untersuchen. Ein sinusförmiges Signal für die Takt- und zugleich Energieversorgung ermöglicht adiabatische Energierückgewinnung mit einem resonanten Oszillator. Das letztendliche Ziel des Vorhabens ist die Herstellung eines komplexen Logikblocks aus mehreren Mehrheitsgattern, der sich über drei Lagen erstreckt.Anders als CMOS-Logik benötigt nanomagnetische Logik keine Verdrahtung für Signale und Versorgungsleitungen. Es gibt keine Leckströme, die Zustände sind nichtflüchtig gespeichert, und es gibt eine globale Taktversorgung, wodurch Störungen zufolge Schwankungen der Taktflanken vermieden werden. Somit werden wir eine neuartige Digitaltechnik erarbeiten, die besonders für robuste Systeme mit niedriger Verlustleistung geeignet ist.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/114933698"
  },
  {
    "title": "3D-Integration von maßgeschneiderten Phasenwechselspeichern (PCMs)\r\n\r\n\r\n          (A03)",
    "abstract": "Phasenwechselmaterialien bieten eine sehr vielseitige Methode zur Herstellung von Widerstandsschaltbauelementen, die sich insbesondere für Speicheranwendungen und In-Memory-Computing und für andere analoge Schaltungsanwendungen eignen. Der Standort Aachen gehört zu den weltweit führenden Standorten zum Thema optimierter Phasenwechselmaterialien. Die Aufgabe dieses Projekts ist die Bereitstellung von 3D integrierbaren Blöcke aus Phasenwechsel Elementen die für Speicher- und In-Memory-Computing-Anwendungen eingesetzt werden können. In den Phasen 2 und 3 werden neben der Kombination der Phasenwechsel Bauelemente mit anderen Bauelementen aus dem TRR auch die Möglichkeiten des Einsatzes von Phasenwechselmaterialien für das Wärmemanagement erforscht.",
    "dfg_label": "4.42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/555731762"
  },
  {
    "title": "1-Bit 3-Dimensionale Bildgebung",
    "abstract": "Time-of-Flight (ToF)-Kameras sind 3D-Bildgebungssysteme, die die Geometrie einer Szene erfassen können. Normalerweise wird das Quantisierungsschema kaum beachtet und eine gleichmäßige Quantisierung der Messungen mit einer ausreichenden Anzahl von Bits angenommen. In diesem Projekt wollen wir an die neuesten Ergebnisse anknüpfen, die zeigen, dass zuverlässige 3D-Mehrwegbilder aus Ein-Bit-quantisierten Daten gewonnen werden können. Das erste Ein-Bit-ToF-Pixel wird entwickelt, hergestellt und evaluiert. Die Fähigkeit, zuverlässige 3D-Bilder aus Ein-Bit-Daten zu erhalten, ermöglicht eine massive Reduzierung der von der Kamera zu erfassenden und zu übertragenden Daten. Dies reduziert die Hardware-Anforderungen in Bezug auf Speicher und Bandbreite. Darüber hinaus handelt es sich bei der Ein-Bit-ToF-Bildgebung um eine neue Form des inversen Problems, bei dem die Messungen einer nichtlinearen Transformation unterzogen wurden. Die Verringerung des Datenflusses pro Pixel ermöglicht auch größere ToF-Pixelarrays und ebnet den Weg für die Megapixel-ToF-Bildgebung. Die binäre Natur der Messungen macht auch ADC-Bänke überflüssig, was Platz auf den Chips spart und diese Entwicklung weiter vorantreibt. Obwohl bisher alle existierenden ToF-Kameras auf einer gleichmäßigen Quantisierung beruhen, haben Vorarbeiten von Dr. Heredia Conde die Durchführbarkeit des vorgeschlagenen Konzepts mit Hilfe realistischer Simulationen nachgewiesen. Diese ersten Ergebnisse deuten darauf hin, dass ein solches Ein-Bit-ToF-Pixel bei gleichem Bit-Budget eine bessere Leistung aufweisen würde als alternative Erfassungssysteme, die auf unterschiedlichen Kompromissen zwischen der Anzahl der Messungen und der Bittiefe beruhen. In diesem Projekt werden wir die erste Ein-Bit-ToF-Kamera entwerfen und konstruieren. Diese Hardware-Neuheit wird mit einem algorithmischen Gegenstück gekoppelt, das die Geometrie der beobachteten Szene aus den Messungen abschätzen kann. Das Ergebnis wird ein neuartiges zeitaufgelöstes Bildgebungssystem sein, bei dem die Informationen zunächst in leichtgewichtige Ströme von Ein-Bit-Daten kodiert und dann in ein oder mehrere Tiefenbilder dekodiert werden. Die Entwicklung eines Ein-Bit-3D-Bildgebungssystems soll wie folgt ablaufen: Zunächst wird die Architektur des Ein-Bit-Pixels entworfen und simuliert. Dann wird ein einzelnes Pixel oder ein kleines Array zu Testzwecken hergestellt. Aufbauend auf den Erkenntnissen aus diesem ersten Gerät wird ein komplettes Array von ToF-Pixeln hergestellt und mit einem modulierten NIR-Beleuchtungssystem und einem Steuerschaltkreis integriert. Die notwendigen Algorithmen zur Rekonstruktion der 3D-Geometrie der Szene aus den gewonnenen Ein-Bit-Daten werden entwickelt. Dazu gehört auch die Entflechtung mehrerer überlagernden Lichtechos pro Pixel. Schließlich soll die Gesamtleistung des Systems als 3D-Abbildungssensor systematisch evaluiert und mit dem Stand der Technik sowie mit den Ergebnissen aus Simulationen verglichen werden.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/514479946"
  },
  {
    "title": "2C-NOW: Collaboration and Coordination in Networks of Work - Phase 2: Hybrid Workgroups and Workspaces",
    "abstract": "In Phase 2 von 2C-NOW vertiefen wir unsere Arbeit in zwei Richtungen: Erstens bauen wir auf unserer entwickelten Spurenanalyse (trace ethnography) auf, um dieses Instrument um ethnografische Methoden und Werkzeuge für die Analyse von Logfiles zu erweitern. Zweitens untersuchen wir mittels empirischer Studien Veränderungen von Arbeitsroutinen und Arbeitspraktiken in Organisationen, die durch die Zunahme von hybrider Arbeit und hybriden Arbeitsgruppen entstehen. Damit liefern wir empirische Nachweise, wie sich die Arbeitswelt durch die zunehmende digitale Unterstützung von Arbeit verändert. Unsere Forschungsziele sind 1) die Entwicklung und Anwendung digitaler ethnografischer Methoden, um umfassende Kontextanalysen von Rhythmen und Abläufen im Arbeitsalltag von hybriden und verteilten Arbeitsumgebungen durchzuführen, 2) die Analyse emergenter Sequenzen von koordinativer Arbeit, um Arbeitsroutinen und Interaktionsmuster in hybriden und verteilten Arbeitsgruppen zu identifizieren und 3) die Untersuchung, wie Technologien und Artefakte sich im Zuge der Gestaltung digitaler Arbeitsräume verändern. Mit Hilfe unsere Forschungsinitiative IndustryConnect konnten wir in den letzten zehn Jahren die Entstehung und Gestaltung digitaler Arbeitsplätze in 35+ Organisationen im DACH-Raum mitverfolgen. In Phase 2 setzen wir die enge Zusammenarbeit fort, um Längsschnitt-Fallstudien zum digitalen Arbeitsplatz zu entwickeln. Durch weitere Interviews, Umfragen und Fokusgruppen sammeln wir Daten über hybride Arbeitsgruppen und deren Arbeitsvereinbarungen. Für die Identifikation, Visualisierung und Analyse neuer Formen von detaillierten Längsschnittdaten über die alltäglichen Rhythmen und Arbeitsroutinen verteilter und hybrider Arbeitsgruppen, werden innovative ethnografische Methoden in der Form von digitalen hybriden Arbeitstagebüchern (Diaries) und Arbeitsvisualisierungsmethoden entwickelt und angewandt. Im Kontext des SPP2267 trägt unsere Arbeit zum Verständnis auf der Mikro- und Mesoebene bei, indem wir untersuchen, wie Transformationen von Technologien, Arbeitspraktiken und Routinen für Einzelpersonen, Arbeitsgruppen und Organisationen entstehen. In Bezug auf die drei Bewegungsdynamiken adressieren wir alle drei Heuristiken. Hierfür untersuchen wir, wie 1) Arbeitspraktiken den Einsatz von Kollaborationstechnologien zur Organisation und Koordination der täglichen Arbeit gestalten und prägen (Durchdringung), 2) Organisationen ihre Kollaborationsplattformen aufbauen und Kollaborationstechnologien eingeführt und in Organisationen verbreitet werden (Verfügbarmachung) und 3) sich Arbeitspraktiken entwickeln und ob sie (oder ob sie nicht) standardisiert und als Arbeitsroutinen auf Organisationsebene eingebettet werden (Verselbständigung). Wir erweitern die Interdisziplinarität unserer Untersuchungen, indem wir Methoden, Datensätze und Fallstudien in die geplante gemeinsame Arbeit mit WZB, Uni Bielefeld und TU Berlin einbringen.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/442171294"
  },
  {
    "title": "SPP 2267: \r\n        Digitalisierung der Arbeitswelten. Zur Erfassung und Erfassbarkeit einer systemischen Transformation",
    "abstract": "Das Schwerpunktprogramm 2267 (SPP) untersucht die Digitalisierung der Arbeitswelten als systemische Transformation, die das Institutionensystem der Arbeitsgesellschaft grundlegend und nachhaltig verändern könnte. Ziel ist es, diese Transformation als ein Zusammenspiel dreier Dynamiken zu erforschen, in denen dieser sozio-technische Wandel a) gesellschaftlich vorbereitet, b) technisch ermöglicht und c) diskursiv verhandelt und sozial bewältigt wird. Das PP untersucht die gesellschaftlichen Bedingungen und Gestaltungsmöglichkeiten der aktuellen Digitalisierung der Arbeitsgesellschaft sowie die Dynamiken und Folgen. Ziel ist die interdisziplinäre Verknüpfung sozial-, wirtschafts- und geschichtswissenschaftlicher Perspektiven auf neue Konfigurationen von Arbeit und Technik, auf vielschichtige Dynamiken des Wandels und auf sich verändernde Formen und Orte der Wertschöpfung. Aufgabe des Koordinations- und Synergieprojekts (KSP) ist es, die organisatorische Infrastruktur zu schaffen und zu managen, die zur Erreichung der Gesamtziele des SPP in der 2. Phase ermöglicht. Das KSP unterstützt das SPP maßgeblich mit originären Forschungsbeiträgen. Um dies nachhaltig zu gewährleisten, werden die administrativ-organisatorischen Ziele der Koordination und die theoretisch-methodischen Ziele eng miteinander verknüpft und in einem integrativ-interdisziplinären Ansatz verfolgt. Das KSP versteht sich koordinierende Einheit und als methodisch und theoretisch synergiefördernde Einheit. Die Synergieziele sind tief in die Koordinationsziele integriert. Das KSP identifiziert Anknüpfungspunkte zwischen einzelnen Projekten und über Förderphasen hinweg und entwickelt Strategien für deren interdisziplinäre Erarbeitung. Es gilt, dafür zu sorgen, dass jedes Einzelprojekt sowie das PP-Netzwerk im Ganzen über die Inhalte, die Strukturen und die Methoden verfügt, die für die gemeinsame Aufgabe der interdisziplinären Theoriebildung benötigt werden. Die inhaltliche Arbeit des KSP liefert theoretische und methodische Grundlagen, damit Einzelprojekte die Digitalisierung der Arbeitswelten als systemische Transformation erfassen und konzeptualisieren können. Die grundsätzliche Aufgabe des ZDA, die inter- und transdisziplinäre Koordination und Synergie innerhalb des PP und über beide Förderperioden hinweg zu realisieren, wird durch die Fokussierung folgender Ziele erreicht: (1) Schaffung von nach innen gerichteten Strukturen innerhalb des PP zur Förderung der interdisziplinären Zusammenarbeit; (2) Förderung und Sicherung der inter- und transdisziplinären Sichtbarkeit des PP; (3) Initiierung und Koordination von Strukturen der akademischen Selbstverwaltung und Peer Leadership innerhalb des PP; (4) Förderung des wissenschaftlichen Nachwuchses; (5) Sicherstellung der Chancengleichheit innerhalb des PP.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/422743478"
  },
  {
    "title": "2D Kartendarstellungen zur Unterstützung neurochirurgischer Eingriffe",
    "abstract": "Zur Planung komplexer chirurgischer Eingriffe werden 3D Modelle relevanter anatomischer und pathologischer Strukturen eingesetzt. Diese Modelle wurden in erster Linie für die präoperative Operationsplanung entwickelt. Aufgrund der häufig sehr hohen geometrischen Komplexität und des damit verbundenen Interpretations- und Interaktionsaufwandes für den Betrachter kann das Potenzial von 3D Modellen während chirurgischer Eingriffe leider nur eingeschränkt ausgeschöpft werden.Im Rahmen eines 12-monatigen Forschungsaufenthaltes am Surgical Planning Laboratory, Department of Radiology, Brigham and Womens Hospital, Harvard Medical School, Boston, USA soll dieses Problem genauer am Beispiel neurochirurgischer Eingriffe untersucht werden. Hierbei soll ein neues Verfahren zur 2D Kartendarstellung für die Navigationsunterstützung bei neurochirurgischen Eingriffen konzipiert, entwickelt und evaluiert werden. Während der Konzept- und Prototypentwicklung werden potentielle Nutzer einer solchen Methode in Form eines nutzerzentrierten Entwicklungsprozesses eingebunden. Hierbei wird eine enge Zusammenarbeit mit den Neurochirurgen am Brigham and Womens Hospital, insbesondere mit dem Neurosurgical Brain Mapping Laboratory angestrebt. Dies betrifft die Analyse und Definition von Anforderungen und die Evaluierung der Methoden in einer klinischen Umgebung. Während des Forschungsaufenthaltes sollen Algorithmen erforscht werden, welche klassifizierte, gewichtete neurochirurgische Daten für eine 2D Kartendarstellung bereitstellen. Aufbauend hierauf wird ein Prototyp zur Visualisierung relevanter neurochirurgischer Daten in Form einer 2D Kartenerstellung erstellt.Die Ergebnisse des Projektes sollen Erkenntnisse darüber liefern, welchen zusätzlichen Nutzen die neuen 2D Darstellungstechniken gegenüber konventionellen Visualisierungstechniken liefern. Insbesondere soll ermittelt werden, welche Visualisierungsparameter zielführend für präzise und sichere neurochirurgische  Interventionen sind. Die Erkenntnisse könnten genutzt werden, um die visuelle Navigationsunterstützung für neurochirurgische Eingriffe zu verbessern und das Risiko zukünftiger medizinischer Eingriffe zu reduzieren. Die Ergebnisse würden außerdem eine wichtige Grundlage für nachfolgende Studien im Bereich intraoperative Visualisierung liefern.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/348271461"
  },
  {
    "title": "3-D-Akquisition komplexer Hohlräume mit flexiblen Endoskopen\r\n\r\n\r\n          (A 07)",
    "abstract": "Keine Zusammenfassung vorhandenDFG-VerfahrenSonderforschungsbereicheTeilprojekt zuSFB 603: \nModellbasierte Analyse und Visualisierung komplexer Szenen und SensordatenAntragstellende InstitutionFriedrich-Alexander-Universität Erlangen-NürnbergTeilprojektleiterProfessor Dr. Heinz  Gerhäuser;Professor Dr.-Ing. Gerd  Häusler;Dr.-Ing. Thomas  Wittenberg",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/5418214"
  },
  {
    "title": "SFB 603: \r\n        Modellbasierte Analyse und Visualisierung komplexer Szenen und Sensordaten",
    "abstract": "Langfristiges gemeinsames Ziel der Teilprojekte im Sonderforschungsbereich 603 ist die Entwicklung und theoretische  Fundierung neuer systematischer Lösungsansätze und ihre Erprobung  anhand praktischer Problemstellungen aus den BereichenBildverarbeitung und Computergraphik. Die neuen Lösungsansätze sollenlangfristig zu übergreifenden, möglichst einheitlichen und praktisch erprobten Methodiken für Analyse und Entwurf von Systemen führen, die Bilder, Sensordatensätze und Szenenbeschreibungen von realistischer Komplexität interpretieren und visualisieren. Auf dem Weg zu diesem Ziel hat der Sonderforschungsbereich erste Erfolge in der ersten Förderungsperiode erzielt, sodass das Ziel realistisch ist. Hier seien als Beispiele die theoretisch fundierte Verzahnung von Datenaufnahme und Flächenapproximation, die neuen Ansätze zur probabilistischenModellierung sowie die Ausstrahlung neuer Modellierungsansätze auf andere Teilprojekte und die Integration von Simulation, automatischer Analyse von Ergebnissen und Visualisierung genannt. Darüber hinaus  haben sich in den drei Projektbereichen die gemeinsamen Grundkonzeptionen für die Vorgehensweise stabilisiert. Ein zentraler  Forschungsschwerpunkt ist die Entwicklung und Untersuchung von unterschiedlichen Modelltypen für verschiedene geometrische Strukturen, die auch die drei Projektbereiche bilden. Diese Methodiken werden in gemeinsamen Projekten aus verschiedenenFakultäten und Disziplinen praktisch erprobt: Die Umsetzung dererarbeiteten Grundlagen zur Analyse und Visualisierung von Sensordatenfinden in Technik und Medizin statt.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/5482283"
  },
  {
    "title": "3D L2S-Mikroskopie für ungefärbte Zellhaufen",
    "abstract": "Das beantragte Teilprojekt untersucht die zeitaufgelöste 3D-Aufnahme von Zellhaufen, und erarbeitet damit eines der adaptiven Learning-to-Sense (L2S) Sensorsysteme zur gemeinsamen Optimierung der Systemparameter und des Rekonstruktionsalgorithmus.Das Teilprojekt beschäftigt sich mit der Anwendung der L2S Basistechniken zum Zwecke ihrer Validierung und der Bewertung ihres jeweiligen Nutzens in der Mikroskopie, speziell der dreidimensionalen, zeitaufgelösten Mikroskopie von Zellhaufen in natürlichem Zustand. Diese Anwendung hat höchste Relevanz in der Biomedizin und kann dazu beitragen, künftige personalisierte Behandlungen für schwerwiegende Erkrankungen wie verschiedene Krebsformen oder neurodegenerative Erkrankungen zu ermöglichen. Das Ziel innerhalb des Gesamtprojektes ist es, eine anspruchsvolle Anwendung mittels der neuen L2S Techniken umzusetzen und die Entwicklung letzterer damit zielführend zu begleiten. Wir planen die Konstruktion einer flexiblen mikroskopischen Experimentalplattform, die allein mittels Software signifikant in ihren optischen Eigenschaften verändert werden kann. Dieses bildet dann die Grundlage für eine Optimierung der Abbildungseigenschaften mittels der L2S-entwickelten Methodik. Es geht insbesondere nicht um die Optimierung von Einzelbildern die einem normalen optischen Bild entsprächen, sondern um eine möglichst wahrheitsgetreue, direkte  Rekonstruktion der dreidimensionalen Objektdaten, d.h. der Brechindexverteilung und der Verteilung der Absorptionskoeffizienten der Probe, aus mittels KI gesamtoptimierten, hybriden Hardware/Software-Systemen. Die fundamentale Fragestellung dieses Unterprojektes lautet: Ist es in der zeitaufgelösten 3D Mikroskopie ungefärbter Zellhaufen möglich, mittels gezielt angepasster KI Methoden und Hardware/Software Co-Design, in neue Performanzbereiche vorzustoßen, bzw. die Sphäre der Anwendbarkeit (z.B. Sampledicke, kombinierte Beugung und Absorption) signifikant zu erweitern ?Aus dieser Fragestellung und ihrer Konkretisierung ergeben sich die vier Arbeitsbereiche des Teilprojekts: 1. Trainingsdaten-Generierung, Ground Truth-Entwicklung und Probenacquise, 2. Modellierung, System-Simulation und differenzierbarer Digital Twin der Hardware-Komponente, 3. Konstruktion, Validierung und Kalibrierung der Experimentalplattform und 4. L2S-Anwendung für die zeitaufgelöste, dreidimensionale Brechindex- und Absorptionsmikroskopie. Hierbei sind ein Kompentenzaustausch mit dem Teilprojekt P5 (Andreas Kolb) zur Realisierung des Digital Twin und eine enge Zusammenarbeit mit den Teilprojekten P1 (Michael Möller), P2 (Margret Keuper) und P3 (Volker Blanz) zur Erarbeitung der KI-Komponenten des Systems vorgesehen.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/498555818"
  },
  {
    "title": "FOR 5336: \r\n        KI-FOR Lernen optimaler Bilddatensensorik",
    "abstract": "Das vergangene Jahrzehnt hat gezeigt, dass eine große Mehrheit von Visual Computing Problemen eine signifikant bessere Lösung zulassen, wenn die vollständige visuelle Datenanalyse in einem Schritt gelernt wird: Die Ära des Deep Learnings hat so vorherige sequentielle Datenverarbeitungsansätze, in denen geeignete Merkmale per Hand modelliert und in einem zweiten Schritt ein Lernverfahren für die Analyse bzw. Klassifikation verwendet wird, nahezu vollständig abgelöst. Dieses sogenannte end-to-end Lernen betrachtet jedoch die von einem Sensorsystem gelieferten Bilddaten als Anfang der Prozesskette. Diese Betrachtung vernachlässigt, dass die Bilddaten selbst das Resultat eines vorgelagerten Prozesses mit vielen Designentscheidungen und adaptiven Kontrollmöglichkeiten im zugrundeliegenden Sensorsystem sind. Entsprechend stellen auch heutige end-to-end Lernverfahren im Wesentlichen noch sequentielle Verfahren dar, in denen zunächst ein Sensorsystem entworfen und, in einem zweiten separaten Schritt, die damit aufgenommenen Daten anschließend analysiert werden. Das Ziel der \"Learning to Sense\" (L2S) Forschungsgruppe ist es, die Designparameter des Sensorsystems gemeinsam mit dem für die Analyse zuständigen Netzwerk für konkrete Aufgaben zu optimieren. Hierzu wird eine durchgängige end-to-end Methodik für das maschinelle Lernen von Sensorsystemen entstehen, die für spezifischen Nutzungsanwendungen optimiert sind. Entsprechend wird das L2S Projekt Grundlagenforschung in beiden Bereichen, der Sensorsystementwicklung und dem maschinellen Lernen, durchführen: Sensorsysteme müssen adaptiv gestaltet werden, um vielversprechende Freiheitsgrade für die Optimierung zu generieren, und Methoden des Maschinellen Lernens müssen so entwickelt werden, dass Parameter eines neuronalen Netzwerkes gemeinsam mit adaptiven Sensorsystemparametern optimiert werden können. Langfristig entsteht so eine neue Methodik für die gemeinsame Entwicklung von Sensorsystemen und datenanalysierenden Netzwerken mit optimalen Charakteristiken für konkrete Aufgaben. Die resultierenden Systeme werden eine substantiell effizientere und präzisere Szenenanalyse erlauben und manuelle Eingriffe in Designentscheidungen des Sensorsystems minimieren.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/459284860"
  },
  {
    "title": "3D-Modelling of seafloor structures from ROV-based video sequences",
    "abstract": "Bei der Rekonstruktion von Strukturen auf dem Meeresboden oder anderen Anwendungen von Computer Vision auf Unterwasserbildern wird trotz Lichtbrechung am Glas des Unterwassergehäuses normalerweise das perspektivische Kameramodell verwendet [SK11]. Es kann gezeigt werden, dass das Modell, welches eine Zentralperspektive voraussetzt, aufgrund der Lichtbrechung ungültig ist. Obwohl dieser Effekt seit einer Weile bekannt ist, gibt es kein Structure-from-Motion System (SfM System), welches die Lichtbrechung explizit berücksichtigt. Daher besteht das Ziel dieses Projektes darin, ein nicht-perspektivisches Kameramodell zu entwickeln und seine Genauigkeit mit dem herkömmlichen, perspektivischen Modell zu vergleichen. Vorbereitende Arbeiten in der ersten Projektphase haben schon gezeigt, dass bei Verwendung des perspektivischen Models zur Rekonstruktion eines Kamerapfades der systematische Modellfehler zu einem Fehler in der Poseschätzung führt [SK11]. Wir erwarten, dass die Benutzung des korrekten physikalischen Modells zur Lichtbrechung zu verbesserten Kameramodellen führt, mit denen der systematische Modellfehler eliminiert werden kann. Die resultierenden 3D Modelle können zur verbesserten Vermessung von Strukturen auf dem Meeresboden verwendet werden.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/68506282"
  },
  {
    "title": "3D-Oberflächenrekonstruktion",
    "abstract": "Der Schwerpunkt des Teilprojekts P5 liegt in der Berechnung dichter, hoch-aufgelöster 3D Rekonstruktionen aus den verfügbaren Bilddaten. Zu diesem Zweck wird ein zweigeteilter Ansatz verfolgt: (1) Direkt auf dem Flugroboter wird aus den Bilddaten der Stereo-Kamerasysteme eine semidichte 3D Rekonstruktion berechnet. Sie wird inkrementell im Videotakt erzeugt und erzielt durch die Nutzung der statistischen Unsicherheit der Trajektorien und Bildinformation eine hohe Konsistenz.(2) Auf der Bodenstation wird, auf Basis der semidichten 3D Rekonstruktion sowie der hoch-aufgelösten Bilddaten des Hauptsensors ein dichtes, hoch-genaues 3D Modell berechnet. Ausgehend von 3D-Punkten der Bündelausgleichung (structure from motion) und des Lasersanners werden dichte Tiefenkarten erzeugt und fusioniert. Dabei geht es in Phase II vor allem um die Robustifizierung der Oberflächenrekonstruktion, um mit Störungen (Spiegelungen, homogenen Oberflächen, Überbelichtungen) zuverlässig umgehen zu können. Ein wesentlicher Vorteil dieser Aufteilung ist die Möglichkeit, direkte auf der Fusion vieler small-baseline Stereo-Vergleiche basierende 3D Rekonstruktions-Methoden einzusetzen und damit Rekonstruktionen im Videotakt realisieren zu können. Damit wird eine rudimentäre Selbstlokalisierung und 3D Rekonstruktion auf dem Flugroboter möglich, die nicht auf die Kommunikation mit der Bodenstation angewiesen ist.Die resultierende semidichte 3D Rekonstruktion kann dabei zur adaptiven Blickpunkt-Planung benutzt werden, es kann also bereits während des Fluges erkannt werden für welche Bereiche der Geometrie nicht genügend visuelle Informationen verfügbar sind. Diese Informationen können daraufhin eingesetzt werden um die Flugbahn entsprechend anzupassen und die Exploration zu steuern.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/200549338"
  },
  {
    "title": "FOR 1505: \r\n        Mapping on Demand",
    "abstract": "In unbekannten Umgebungen ist die Vorabspezifikation einer Trajektorie zur Aufnahme eines Gebäudes oder Objekts im Allgemeinen nicht möglich, da die grobe Geometrie nicht gegeben ist. Daher muss ein Kopter online während des Fluges entscheiden, wo welche Aufnahmen von welchem Blickwinkel aus gemacht werden sollen. In einem iterativen Prozess muss die Plattform neue Explorationsziele identifizieren, diese anfliegen und somit die Karte aktualisieren. Dies geschieht mit dem Ziel die Unsicherheit in der Karte sowie in der Lokalisierung des Kopters zu minimieren. Im Vergleich zu autonomen Systemen sind wir Menschen sind in der Lage, eine große Anzahl von Aufgaben effektiv zu bearbeiten. Unter anderem liegt dies daran, dass wir auf Hintergrundwissen  zurückgreifen können, welches wir im Laufe des Lebens gelernt haben. Die Idee dieses Projekts ist es, Hintergrundwissen, welches für die autonome Exploration hilfreich ist, einem autonomen Kopter verfügbar zu machen. Es ist das Ziel dadurch die Effektivität der Plattform zu erhöhen und bessere Karten berechnen zu können. Damit ist der Fokus des Projekts P8 die Entwicklung von effektiven Explorationsstrategien für fliegenden Plattformen, so dass auf Basis der auf der Plattform berechneten Flugtrajektorien geeignete Modelle der Umgebung bzw. des zu explorierenden Objektes erstellt werden können. Dabei kommen informationstheoretische Konzepte zum Einsatz, durch die versucht wird, die Unsicherheit über den Zustand der Welt durch die Wahl des nächsten Beobachtungspunktes zu minimieren. Wir entwickeln dabei Verfahren, die auf Techniken wie dem  erwartenden Informationsgewinn basieren. Eine zentrale Herausforderung ist dabei, die - in ihrer allgemeinen Form - kaum berechenbaren informationstheoretischen Ansätze durch geeignete Approximationen berechenbar zu machen.  Wir glauben, dass Hintergrundwissen eine Möglichkeit darstellt, den erwarteten Informationsgewinn von neuen Observationen effizient abzuschätzen zu können. Im Vergleich zu vielen existierenden Explorationssystemen fokussiert sich dieses Projekt auf die effektive Nutzung von Hintergrundinformationen und bekanntem aber möglicherweise veraltetem Wissen. Wir werden dabei erforschen, welche Form von Hintergrundwissen sich besonders für die Exploration eignet.  Es ist geplant, mit diesem Wissen eine bessere Approximationen der informationstheoretischen Ansätze zu realisieren. Dadurch sind effektivere Explorationsstrategien als die heute existierenden zu erwarten.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/166047863"
  },
  {
    "title": "3D-Planung, Navigation und Roboterassistenz bei komplexen Schädelbasiszugängen",
    "abstract": "Operationen von Tumoren oder vaskulären Läsionen der Schädelbasis gehören zu den technisch anspruchsvollsten neurochirurgischen Eingriffen. Die historisch hohe Morbidität dieser Eingriffe kann durch Anwendung spezieller Zugänge gesenkt werden, die eine knöcherne Resektion entlang bestimmter Korridore zwischen Nerven und Gefäßen an der Schädelbasis vornehmen. Die dazu nötigen milimetergenauen Fräsarbeiten werden oft intuitiv und auch bei großer Erfahrung des Operateurs selten optimal ausgeführt, so dass hier klinisches Potenzial besteht, über einen milimetergenauen Zugangsweg eine Verbesserung des Operationsergebnisses zu erreichen. Es ist Ziel, innerhalb des Antragszeitraumes ein klinisch einsatzfähiges System zu entwickeln, das es erlaubt, präoperativ nach der individuellen Anatomie und Pathologie die für einen idealen Zugangsweg nötige Knochenresektion zu planen und darauf basierend die intraoperativen Fräsarbeiten robotergestützt durchzuführen. Das beantragte Projekt soll auf der Grundlage der vorhandenen Infrastruktur eines Operationsroboters 'Evolution 1' und einer interdisziplinären Kooperation der Fachgebiete Neurochirurgie und Ingenieurwissenschaft bzw. Informatik von Partnern mit auswiesenen Erfahrungen und Vorarbeiten auf diesem Gebiet durchgeführt werden.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/5347886"
  },
  {
    "title": "SPP 1124: \r\n        Medizinische Navigation und Robotik",
    "abstract": "Keine Zusammenfassung vorhandenDFG-VerfahrenSchwerpunktprogrammeProjekte3D-Planung, Navigation und Roboterassistenz bei komplexen Schädelbasiszugängen(AntragstellerRaabe, Andreas)3D-Planung, Navigation und Roboterassistenz bei komplexen Schädelbasiszugängen(AntragstellerKalender, Willi A.)Bildanalyse und Visualisierung für die computergestützte Planung und intraoperative Unterstützung von HNO-chirurgischen Eingriffen(AntragstellerPreim, Bernhard;Strauß, Gero)Bildanalyse und Visualisierung für die computergestützte Planung von HNO-chirurgischen Eingriffen(AntragstellerStrauß, Gero)Bildgestützte Navigation eines Laserstrahls zur mikrochirurgischen Knochenablation an der lateralen Schädelbasis(AntragstellerHering, Peter;Klenzner, Thomas;Wörn, Heinz)Computergestützte Planung und Navigation neurochirurgischer Eingriffe an der Wirbelsäule(AntragstellerDillmann, Rüdiger)Computergestützte Planung und Navigation neurochirurgischer Eingriffe an der Wirbelsäule(AntragstellerSpetzger, Uwe)Ein Navigationssystem zur Leistungssteuerung chirurgischer Instrumente für die Mund-, Kiefer- und Gesichtschirurgie(AntragstellerLüth, Tim C.)Einsatz eines interaktiven navigierten Robotersystems in der endoskopischen Neurochirurgie(AntragstellerWahrburg, Jürgen)Entwicklung eines handgehaltenen Operationsroboters zur Bearbeitung von Knochen(AntragstellerScharf, Hanns-Peter)Entwicklung eines handgehaltenen Operationsroboters zur Bearbeitung von Knochen(AntragstellerMänner, Reinhard)Entwicklung eines Systems zur navigierten und roboterunterstützten Frakturfixation(AntragstellerNerlich, Michael)Entwicklung eines Systems zur navigierten und roboterunterstützten Frakturfixation(AntragstellerMonkman, Ph.D., Gareth)Individuelle anatomische Implantation von Schulterendoprothesen durch ultraschallbildvolumenbasierte präoperative Planung und intraoperative Navigation(AntragstellerOverhoff, Heinrich Martin)Individuelle anatomische Implantation von Schulterendoprothesen durch ultraschallbildvolumenbasierte präoperative Planung und intraoperative Navigation(AntragstellerRühmann, Oliver)Kombination von virtueller und optisch-navigierter Endoskopie in der Neurochirurgie und in der Mund-, Kiefer- und Gesichtschirurgie(AntragstellerFreudenstein, Dirk;Hoffmann, Jürgen;Straßer, Wolfgang)Kombination von virtueller und optisch-navigierter Endoskopie in der Neurochirurgie und in der Mund-, Kiefer- und Gesichtschirurgie(AntragstellerHoffmann, Jürgen)Kombination von virtueller und optisch-navigierter Endoskopie in der Neurochirurgie und in der Mund-, Kiefer- und Gesichtschirurgie(AntragstellerFreudenstein, Dirk)Mastoid-Control: Ein mechatronisches Assistenzsystem für die Felsenbein-Chirurgie(AntragstellerDietz, Andreas;Lüth, Tim C.)Minimal-invasive navigations- und roboterassistierte Revisions-Hüftendoprothetik auf der Basis multimodaler intraoperativer Geometrieerfassung(AntragstellerWirtz, Dieter Christian)Minimal-invasive navigations- und roboterassistierte Revisions-Hüftendoprothetik auf der Basis multimodaler intraoperativer Geometrieerfassung(AntragstellerRadermacher, Klaus)Minimalinvasive robotergestützte Implantation von Pfannen- und Femurkomponenten beim Totalersatz des Hüftgelenks(AntragstellerWahrburg, Jürgen)Minimalinvasive robotergestützte Implantation von Pfannen- und Femurkomponenten beim Totalersatz des Hüftgelenks(AntragstellerWahrburg, Jürgen)Navigierte Bildgebung und Positionssteuerung für das Fräsen in der Neurochirurgie(AntragstellerHein, Andreas)Navigierte Bildgebung und Positionssteuerung für das Fräsen in der Neurochirurgie(AntragstellerLüth, Tim C.)Navigierte dreidimensionale Überblendung von Modellen des Situs im Operationsmikroskop bei neurochirurgischen Eingriffen(AntragstellerWörn, Heinz)Navigierte dreidimensionale Überblendung von Modellen des Situs im Operationsmikroskop bei neurochirurgischen Eingriffen(AntragstellerKunze, Stefan)Operationsplanung für minimal traumatische Operationen an der laterlalen Schädelbasis(AntragstellerSchipper, Jörg;Wörn, Heinz)Roboterassistierte und optisch kontrollierte Insertion einer Cochlear Implant Elektrode(AntragstellerBokemeyer, Martin;Heimann, Bodo;Majdani, Omid)Robotergestützte Kraniotomie mit und ohne individuell vorbereiteter Sofortrekonstruktion(AntragstellerEufinger, Harald;Radermacher, Klaus)Robotergestützte Kraniotomie mit und ohne individuell vorbereiteter Sofortrekonstruktion(AntragstellerRadermacher, Klaus)Robotergestützte Navigation zum Fräsen an der lateralen Schädelbasis(AntragstellerPlinkert, Peter K.)Robotergestützte Navigation zum Fräsen an der lateralen Schädelbasis(AntragstellerHenrich, Dominik;Plinkert, Peter K.)Schritthaltende markerlose Lageverfolgung und 4D Behandlungsplanung in der Strahlentherapie(AntragstellerSchweikard, Achim)VR-gestützte Robotersteuerung für die Mikrochirurgie von medizinischen Mensch-Maschine-Schnittstellen des Kopfes(AntragstellerMaassen, Marcus Matthias)SprecherProfessor Dr.-Ing. Achim  Schweikard",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/5471335"
  },
  {
    "title": "3D-Planung, Navigation und Roboterassistenz bei komplexen Schädelbasiszugängen",
    "abstract": "Keine Zusammenfassung vorhandenDFG-VerfahrenSchwerpunktprogrammeTeilprojekt zuSPP 1124: \nMedizinische Navigation und Robotik",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/5347890"
  },
  {
    "title": "3d-Puzzle-Problem",
    "abstract": "Die Rekonstruktion von (zerbrochenen) Objekten aus Einzelteilen ist in vielen wichtigen Bereichen, wie zum Beispiel der Archäologie, Medizin, Bioinformatik und Robotik von maßgeblicher Relevanz. So müssen in der Archäologie historische Artefakte rekonstruiert, in der Chirurgie gebrochene Knochen repositioniert und fixiert, in der Bioinformatik Proteine zusammengesetzt und in der Robotik Bauteile zusammengebaut werden. Das Ziel dieses Antrags ist es, grundlegende Konzepte in den Bereichen Bildverarbeitung, 3d-Computer-Sehen und Mustererkennung zu entwickeln, um zu einer automatischen Lösung des 3d-Puzzle-Problems zu gelangen. Die digitalisierten Fragmente sollen virtuell zusammengesetzt und somit ein 'Bauplan' generiert und visualisiert werden. Der zu entwickelnde Ansatz soll durch eine 'coarse-to-fine'-Strategie auf effiziente Weise mehrere Fragmente ohne vorhandenes Wissen über eine Initiallösung zusammenfügen. Hierbei soll eine möglichst hohe Robustheit gegenüber Rauschen, Schädigungen und Materialverschleiß erreicht werden. Des Weiteren soll untersucht werden auf welche Weise Vorwissen über zerbrochene Objekte (z.B. über Form, Symmetrien, Oberflächenstruktur von Frakturfläche vs. intakter Oberfläche, etc.) genutzt werden kann, um die Effizienz, Genauigkeit und Robustheit zu erhöhen. Neben diesen 3d-Puzzle-Problemen findet das automatische Anpassen von Oberflächendaten (engl. 'surface matching') auch in vielen anderen wichtigen Bereichen des 3d-Computer-Sehens Anwendung. Das Anwendungsfeld umfasst die Erkennung, Klassifizierung und Lageschätzung von Objekten im Raum, sowie die Registrierung oder Fusion von Daten unterschiedlicher Sensoren.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/5448203"
  },
  {
    "title": "3D+t Terabyte Bildanalyse",
    "abstract": "Im Fokus des Projekts steht die Entwicklung von Algorithmen für die Analyse von Zeitreihen hochauflösender 3D-Bilder. Das Ziel sind neue Bildanalysemethoden, die sowohl hohe Qualität als auch Recheneffizienz gewährleisten und die Möglichkeiten moderner Hardware effizient ausnutzen. Als exemplarisches Anwendungsgebiet wird das Objekttracking in Mikroskopbildern untersucht, in denen mehrere Objektklassen (z.B. Zellkerne, Zellplasma, Nanopartikel) durch verschiedenfarbige Fluoreszenzfarbstoffe markiert sind. Solche Trackingprobleme sind von entscheidender Bedeutung in der entwicklungsbiologischen Forschung, weil bisherige Berechnungsansätze nur einen Bruchteil der enthaltenen Informationen aus den aufgezeichneten Datensätzen mit mehreren Terabytes extrahieren können. Dieses spezielle Anwendungsgebiet wird als prototypischer Fall betrachtet, wie ein gezieltes Engineering von Algorithmen für große Datenmengen ein Anwendungsgebiet umfassend bereichern kann. Die vorgeschlagene Strategie besteht darin, hochperformante Algorithmen (z.B. Graphenalgorithmen) für die Extraktion von 3D-Objekten mit zugehörigen Unsicherheitsinformationen einzusetzen. Dieses Vorgehen bewirkt eine große Datenreduktion, so dass Trackingalgorithmen die globalen Unsicherheitsinformationen zu einem konsistenten Endergebnis integrieren können. Die Schätzung und Propagierung von Unsicherheiten innerhalb der extrahierten Informationen soll durchgehend mit Fuzzy-Logik erfolgen. Für den erfolgreichen Einsatz sind signifikante Fortschritte bei der Modellierung und Propagierung von Unsicherheiten, beim Generalisieren von 2D-Algorithmen für 3D-Szenarien sowie beim Entwurf paralleler Algorithmen für hierarchische Speicher notwendig. Einige der Teilprobleme wurden bislang nie systematisch untersucht, beispielsweise wie eine klassische Bildverarbeitungspipeline mit Bildvorverarbeitung, Vordergrunderkennung und Segmentierung einen Graph potenzieller Objekte (z.B. Zellkerne) erzeugen kann, dessen Kanten mögliche Bewegungen oder Teilungen von Objekten repräsentieren. Um dann die Entwicklung eines vollständigen Organismus abzubilden, muss nachfolgend der wahrscheinlichste Teilgraph aus diesem Graphen extrahiert werden. Bislang ist die Formulierung eines solchen Problems als wohldefiniertes Optimierungsproblem ungelöst, erst recht dessen effiziente Lösung mit nachweisbar hoher Qualität.Die Leistungsfähigkeit der entwickelten Methoden soll an realen Datensätzen von Zebrabärblingsembryos demonstriert werden, die durch Lichtscheibenmikroskopie innerhalb der ersten 24 Stunden ihrer Entwicklung beobachtet werden. Solche Datensätze erreichen Größen über 10 Terabyte pro Embryo, was zwei Größenordnungen über der Leistungsfähigkeit bisher vorgeschlagener konkurrierender Algorithmen liegt. Zusätzlich sollen Benchmarkdatensätze mit vergleichbarer Struktur erzeugt und analysiert werden, bei denen die wirklichen Objektbewegungen bekannt sind, um eine quantitative Bewertung der Ergebnisse zu gestatten.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/268484869"
  },
  {
    "title": "Textvergrößerung und Kontrastanpassung",
    "abstract": "Durch die Bereitstellung eines VR-Raumes mit der Möglichkeit der haptischen Interaktion werden Forschungsprojekte, bei denen in erster Linie die Kommunikation zwischen Mensch und Maschine im Vordergrund stehen, am Lehrstuhl der Graphischen Datenverarbeitung in angemessenem Umfang gefördert. Hier ist insbesondere das internationale HAPTEX-Projekt zu nennen, dessen Hauptfokus auf dem Erfühlen von virtuellen Textilien liegt. Mit Hilfe der Visualisierungs- und Rechenleistung des VR-Raumes stehen zukünftig genügend Kapazitäten bereit um die intensiven Echtzeit-Berechungen voranzutreiben. Weiterhin wird der Einsatz dieses VR-Systems die Forschungsaktivitäten des Fachgebietes im interdisziplinären „International Center of Computational Engineering Sciences“ (ICCES) und im dazugehörigen DFG Graduiertenkolleg (GRK 615) stärken. Des Weiteren wird durch die Bereitstellung des IBM „BladeCenter“-Servers mit CELLProzessoren die Darstellung rechenintensiver Visualisierungsprobleme, wie z.B. physikalischer Echtzeitsimulationen, erst ermöglicht. Die experimentellen Möglichkeiten des VR-Raumes ergänzen die im Fachgebiet laufenden theoretisch mathematischen Untersuchungen in diesem Umfeld in plastischer, höchst eindrucksvoller Weise.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/77657540"
  },
  {
    "title": "4D-YouTube: 4D-Rekonstruktion aus Gelegenheitsvideos mit tiefen raum-zeitlichen Repräsentationen",
    "abstract": "Während sich die kamerabasierte Rekonstruktion rasant entwickelt hat, bleibt die Rekonstruktion dynamischer Welten aus Gelegenheitsvideos, wie sie auf Plattformen wie YouTube zu finden sind, eine große Herausforderung. In diesem Projekt werden wir diese Herausforderung in drei Stufen angehen:  Erstens werden wir einen Ansatz für das metrische Lernen von Multiview-Repräsentationen entwickeln.  Zweitens werden wir unkalibrierte visuelle SLAM-Techniken für statische Welten entwickeln, die existierende SLAM-Methoden so verallgemeinern, dass sie für Kameras mit unbekannter Kalibrierung einsetzbar werden.  Und drittens werden wir diese Methoden auf die Rekonstruktion dynamischer Welten verallgemeinern, in denen die 3D-Bewegung von Objekten in der Welt mit Hilfe gewöhnlicher Differentialgleichungen dargestellt wird.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/555335814"
  },
  {
    "title": "4Rs: Reliable and Recoverable Runtime Reconfigurable System",
    "abstract": "Für viele autonome Systemen mit langen Einsatzzeiten sind Navigations-, Kommunikations- und Rechner- Systeme von entscheidender Bedeutung (z.B. in der Raumfahrt, Meteorologie oder in unterirdischen Systemen). In diesen Domänen ist die Nutzung rekonfigurierbarer Hardware, z.B. Field-Programmable Gate Arrays (FPGAs), weit verbreitet. Allerdings besitzen diese Systeme oft strenge Zuverlässigkeitsanforderungen. Eine Anhäufung von Störungen kann zu Abbrüchen oder Datenkorruption führen, was in katastrophalen Ausfällen enden kann. Daher gefährdet die Anfälligkeit moderner FPGAs gegenüber diversen Ausfallmechanismen, wie etwa Soft Errors durch Strahlung, Transistoralterung, verborgene Herstellungsdefekte sowie eine höhere Rauschempfindlichkeit, die Zuverlässigkeit von Mission-Critical Systemen. In diesem Antrag verfolgen wir deshalb hochzuverlässige, hochverfügbare und wiederherstellbare Systeme, die auf dynamisch-rekonfigurierbaren Plattformen basieren. Wir planen die Entwicklung einer solchen Plattform mit mehreren FPGAs um permanente (harte), temporäre (weiche) sowie Timing-Fehler (Alterung) tolerieren zu können. Wir beabsichtigen außerdem effiziente Methoden zur Fehler- und Alterungserkennung, Fehlerlokalisierung, Umgehung von gealterten bzw. fehlerhaften Bereichen mit Hilfe einer Rekonfiguration oder Wiederherstellung durch die Ausnutzung der Programmierbarkeit, Regularität und Rekonfigurierbarkeit moderner FPGAs, zu erstellen.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/215353172"
  },
  {
    "title": "5D Adaptive Abtastung für Lichtfelder (FiDALiS)",
    "abstract": "Durch die enorm gestiegene örtliche wie auch zeitliche Auflösung von Bildsensoren wird in den letzten Jahren mehr und mehr diskutiert, das seit der Camera Obscura nahezu unveränderte 2-dimensionale (bzw. bei Bewegtbildaufnahme 3-dimensionale) Abtastraster weiter zu entwickeln. Lichtfelder, welche einen Ausschnitt der plenoptischen Funktion abbilden, nehmen dabei eine entscheidende Rolle ein. Solche Lichtfelder werden mit einem 4-dimensionalen (bzw. bei Bewegtbildaufnahme 5-dimensionalen) Abtastraster beschrieben.Ziel des vorliegenden Projektes ist, die 5-dimensionale Abtastung einer Lichtfeld-Bewegtbildaufnahme ideal und dynamisch an den Szeneninhalt anzupassen. Da die Sensorik grundsätzlich eine begrenzte Datenrate aufweist (gemessen in Strahlen / Sekunde), ist der durch die Abtastung erzielte Informationsgehalt abhängig davon, wie die aufgenommen Strahlen über die 4 Orts- sowie die Zeitachse verteilt werden. Das Projekt soll diese dynamische Anpassung des Abtastrasters grundlegend untersuchen. Durch die Physik der Sensorik vorgegebene Restriktionen (je nach Bauart lassen sich Strahlen nur in bestimmten Gruppen und zu diskreten Zeitpunkten auslesen) werden als Nebenbedingung berücksichtigt.",
    "dfg_label": "4.43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/429078454"
  }
]