[
  {
    "title": "0-X MASH Continuous-Time Pipeline ADC based on TI-SAR",
    "abstract": "Continuous-time (CT) Analog-to-Digital Converters (ADC) offer great advantages concerning speed, drivability and power efficiency. One very promising architecture is the so-called CT pipeline ADC, which can be implemented as a 0-X MASH Delta-Sigma Modulator. In the state of the art, the coarse quantizer is realized with low resolution Successive Approximation Register (SAR) ADCC, which serves to build a residue, which goes through an interstage gain (ISG) and a fine ADCF that is realized as a CT DSM. The low resolution of ADCC yields larger residue, which again limits the ISG, which again puts more stringent requirements to the fine ADCF. Moreover, the coarse DACC, which is used to build the residue, has low resolution, but needs the full linearity of the overall CT pipeline ADC. The state of the art employs digital calibration of mostly undisclosed complexity. The first project phase intended to investigate the possibility to include time-interleaved (TI) quantization by means of TI-SAR to implement MASH DSM ADC. A solution was found for an intrinsically linear DACC, which is realized using a digital DSM (DDSM). Thereby, the coarse ADCC can be implemented by a TI-SAR, whose TI-output is fed into a single linear DACC, avoiding any TI non-idealities. An advance state-of-the-art TI SAR was implemented in a 22nm CMOS process. Further research was performed on the required allpass filter for residue building and the requirements on the digital cancellation logic. In the second project phase, the found DDSM based DACC must be realized in an as little complexity as possible implementation in order to allow GHz-operation. The optimal location of ISG will be investigated and its interdependency with the out-of-band quantization noise of the DDSM will be analyzed. We aim for a full implementation of this novel CT pipeline ADC based on the TI-SAR coarse quantizer, the innovative DDSM coarse DACC and a reduced complexity digital cancellation logic.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/392004833",
    "project_id": "392004833"
  },
  {
    "title": "100 GHz real-time measurement station",
    "abstract": "The department \"Mixed Signal Circuit Design\" (MSC) at the Technische Universität Berlin, headed by Prof. Dr.-Ing. Friedel Gerfers, develops circuits and systems for wired and wireless high-speed communication as well as automotive applications with its research groups \"Wireline Communication Systems\" and \"Wireless Communication Systems\". Current projects include complete transceivers as well as transceiver components - with data converters as the core competence.Wired projects include transceivers with data rates of up to 224 Gbit/s (112 GBaud PAM4) and components such as VCSELs and optical modulators with symbol rates of up to 150 GBaud to advance the development of current and future transmission technologies in data centers (400 and 800 Gigabit Ethernet). Wireless frequency ranges up to the D-band (with up to 170 GHz) are used for communication systems to be developed with data rates of more than 100 Gbit/s, in particular for the next mobile phone generation \"6G\". In order to have the characterization capabilities necessary for this research, the present proposal requests a 100 GHz real-time measurement setup (“100 GHz Echtzeitmessplatz”) and, in a parallel proposal, a W- and D-band spectral measurement setup (“W- und D-Band Spektralmessplatz (75-170 GHz)”).The 100 GHz real-time measurement setup consists of the bandwidth extension of an existing 70 GHz real-time oscilloscope, which was also funded through a major research instrumentation proposal in 2019, but at that time neither had the project need nor the funding opportunity for a bandwidth extension to 100 GHz. The need of the bandwidth extension to 100 GHz as well as the past use of the existing 70 GHz real-time oscilloscope are presented in this proposal.The 100 GHz real-time measuring setup is required in the current research mentioned, e.g., for the measurement of eye diagrams and their characteristic properties (eye opening, bit error rate, intersymbol interference, noise and jitter analysis) as well as for linearity observation by examining single tones up to higher harmonics (e.g., 7th order). Here, broadband, continuous data streams need to be recorded for reliable analyses, which is why the subsampling architecture of a sampling oscilloscope cannot be used.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/511745882",
    "project_id": "511745882"
  },
  {
    "title": "1-Bit 3-Dimensional Imaging",
    "abstract": "Time-of-Flight (ToF) cameras are 3D imaging systems able to capture the geometry of a scene. Typically, little attention is paid to the quantization scheme and uniform quantization of the measurements with enough number of bits is assumed. In this project we aim to follow up on recent results showing that reliable multiple-path 3D imaging can be obtained from one-bit-quantized data. The first one-bit ToF pixel will be designed, fabricated and evaluated. The ability to obtain reliable 3D images from one-bit data enables a massive reduction of the data to be captured and transmitted by the camera. This reduces the hardware requirements upstream in terms of memory and bandwidth. Furthermore, one-bit ToF imaging deals with a new form of inverse problem, in which the measurements have undergone a non-linear transformation. The reduction of the data flow per pixel also allows for larger ToF pixel arrays, paving the way for Megapixel Tof imaging. The binary nature of the measurements also avoids the need for ADC banks, freeing chip space and further helping on this front. Despite to date all existing ToF cameras rely on uniform quantization, preliminary work of Dr. Heredia Conde has demonstrated the feasibility of the proposed concept by means of realistic simulations. These first results suggest that such a one-bit ToF pixel would exhibit superior performance to alternative sensing schemes relying on different tradeoffs between number of measurements and bit depth for the same bit budget. In this project we will design and construct the first one-bit ToF camera. This hardware novelty will be coupled to an algorithmic counterpart, able to estimate the geometry of the observed scene from the measurements. The result will be an unprecedented time-resolved computational imaging system, in which the information is first encoded into lightweight streams of one-bit data and then decoded into one or several depth images. The necessary tasks for the development of a functional one-bit 3D imaging system can be summarized as follows. First, the architecture of the one-bit pixel will be designed and simulated. Then a single pixel or a small array will be fabricated for testing. The fabricated device will be tested for operability. Building upon the insights gained from this first device, a complete array of ToF pixels will be fabricated and integrated with a modulated NIR illumination system and control circuitry and the system will be tested. The necessary algorithms for reconstructing the 3D geometry of the scene from the obtained one-bit data will be developed. This includes the disentanglement of multiple return paths per pixel. Finally, the overall performance of the system as 3D imaging sensor is to be systematically evaluated and compared to the state of the art and to the results obtained from simulations.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/514479946",
    "project_id": "514479946"
  },
  {
    "title": "1-D Multi-Gate FETs: Tailoring the Potential Landscape on the Nanoscale",
    "abstract": "One-dimensional (1-D) materials such as nanowires and nanotubes have attracted a great deal of attention recently as buildings blocks of future nanoelectronics systems. This interest is in part due to the small geometry that allows realizing optimum scalability of the devices due to the strong electrostatic gate control in e.g. wrap-gate device structures. In addition, nanowires/tubes enable one-dimensional electronic transport that has a number of benefits such as a rather long mean free path for scattering or the highly linear transfer characteristics. Furthermore, the combination of 1-D transport and excellent gate control enables a tight control over the potential distribution within the device. While it is common practice to use gates in order to manipulate the potential profile of transistor device based on novel materials so far only a small number of gates has been used and these gates exhibit a length on the order of several tens to hundreds of nanometers and/or are placed far apart from each other prohibiting a manipulation of the potential profile on the nanoscale. The aim of the present proposal is to realize a 1-D multi-gate device architecture where a large number of gates (on the order of 10 and more) with lengths in the few nanometer range will be placed next to each other with a few nanometers inter-gate distances. This device layout allows tailoring the conduction/valence band profile along the device on the nanoscale due to the excellent gate control in 1-D nanostructures; hence this band tailoring allows studying the full potential of 1-D structures for nanoelectronics. Two different demonstrations will be pursued within the project: First, a gate-induced superlattice structure will be realized in e.g. carbon nanotubes and/or InAs nanowires. With appropriate dimensions this superlattice will serve as an energy filter enabling a so-called steep slope transistor that operates at very low supply voltages and hence facilitates ultra-low power nanoelectronics systems. Second, we will adjust the band profile along the channel in order to maximize the linearity of the transfer characteristics of the 1-D device.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/266030637",
    "project_id": "266030637"
  },
  {
    "title": "1T1R – 2D-FET and VCM-Device BEOL Integration\r\n\r\n\r\n          (B02)",
    "abstract": "One of the key features that make the approach of the active-3D very rewarding is the fact that switching devices and memory devices can be placed in close vicinity. The role of this project is to evaluate the potential of full-BEOL 1T1R elements realized by co-integration of a 2D-FET and an abrupt switching valence change memory (VCM) device. In that sense B02 already demonstrates the combination of two new elements as a starting point for further phases. This basic element allows to realize energy-efficient matrix-vector-multiplication on crossbar-arrays of 1T1R elements exploiting Kirchhoff’s laws.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/555743320",
    "project_id": "555743320"
  },
  {
    "title": "Current projects",
    "abstract": "Semiconductor technology is the core of nearly all products and services of our society. This success was possible by ever smaller, cheaper, and less power consuming devices that make up integrated circuits and systems. The reduction of the physical size of the transistor resulted in lower cost per function, higher performance and strongly improved energy efficiency. However, in recent years the actual size of a transistor did not significantly scale any further. Instead, the continuation of Moore’s Law has been made possible by eliminating dead area utilizing new device architectures in a technology/circuit co-design. With novel 3D transistors improvements along the lines of Moore’s Law are expected. Heterogeneous system integration has been launched recently, where several chips/chiplets are combined in one package. However, all these developments increase the usable area of a chip, either by reducing dead space in between devices and/or enlarging the chip size, and therefore do not address the major road-block: the power consumption. The increasingly pervasive use of Machine Learning (ML) and Artificial Intelligence (AI) comes with an exponential increase of power consumption and the spatial separation of memory and logic across the area of today’s chips leads to the so-called “von Neumann bottleneck”. This TRR will utilize the volume on top of the chip area by integrating active devices into the Back-End of Line (BEOL) enabling logic and memory functionality as well as active interconnects. To this end, novel devices based on new and unconventional materials fabricated with low-thermal budget techniques will be developed and integrated into novel circuits and systems promising unprecedented improvements regarding the key performance indicators power, performance and area. Our materials/technology/circuit co-design approach provides an almost unlimited number of possibilities to arrange circuit functionalities across the BEOL volume allowing to exploit the fact that “there’s plenty of room on top” of the chip to its full extend. The realization of such an active BEOL requires the integration and tailoring of a large set of different materials, it needs highly sophisticated manufacturing technologies, an in-depth understanding of the interaction between materials, their processing and resulting device characteristics as well as a completely fresh way of looking at circuit and system design. To accomplish this, the TRR teams up inter-nationally renowned experts from Dresden and Aachen, starting from the quantum chemical material science aspects to novel electronic devices to discovering new circuit topologies and electronic systems. In addition, both sites bring along a top notch micro- and nanofabrication infrastructure. With the TRR “Next Generation Electronics with Active Devices in Three Dimensions” (Active-3D), Germany and, therefore, also Europe will be strengthened at the basic research level of microelectronics.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/528378584",
    "project_id": "528378584"
  },
  {
    "title": "256GS/s arbitrary waveform generator",
    "abstract": "The chair \"Mixed Signal Circuit Design\" (MSC) at the Technical University of Berlin, headed by Prof. Dr.-Ing. Friedel Gerfers, develops circuits and systems for wired and wireless high-speed communication as well as automotive applications with its \"Wireline Communication Systems\" and \"Wireless Communication Systems\" research groups. Wired systems address transceivers with data rates of up to 448 Gbit/s, as well as sub-components, such as VCSELs and electro-optical drivers, with symbol rates of 150 Gbaud and more, to advance the development of current and future transmission technologies. Wireless frequency ranges up to the D-band (up to 170 GHz) are used for the communication systems to be developed with data rates of over 100 Gbit/s, in particular for the next generation of mobile communications \"6G\". To address this research and characterize it with high precision, this application is for a 256GS/s arbitrary waveform generator with 5Vppd amplitude and 80GHz bandwidth for high-precision broadband signal analysis. The generator has two main applications for the department: 1. modulation source in the research-specific \"measuring station for broadband vector signal analysis of modulated signals in the D-band (110-170 GHz)\"; 2. independent signal source for generating arbitrary, system-adapted signals, in particular with the highest sampling rate, analog bandwidth and signal amplitude. The \"Measuring station for broadband vector signal analysis of modulated signals in the D-band (110-170GHz)\" is required for the development of future-oriented wireless transmission technologies with a combination of ultra-high bandwidth, complex modulation methods (from 256QAM and more) and high signal frequencies, e.g. for the \"6G\" mobile communications standard. For this purpose, the 256GS/s arbitrary generator is used in particular to generate signals for constellation diagrams and analyze their characteristic values, such as EVM (error vector magnitude). With the exception of the 256GS/s arbitrary generator, all components of the measuring station are already available at the MSC department, partly funded by previous applications. The use of the 256GS/s arbitrary generator as an independent signal source serve, among other things, the development of transceivers and sub-components, such as amplifiers and data converters, of cable or fiber-bound communication systems, with the aim of more energy-efficient and future-proof technologies for data centers. For this purpose, the arbitrary generator generates modulated signals with channel-compensating pre-distortion, which are analyzed as eye diagrams (with eye opening, bit error rate, inter-symbol interference, noise and jitter) using a 100 GHz real-time oscilloscope (available). In summary, this application presents the current need for the procurement and performance class of a 256GS/s arbitrary generator for the high-precision broadband analysis of future mobile and fiber-bound systems.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/544829238",
    "project_id": "544829238"
  },
  {
    "title": "2D Field-Effect Transistors\r\n\r\n\r\n          (A06)",
    "abstract": "2D materials promise further device scaling and improvement of device performance and are already considered for future electronics. The group at AMO in Aachen is a leader in the research on practical devices based on 2D materials. While the group in TU Dresden has exceptional expertise in the syn-thesis of 2D materials.  Since here the channel material is decoupled from the wafer, integration into the BEOL is a natural choice although some significant issues remain to be solved. Within the TRR this project will supply the lateral devices with different performance levels.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/555733522",
    "project_id": "555733522"
  },
  {
    "title": "2D polarization resolved optical spectroscopy for exploration of conformation, energy transfer and aggregation of macromolecules (conjugated polymers and proteins) within different environments under the goal to contribute to the improvement of organic bulk heterojunction solar cells.",
    "abstract": "This project will explore conformation and aggregation of macromolecules using recently developed 2D polarization imaging techniques (2D POLIM). The aim of the investigation is to establish new insight into the organization of the studied macromolecules with the prospect for improved applications in organic electronics. \u000bThe studied objects, one the one hand, will be conjugated polymers, which due to their electronic and optical properties are suitable for organic electronics. Application of 2D POLIM to diluted solutions of conjugated polymers in liquid crystal (LC) matrices will enable us to evaluate the topology of the polymer chains/particles and measure the extend of energy transfer within these objects. In contrast to amorphous polymer matrices, LCs provide a known local structure, which can be controlled by temperature and electric field. Establishing of unambiguous correlations between the chain size, chain conformation, degree of aggregation and energy transfer efficiency is still lacking. Such knowledge is especially important for organic electronics where the polymer chain morphology seems to be the key for the device performance. \u000bOn the other hand, investigation of biopolymers in living cells and in vitro is expected to provide new insight in the complex pathways of their functionality and organization. Functional structures play a prominent role in cell biology. By extending our research activities to the investigation of biological materials, we expect to find viable clues for the improvement of organic solar cells. Preliminary investigation proved the power of 2D POLIM to resolve structures in biomedical samples to be superior to conventional fluorescence spectroscopy techniques. In cooperation with the Wallenberg Neuroscience Center, Bio-Medical Center, Lund University aggregation states in proteins will be explored. The ability of 2D POLIM to resolve energy transfer together with particle orientations, provides a more direct approach on interaction of proteins than other fluorescence microscopy techniques.\u000bFrom the investigations of both materials, we expect new insight for the improvement of organic bulk heterojunction solar cells. The already existing collaboration with the Swedish Center for Organic Electronics (COE) will provide us with materials to directly test structures and material compositions motivated by the results from our studies.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/256530768",
    "project_id": "256530768"
  },
  {
    "title": "300 GHz transmitter with controllable holographic antennas - HoloOnC",
    "abstract": "In millimeter wave systems above 100 GHz for communication and sensor applications, a major challenge is to achieve a high EIRP (Equivalent Isotropic Radiated Power), i.e. to provide high directional transmit power. This applies in particular to transmitters that are not built with tubes but with integrated circuits (ICs). The reasons for this include the limited maximum output power of the power amplifiers, the limited efficiency of integrated antennas and lossy assembly and interconnect technology for the ICs. The efficiency (PAE) of power amplifiers is usually only a few percent above 100 GHz; with silicon-based chip technology, this is further limited by the comparatively low breakdown voltage of the technology. As the output power of integrated transmit antennas is not sufficient for many millimeter-wave applications, the emitted beam must be focused in order to achieve a high EIRP. In many applications, however, beam steering is required in order to direct the emitted signals in a specific direction depending on the situation. This project application tackles this problem and introduces a novel approach to beam focusing and scanning. A new basic concept is to be researched in which holographic antennas are designed to be controllable for the first time, i.e. with the possibility of beam steering. The actual beam steering takes place via an adaptive hologram, which can be changed using integrated switches in the hologram. The concept is intended for the upper millimeter wave range, so that the controllable holographic antenna is to be implemented as a chip-integrated antenna in an IC. The project aims to work out the interactions of the new holographic antenna concept. Based on this, a design methodology for the antenna and circuit design will be derived. A demonstrator will be used for verification at the end of the project. The new concept is based on the topics of integrated antennas, holographic antennas, power generation and integrated switches, for which the applicants have done extensive preliminary work.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/556676862",
    "project_id": "556676862"
  },
  {
    "title": "3D printer based on two-photon polymerization technology for maskless microfabrication",
    "abstract": "This proposal deals with the procurement of a 3D printer system based on two-photon polymerization (“3D printer”) for the fabrication of complex 2.5D and 3D microstructures with state-of-the-art resolution and accuracy. Currently, the integration of novel quantum systems of the first and second generations is often limited by the constraints of conventional manufacturing techniques. Such quantum systems often require hybrid electro-photonic interfaces and interconnects, which are either impractical or impossible to achieve with traditional microfabrication techniques. This is true both for one-of-a-kind research systems and volume production. The 3D printer will be used to compactly integrate the required control structures for both spin-based and atom-based qubits, requiring the precise generation of high-frequency magnetic and electric fields, respectively. Applications of such quantum systems, especially in the field of biomedical sensing, additionally often require the precise handling and control of liquids through microfluidic structures, which have to be incorporated with the quantum device. The resulting structures are also very hard and/or time-consuming to fabricate using traditional planar, clean-room-based manufacturing methods. To enable the fabrication of the abovementioned structures, the requested system has to allow for the 3D fabrication of microstructures with (sub-)micrometer resolution and accuracy on a wafer scale, including the possibility of direct printing of micro-optical elements, such as lenses, diffraction gratings, and fiber-optic couplers. In order to allow for potential manufacturing scalability, automatic alignment of the 3D print to existing optical elements, such as fibers and photonic chips is required. Overall, this allows for a level of integration of complex hybrid photonic-electronic nano/micro systems with capabilities greatly extending the current state-of-the-art. Since the 3D printer itself can only print non-conducting polymers, we will use several different methods, including shadow masks for electrode evaporation and 3D printing, to produce the required conductive structures for the generation of the RF magnetic and electric fields for qubit control. Moreover, we can use the high precision of the 3D printer to print support structures with variable diameters, thin walls, and high aspect ratios to manufacture 3D coil structures using the 3D wire bonding process with insulated bond wires established in our lab. Such 2.5D and 3D geometries have significantly better field homogeneities than pure planar geometries, which are required for most modern quantum sensing and computing applications. In summary, the requested 3D printer will enable the development of novel concepts for hybrid integration of first and second-generation quantum devices and other smart sensors.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/538872077",
    "project_id": "538872077"
  },
  {
    "title": "3D printer for Additively Manufactured Electronics",
    "abstract": "Digitalization, Artificial Intelligence, and Industry 4.0 are key areas in which the manufacturing process \"Additively Manufacturing Electronics\" (AME) plays a significant role. The integration of electronics into components allows for the development of intelligent sensors and connected systems with increased efficiency and productivity. AME enables rapid prototyping and product development, allowing research institutions and companies to optimize their innovation processes. The tailored solutions and design freedom of AME support adaptation to the specific requirements of these forward-looking areas. By acquiring a 3D AME printer, the Laboratory for Microelectronics at the University of Freiburg is enabled to transform its self-developed and manufactured application-specific integrated circuits (ASICs) into complex systems using state-of-the-art manufacturing processes. The requested 3D AME printer will enable the co-integrated printing of dielectrics and metals, using inkjet technology to combine UV-cured dielectric materials with IR-sintered silver nanoparticles to create high-resolution electrical structures. Such co-integrated printing in arbitrary three-dimensional geometries allows for the electrical contacting of the manufactured ASICs in an innovative way while simultaneously protecting them from external influences. Instead of the typically planar combination of electrical components in common printed circuit board (PCB) assembly, stacked, orthogonal, or even spherical arrangements of individual components are possible, resulting in significantly smaller form factors. The printing process and low manufacturing temperature allow for pausing the printing and thus the package-free embedding of ASICs as so-called Bare Dies, minimizing the form factor and improving signal qualities due to the elimination of bond wires and shorter traces. Furthermore, the routing of conductors can be revolutionized by shielding them entirely within the 3D-printed enclosure, twisting them in larger groups, or finely tuning their impedances. The production of passive electrical components and 3D antennas is also possible, ultimately achieving a fusion of PCBs, passive components, and ASICs into a highly integrated microelectronic unit. In the end, a 3D AME printer reduces the need for external manufacturing and expands the capabilities of the Faculty of Engineering to manufacture multiphysical microsystems. Research on multiphysical sensing and highly integrated brain-machine interfaces is being promoted. In education, the printer enables practical experience with parasitic ASIC effects and their impact on sensitive circuits.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/539303076",
    "project_id": "539303076"
  },
  {
    "title": "3D Printed Dielectric Structures for THz Applications\r\n\r\n\r\n          ((2)-C13)",
    "abstract": "The objective of this project is to enable true monolithic 3D ceramic THz components for highly accurate localization purposes, which operate in the mm- and sub-mm wavelength range. For this purpose, a novel emerging 3D printing technology is introduced into the field of THz research, which is “Lithography-based Ceramic Manufacturing”. With currently no THz application of this technology, this project will further develop the technique for sub-mm wave applicability. This will enable unseen device possibilities and complexity in the THz frequency range, which go beyond the state of the art of classical 2.5D subtractive manufacturing, as well as current 3D printing technologies.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/419393123",
    "project_id": "419393123"
  },
  {
    "title": "3D Integration of Nonvolatile Nanomagnetic Logic",
    "abstract": "Magnetic field-coupling is an emerging, new paradigm of nanoscale computing, where information is propagated and processed by the magnetic interaction of single-domain magnetic particles. The feasibility of this concept has been recently demonstrated experimentally by a magnetic majority gate, which was lithographically fabricated from Permalloy dots. We have shown theoretically that magnetic field-coupled circuits can achieve fast and densely integrated computing which dissipates only few kT power per switching.Our goal is the design and experimental demonstration of field coupled circuits, which are based on ion-beam patterned magnetic multilayers. Such multilayers exhibit strong out-ofplane anisotropy, which is very desirable from the architectural point of view, and the magnetic properties of the layers / dots can be fine-tuned and improved by ion irradiation. Magnetic characteristics of the dots are well-controlled, which makes the realization of complex field-coupled structures feasible.We are going to realize not only a stand-alone device, but a small, albeit complete magnetic computing system. We put special focus on the design and fabrication of electrical inputs / outputs and an integrated clocking system. Submicron-scale electrical wires, buried under the magnetic layers will provide clocking fields for synchronized switching of magnets.Our research could result in a new family of magnetoelectronic devices with far-reaching application potential in low-power computing. The fabrication of magnetic computing components is compatible with silicon technologies and they can enhance the functionality of microelectronic devices.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/114933698",
    "project_id": "114933698"
  },
  {
    "title": "3D Integration of Tailored Phase-Change Memories (PCMs)\r\n\r\n\r\n          (A03)",
    "abstract": "Phase change materials offer a very versatile method to achieve resistive switching devices that are inparticular well suited for storage applications and in-memory computing. At the Aachen site a world class activity on optimized phase change materials is available. The task of this project is to supply 3D integrable phase change blocks that can be used for storage and in-memory computing using tailored phase change materials optimized for the specific tasks. In Phases 2 and 3 also the possibilities of using phase change materials for heat management will be explored on top of continuing the work in connection with other devices.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/555731762",
    "project_id": "555731762"
  },
  {
    "title": "3D Concepts for Gallium-Nitride Electronics",
    "abstract": "Electronic devices based on Gallium Nitride (GaN) are nowadays regularly used as High Electron Mobility Transistors (HEMTs), e.g. in mobile communication. Due to its high breakdown voltage of 3 MV/cm and potentially high operating temperatures, GaN is also more and more intensely discussed for future power electronics in the intermediate voltage range. The further development of GaN electronics in general, and in particular for power electronics, is generally seen to be hampered by various issues, including too high defect densities, too low transient power dissipation capability and limited breakdown behavior. Vertical device geometries (e.g. in IGBTs), which have been proven to be extremely useful in power electronics, are not available, which is due to missing GaN high quality bulk substrates. GaN FET technology today is relying on a planar HEMT approach, relying on a 2-dim electron gas at the AlGaN-GaN interface. The main idea of our project is to explore a vertical concept for GaN electronics based on 3D GaN nanorods. In fact, 3D GaN nanorods would have the potential to overcome most of the above mentioned limitations of planar 2D HEMT technology and could lead to a completely new type of GaN electronics later on, when many of the existing foundational questions have been answered. The concept of this project is to explore the potential of 3-dimensional GaN (GaN nanorods) as a basis for novel vertical electronic GaN-based devices, with a particular emphasize - but not exclusively - on power electronics. The project is based on substantial progress in the two participating groups at TU Braunschweig and Uni Kassel over the last years concerning the reproducible MOVPE growth of GaN 3D micro- and nanorods, with large area homogenous fabrication of nanorod ensembles on 2 inch and 4 inch substrates, as well as an advanced theoretical understanding of the properties of such 3D GaN nanowires. In summary, the project aims at the exploration and development of central process and device strategies for a future vertical GaN MOSFET technology. Such vertical design concepts will allow straight forward scaling towards large area devices (by using e.g. millions of nanoFETs in parallel with vertical current path) potentially carrying (and switching) very large currents. Also, parallel vertical 3D device geometries would allow for more efficient cooling strategies. Overall, our vertical device strategy addresses many of the issues being identified as serious challenges in planar GaN power devices. A particularly important aspect of this project will be the combination of experimental and theoretical expertise in the field of 3D GaN.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/284575374",
    "project_id": "284575374"
  },
  {
    "title": "3D L2S-Microscopy for Unstained Cell Clusters",
    "abstract": "The subproject investigates time-resolved 3D microscopy as an application of the L2S paradigm, creating one of the proposed adaptive L2S sensor systems in the process.It aims at developing an experimental coded microscopy platform for 3D and time-varying 3D (=4D) microscopy of unstained cell clusters, the imaging of which is of high importance in biomedical research. We aim at creating a flexible research tool rather than a targeted microscope solution. It is envisaged that the microscopy hardware platform enables different physical coding strategies that can be completely configured by software. This, in turn, enables the application of L2S techniques for its application-specific optimization. The subproject develops all necessary hardware and software aspects for this application. For the machine learning aspects, i.e. network architecture, loss function design and training schemes a tight collaboration with the respective machine learning projects is envisaged. The fundamental research question targeted in this subproject is: Is it possible to unlock new performance regions and/or significantly expanded conditions of applicability (thick samples, combined diffraction and absorption) in time-varying 3D microscopy using specifically developed AI techniques in conjunction with hardware/software codesign?To this end, the subproject investigates 4 main topics: 1. Training Data and Ground Truth Generation, Data Acquisition, 2. Modeling, System-Simulation and Differentiable Digital Twin, 3. Microscope Construction, Calibration, and Validation, and 4. Learning to Sense techniques for 3D Refractive Index and Absorption Microscopy.Topic 2 benefits from joint activities with subproject P5 (Andreas Kolb). Topic 4 will be realized in close collaboration with subprojects P1 (Michael Möller), P2 (Margret Keuper) and P3 (Volker Blanz).",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/498555818",
    "project_id": "498555818"
  },
  {
    "title": "Projects",
    "abstract": "The past decade has shown that a vast majority of visual computing problems admit significantly higher quality solutions if the entire processing of the visual data is learned jointly: The era of Deep Learning has largely replaced previous sequential approaches such as first designing important features for a specific task and subsequently learning to analyze or classify the data using such features. Yet, this so-called end-to-end learning paradigm considers the image data a sensor system records as the beginning of the learning pipeline. It neglects the fact that the image data itself is the result of an upstream process with many design choices in developing and dynamically adapting the sensor system, and thus still remains a sequential approach in which the sensor system is designed separate from the data processing pipeline. The goal of the \"Learning to Sense\" (L2S) research unit is a joint optimization for design parameters of the sensor system along with the neural network to analyze the resulting data, i.e., developing a true end-to-end machine learning methodology yielding systems that are optimized for an application specific task. Consequently, the L2S project will conduct joint fundamental research on both, making sensor systems adaptive to provide promising degrees of freedom, and on a machine learning methodology that allows for the joint optimization of the resulting sensor system and network parameters. In the long run, the L2S paradigm will provide a new methodology for the integral development of adaptive sensor systems alongside neural networks with optimal task-specific characteristics, which results in a substantially more efficient and more precise scene analysis with minimal manual inference in the sensor system design.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/459284860",
    "project_id": "459284860"
  },
  {
    "title": "3D-LommID: Novel Techniques, Theories and Circuits for 3D Locatable\nmm-Wave RFID Tags",
    "abstract": "High precision 3D indoor and outdoor localization and high speed communication are key technologies for the internet of things and for vehcile2vehicle and vehicle2infrastructure communication. The main goal of 3D-LommID is to establish novel multiple in multiple out (MIMO) architectures suitable for long-range, high accuracy, multipath resistant and multi-object 3D localization, as well as simultaneous high speed communication based on the innovative switched injection-locked oscillator (SILO) transponder principle. The frequency band around 60 GHz is chosen since it allows a large bandwidth and consequently a high positioning accuracy, as well as small form factors even when applying MIMO concepts requiring multiple signal paths. Two major transponder architectures will be investigated: Firstly, a regenerative retrodirective MIMO backscatter approach, which employs multiple SILOs in a Van Atta array configuration to achieve a high coverage range of up to 100 m with a stable bidirectional communication link as well as a positioning accuracy of around 5 cm. Secondly, a regenerative orthogonally coded MIMO backscatter approach, which provides a high 3D object position accuracy down to 1 cm and orientation tracking using highly flexible pulse coding and inverse beamforming at the base station. Both transponder concepts interoperate with a MIMO base station with multiple coherent RX and TX modules featuring wideband complex signal generation and reception for FMCW ranging, angle of arrival detection as well as bidirectional communication. Regarding theory, profound analyses for multi-SILO backscatter systems and circuits will be performed in order to identify optimum pulse synchronization and modulation schemes as well as optimal circuit design parameters. System and component level simulations allow for an analysis of technological boundaries and parameters. Existing theoretical models will be extended considering parasitics and boundaries of real-world implementations. Several novel ideas are investigated on circuit level: e.g. high power oscillators based on breakdown multiplier circuits (smart transistor stacking) as well as adding of fast switchable preamplifiers and power amplifiers plus control and pulse generator circuits to increase the signal to noise ratio. Moreover, to enable compact MIMO systems, we will study compact, passive-inductor-less and active-inductor-based SILO approaches. The circuits will be implemented in fasted available BiCMOS technology and combined with optimized antenna configurations. The final system demonstrator will consist of two MIMO base stations and multiple transponders. To our knowledge, this will be the first research on MIMO SILO concepts.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/288736853",
    "project_id": "288736853"
  },
  {
    "title": "3D Architecture Schemes and Processes\r\n\r\n\r\n          (C01)",
    "abstract": "This project has the central task of tying together the technological infrastructures and supplying technologies to connect the individual elements developed in Research Areas A and B. Scientifically, new contacting, wiring, local interconnection and integration schemes will be necessary. An important aspect will be the research on novel atomic layer deposition and atomic layer etching processes that are not existing currently but will be required to combine the different elements. The non-programmable wiring schemes which will be strongly diverging from the state of the art in terms of materials and process integration will be in the focus. Connecting the cleanroom infrastructures at three different sites and at least six different labs is another important aspect and standardized sample formats, run-sheets, lithography marks etc. need to be defined and rolled out to the different labs.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/555746748",
    "project_id": "555746748"
  },
  {
    "title": "3D Racetrack Memory Devices\r\n\r\n\r\n          (A04)",
    "abstract": "Magnetic racetrack devices offer distinct potential for achieving both high speed and high density memory and storage functions. Racetrack is based on the novel concept of moving data, thereby al-lowing for functionalities not possible with conventional approaches. The group at the MPI-MSP has made significant advances towards practical racetrack devices over the past few years. In Phase 1 the main task is to develop a memory device that is non-volatile with SRAM type performance but requires much less real estate compared to 6T SRAM cells. In further phases, high density memory-storage capabilities will be explored based on both 2D and 3D forms of racetrack.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/555732116",
    "project_id": "555732116"
  },
  {
    "title": "3D Reflectometric Material Characterization using Co-located MIMO Radar\r\n\r\n\r\n          (M04)",
    "abstract": "Frequency Modulated Continuous Wave (FMCW) MIMO Radar systems are a promising approach to mobile material characterization, ranging, and imaging, since very large bandwidths (>50 GHz) can be achieved by compact and mobile electronic transceivers. Up to now, we could show that accurate calibration can enable FMCW transceivers to accurately measure the relative permittivity and losses of dielectric materials. Furthermore, we demonstrated range estimation down to single-digit microns. In the 3rd phase, we are going to enable material imaging in large dynamic scenarios. Therefore, we will investigate on advanced SAR kernels suitable for material imaging as well as highly accurate MIMO radar-based localization methods. Furthermore, we will continue to investigate on calibration methods to account for systematic errors in MIMO radar, which may occur due to hardware impairments or near-field effects, when considering large apertures or arrays.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/336557969",
    "project_id": "336557969"
  },
  {
    "title": "3D composite resistive switching nanoparticle networks enabled by complex plasmas",
    "abstract": "In recent years, research on nanoparticle networks at the percolation threshold has demonstrated their remarkable potential as physical substrates for beyond-von Neumann computing both experimentally and theoretically. In this project, plasma-assisted synthesis of 2.5D (substrate roughness controlled layers of nanoparticles) and 3D nanoparticle networks is explored as a novel, versatile, and scalable fabrication method. It offers the possibility of fine-tuning the properties of the nanoparticles and networks, enabled by their trapping and targeted modification in a low-pressure plasma, as well as the controlled extraction and deposition of the such tailored nanoparticles. The goal is to generate these composite nanoparticle networks with specific 3D connectivity schemes and collective resistive switching characteristics that expose criticality, avalanche dynamics, and scale-free behavior. This is addressed by combining experiments with modeling/simulation: Experimentally, Ag nanoparticles generated from a gas aggregation source are trapped in the gas-phase in the positive potential of a low-pressure radio-frequency discharge due to their negative charge. The addition of precursor gas enables their controlled surface modification to obtain Ag@SiO2 core-satellite and core-shell nanoparticles. Their targeted deposition from the plasma through a scalable extraction system and the electrical characterization of the obtained 2.5D/3D nanoparticle networks is examined. This effort is complemented by a theoretical description and analysis of the nanoparticle extraction and their deposition onto pre-structured surfaces by means of particle-based simulations. Moreover, a characterization of the nanoparticle networks concerning the collective resistive switching kinetics and criticality is achieved by an analysis of the spike-time dynamics from a phenomenological nanoparticle network model, taking into account resistive switching in the nano-gaps between groups of nanoparticles and dynamics of electrical network connectivity in a (modified) nodal analysis.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/568560111",
    "project_id": "568560111"
  },
  {
    "title": "5GEnabled Real Time Communications for \"Tactile Internet\" (5G-Remote)",
    "abstract": "The introduction of the 5th generation of mobile communications systems (5G) will pose a crucial challenge for real-time communications. The most important requirement for many of these real-time applications is a guaranteed minimum network round trip delay (RTD) of ≤ 1ms. In order to achieve the required RTD, the resources for the end-to-end (E2E) network must be jointly optimized. We argue that URLLC, as proposed for 5G, is not sufficient to meet the requirements for tactile Internet applications (TI). In this project, flexible and programmable network architectures with efficient real-time Virtualized Radio Resource Management (vRRM) techniques are investigated, simulated and prototypically implemented to achieve the desired performance parameters for TI services. AI frameworks and libraries are also used to achieve improved virtualization by using network data. However, we will not conduct our own AI research. The optimization of the E2E wireless network connection requires the investigation of all network resources, especially communication, computation and memory resources, which means a huge amount of work. Therefore, we will focus on the investigation and development of a reliable hypervisor and real-time planning of network resources for the cMTC (Critical Machine Type Communication) in order to achieve necessary improvements over URLLC (Ultra-Reliable Low-Latency Communication) service quality. This requires moving critical parts of the cloud control application to the edge server near the CPS. We do not intend to investigate the specific mobility of the end user, so we can assume a static or nomadic relationship between the end user and the Edge Server. The project will investigate vRRM techniques and algorithms to solve the necessary network RTD optimization problem for TI-specific real-time wireless communication in a factory automation use case. The original optimization problem is formulated as a Markov Decision Process (MDP)-based constrained coverage optimization problem in which the optimal solution is sought. In order to prove the usability of AI-based approaches, online learning algorithms are applied that approach the optimal solution with low computational complexity. With the help of open source software like OpenStack, OPNFV and OpenFog, optimal and near-optimal solutions are anticipated. For the investigation of AI support for hypervisor planning policies and the use of learning algorithms we will use AI frameworks like TensorFlow or CNTK for experimental DNN modeling (Deep Neural Networks) and AI libraries like Torch or MLPack for prototypical implementations and evaluations.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/457407152",
    "project_id": "457407152"
  },
  {
    "title": "A1: Accuracy of THz Communications Measurement Systems",
    "abstract": "In the second phase of the project A1 (Accuracy of THz Communications Measurement Systems), based on traceability provided by project T, investigation of the two main measurement systems necessary for THz communications, channel sounding and optical sampling, will be further extended towards new technologies, approaches and scenarios. As reference artefacts turned out to be the major route towards establishing traceability for advanced channel sounder architectures and model-based parameter estimation, further work by PI Thomä and PI Kleine-Ostmann as basis for A2 and projects in area B and C will concentrate on advanced waveguide and over-the-air artefacts to evaluate high-resolution parameter estimation performance with regard to specular propagation parameters delay, direction, Doppler, and diffuse scattering. This will include the definition, implementation and characterization of new artefacts such as lines, edges, corners, cavities, etc. These canonical objects represent dominating building blocks of the propagation environment. They are required to evaluate object recognition schemes if the THz communication system is used in parallel for radar sensing (e.g. simultaneous localization and mapping). To keep pace with increasing demands and to restrict the required spectral efficiencies for signal processing and transmission, higher data rates need increased baseband width. Thus, PI Schneider and PI Kleine-Ostmann will investigate the accuracy of frequency- and time-domain methods for a parallelization of an incoming high-bandwith signal into several signals with lower bandwidths as basis for A3. Based on waveform metrology, we will compare the different methods regarding their accuracy, and we will especially investigate the additional error and the resulting effective number of bit (ENOB) reduction. Especially for the frequency-domain method of spectrum slicing we will investigate the non-idealities of integrated filter functions and their influence on the accuracy.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/424608271",
    "project_id": "424608271"
  },
  {
    "title": "A2: Metrology of Multi-Dimensional Channel Sounding",
    "abstract": "The major objective in the first phase of the project A2 was “the study and comparison of real-time broadband sounder architectures and the development of calibration procedures that allow the estimation of the geometric model of multipath propagation with the least possible distortion by the measurement device used”. On the basis of the results achieved, we will be working in the second phase on an enhanced sounder architecture that overcomes the limitations of our former setup and enables ambitious metrology-grade THz radio system evaluations. Firstly, we will profit from the flexibility of arbitrary waveform processing. Multicarrier signal design and predistortion schemes will lead to enhanced sounder calibration procedures and increased Tx power efficiency. Another advantage comes from the capability of multicarrier excitation signals to reproduce predefined envelope statistics of typical OFDM and SC-FDMA communication waveforms. This is used to estimate the nonlinear induced distortion behavior of RF subsystems in certain application situations. Secondly, the intended coherent multichannel RF-architecture offers unprecedented features for THz sounder application. Already at the end of the first phase, we will have a 2x2 quad-polarimetric transceiver radio interface at 300 GHz available. This will be further used to demonstrate the identification of polarimetric signatures of canonic reference artifacts from project A1. This shall pave the way for integrated communication and sensing applications of THz communications, e.g. radar based SLAM navigation (SLAM: Simultaneous Localization and Mapping). Another important step is the use of a 4-element receive array which becomes available with four coherent down converters. Thereby and with the real-time capability of the arbitrary waveform radio interface, we will demonstrate true joint delay/Doppler/DoA resolution (DoA: direction of arrival) in dynamic scenarios. This opens new perspectives to introduce multidimensionality to system metrology of time-variant, directive radio systems. Moreover, we will extend the multidimensionality approach to DoD estimation (DoD: direction of departure). We will demonstrate that joint DoA/DoD resolution is necessary for a correct bidirectional characterization of wave propagation and a comprehensive system level evaluation of THz transceivers that use directive antennas, most notably arrays, at both sides of the link. Finally, the planned setup will allow emulating distributed multilink and multi-hop network structures. This offers new perspectives for metrology-grade evaluation of these advanced THz radio systems. Thirdly, we will further developed our model-based estimation procedure to deal with missing carriers and sparse carrier allocation and to handle extended objects showing a dispersive response and a characteristic polarimetric signature.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/424607834",
    "project_id": "424607834"
  },
  {
    "title": "A3: Metrology of High-bandwidth Sampling Systems",
    "abstract": "In the first phase of METERACOM we have successfully investigated the metrology of high-bandwidth sampling systems and of integrated devices for sampling. But, we have restricted ourselves to a baseband width of around 40 GHz. However, exponentially increasing data rates, especially in wireless systems, have led to the definition of peak data rates of 1 Tbps for next generation systems like 6G and beyond. Such high data rates not only need new carrier frequencies in the THz region of the spectrum. In order to relax the requirements on the spectral efficiencies of the electronic signal processing, they need higher baseband widths, too. Thus, in the second phase of METERACOM, we will investigate error sources of several methods for increasing the processible bandwidth of sampling systems by a parallelization of the incoming high-bandwidth signal into several low-bandwidth sub-signals in the time or frequency domain. These sub-signals can then be detected and further processed in parallel by low-bandwidth electronics. In this sub-project of METERACOM we will investigate the error sources of these parallelization systems, possibilities to mitigate them and (in strong collaboration with A1 and T) we will establish a traceable measurement chain to the representation of SI units for the assessment and mutual comparison of these systems. Additionally, in collaboration with B2 and C3, we will make experiments and develop simulation models for the practical investigation of one of the parallelization systems we have invented in the first phase of the project, which enables a separation into the sub-channels with very low error. Furthermore, we will develop algorithms for the simulation of sampling systems with best in class components, currently available in research for the evaluation of the experiments in B2 and the model of C3. We will mainly build on initial preliminary results achieved in the first phase of the project and by a collaboration with the University of Rennes we will have access to a laser system which makes the state of the art in spectral purity.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/424607946",
    "project_id": "424607946"
  },
  {
    "title": "Ultra Wideband-Based Imaging Technology for Stroke Detection",
    "abstract": "This research is about to address the early detection and differentiating diagnosis of stroke - one of the leading cause of human disability and the second cause of death worldwide. Complementary diagnosis solutions via fast, reliable, cost effective and portable systems will be designed and realized. The aim of this project is to develop and evaluate ultra wideband (UWB) imaging technology for the detection and classification of stroke via simulations and measurements and to propose and realize a laboratory version of the system which in a second phase of this project will be further developed for actual clinical use. The analytical analysis of the UWB signals propagating through different head layers lead to the extraction of the general necessary specifications of the imaging system based on which appropriate UWB hardware components, in particular antennas and antennas arrays, suitable for this specific medical di-agnostic purpose will be designed. Moreover, a realistic model of human head without and with stroke (both hemorrhagic and ischemic stroke) will be set up and investigated through numerical computer simulations. Based on the specific characteristics of the human head model, robust, fast and sensitive reconstruction algorithms for imaging, recognition and classification of stroke will be developed and applied. A measurement setup consisting of an optimized antenna array will be practically realized and its performance will be evaluated on phantoms that mimic the human head.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/221837833",
    "project_id": "221837833"
  },
  {
    "title": "Tuneable Coupling Structures for Integrated Silicon Photonics",
    "abstract": "Commercial optical transmission systems achieve data rates of 100 Gb/s on a single wave length. Future systems are targeting for data rates of more than 1Tb/s with advanced modu-lation schemes. Therefore, highly efficient photodetectors are required at the receiver side. At the INT non-periodic grating couplers with a record coupling efficiency of -0,62 dB have been achieved with an optical -1dB bandwidth of 40 nm. In the previous DFG project BE2256/23-1 a shifting of 44.7 nm is achieved for the peak envelope of the coupling effi-ciency of a periodic grating coupler. The variation of the peak of the coupling efficiency is investigated by applying the electrooptic effect in a p-n-configuration as well as the ther-mooptic effect. As the thermooptic change of the refractive index is more pronounced, a pure  p-or n-doped silicon guiding layer is proposed here. Using the thermooptic effect, a non-periodic grating coupler with backside mirror is suggested with minimum electrical power consumption. The non-periodic grating shall be optimized for a broad coupling range. Finally polarization splitting will be investigated by two-dimensional grating couplers.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/252274958",
    "project_id": "252274958"
  },
  {
    "title": "Tunable Quantum Photoconductor for efficiency-enhanced THz switches (QPC-Switch)",
    "abstract": "Photoconductive semiconductors have been widely investigated for applications requiring ultrafast optical switching. THz-frequency photoconductors must have both high carrier mobility and short carrier recombination time for optimal efficiency. These two requirements, however, are difficult to simultaneously optimize because short carrier lifetimes in materials usually requires some sort of defect that also degrades the carrier mobility. The goal of the collaborative Quantum Photoconductor (QPC) Switch project has been to decouple the optimization of these two parameters through the judicious use of semiconductor heterostructures, allowing us to separate carrier transport and carrier recombination. We have focused in this collaboration on the use of transition metal (TM) doping of InGaAs/InAlAs heterostructures lattice-matched to InP. The InGaAs system is compatible with telecom-frequency lasers for driving the switch. In prior DFG projects, we have focused first on the use of Fe and Rh. The use of molecular beam epitaxy for TM-doped semiconductor photoconductive switches was first demonstrated within this collaboration. Our collaborative investigation of TM-doped InGaAs has shown that Fe, Rh and Ru act as deep acceptors in InGaAs. Such deep levels can compensate the natural n-type conductivity found in InGaAs prepared epitaxially by MBE. We have recently shown that Rh, like Fe, forms clusters at elevated concentrations. Such Fe- or Rh-clusters are no longer simple point defects and the compensation effect of deep acceptors saturates. At the same time, we have also found that Ru appears to incorporate as an isolated deep acceptor to much higher Ru concentrations, perhaps due to the lower surface mobility during epitaxy. This property leads to higher deep acceptor concentrations in InGaAs using Ru than with the other transition metals, and allows us to completely compensate the n-type background in InGaAs using Ru. Thus, although QPC structures doped with Fe or Rh have shown excellent room-temperature Hall mobilities and sub-picosecond lifetimes, the use of Fe and Rh is not consistent with ultra-low dark conductivity due to clustering. Thus, a remaining challenge lies in reducing further the background carrier concentration. The solution we propose, and that we would like to explore in the proposed extension project, is to combine high-concentration clustered Rh or Fe with non-clustered Ru to achieve simultaneously ultrashort lifetimes, high mobility, and low dark carrier concentration. Preliminary results indicate that the combination of Rh and Ru can result in significant improvements in ultrafast, TM-doped photoconductors for THz emitters and receivers. The goal of the project prolongation is to investigate the dual-doping approach in depth and to realize the full potential of TM-doped InGaAs material system for application as THz antennas.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/276992184",
    "project_id": "276992184"
  },
  {
    "title": "Sensing Strategies for Spherical Phaseless Antenna Measurements (S³PAM)",
    "abstract": "Due to diverse and increasing demands for antennas regarding bandwidth (e.g. for ultra-wideband antennas), radiation properties (e.g. for reconfigurable antennas) and high operating frequencies (e.g. for radar systems in the automobile sector), the complexity of antennas as well as their measurement efforts has increased greatly in recent years. In order to save time, often only partial measurements with a small selection of frequencies and antenna configurations are carried out. Particularly in the near-field, the long measurement period is a strong limiting factor. The reason for this is the high number of measurement points that have to be acquired in order to determine the transmission characteristics of an antenna with satisfactory accuracy. However, if the radiation of the antenna is described in terms of spherical waves, it turns out that in practice the relevant information is mostly concentrated in a few spherical wave coefficient. Furthermore, in order to compute the spherical wave coefficients from the near-field measurements, both amplitude and phase are necessary. However, phase measurements imply the use of expensive equipment, e.g., network analyzer, and rely on the assumption of having access to the reference phase, which is, for example, not the case in over the air measurement scenarios. For these reasons, there is a great interest in the development of phaseless measurement setups.The project aims to bring together mathematical methods of phase retrieval and compressed sensing with the theory of spherical near- to far-field transformation to enable phase-less (subsampled) antenna measurements on the sphere with minimal loss of accuracy. To this end, we extend theory on existing sampling strategies to respect all involved rotation angles and to obtain improved sampling patterns. We suggest phase-less antenna measurements operable in practice and relate them to theoretical developments on signal recovery from phase-less measurements by established algorithms. This connection is used to obtain in context of spherical near- to far-field transformation the first reconstruction guarantees for a number of sampling points close to information theoretical limits, hence, proving reliability of the method. We compare the new measurement procedure to established concepts like holography. In extensive numerical simulations, we will also test its applicability under additional structural assumptions like sparsity.The research results should answer the question how antenna characteristics can be reliably extracted from phase-less measurements.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/454773439",
    "project_id": "454773439"
  },
  {
    "title": "Time-Synchronization for Coherent Digital Signal Processing in Wireless Acoustic Sensor Networks",
    "abstract": "With the advent of smart home technology, acoustic sensor networks (ASN) have made a huge step from niche application to home appliance. Within an ASN, sensor nodes are not per se synchronized since individual oscillators in the nodes inevitably introduce a sampling-rate offset (SRO). Even small SROs in the order of parts per million may be detrimental to typical audio processing involving multiple nodes such as beamforming or source localization. Over a longer time period, small SROs will further accumulate substantial signal drifts that result in entirely asynchronous audio streams. Sampling rate synchronization is, hence, a crucial component for signal processing tasks in ASNs. In this project extension within the Research Unit (RU) \"Acoustic Sensor Networks\", we consider the dynamics that result from smart home settings as both challenge and opportunity for synchronization. In line with the overarching goals of the RU, we introduce the reliability of estimated SROs to reflect how well a particular acoustical scene lends itself to further signal processing. With several pairwise estimates obtained over time, we then fuse the information based on the reliability to obtain more stable synchronization in the long run. Furthermore, we extend the perspective from synchronizing two sensor nodes to an arbitrary number of nodes within a smart home by applying the fusion across the ASN. The 'Acoustic Map' foreseen in the RU acts as an interface to provide synchronization for other projects within the RU and allows high-level information to be exploited in order to facilitate synchronization efforts.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/318597153",
    "project_id": "318597153"
  },
  {
    "title": "Sampling theory and bases of exponentials: novel techniques in the foundations of communications",
    "abstract": "Sampling theory is a vibrant area of mathematical investigation and it continues to play a central role in applied sciences and electrical engineering.  In recent years,  fundamental progress has been achieved in the classical sampling theory and the theory of exponential bases and frames. To this end, new constructive methods were developed and functional analytic insights such as those stemming from the groundbreaking resolution of the Kadison-Singer problem were applied.This project builds on these new results, which include newly obtained properties of Riesz bases and frames of exponentials on Paley-Wiener spaces on finite unions of intervals and/or on finite measure sets, and the lack of uniform convergence of the Nyquist reconstruction formula in Paley-Wiener spaces of functions with non-square-integrable Fourier transforms. We seek Riesz bases and frames of exponentials with additional properties and refine results that are based on the positive solution of the Kadison-Singer problem. We also seek to obtain constructive versions of the existence results that are available today.  Furthermore,  we extend results on the lack of uniform convergence of Nyquist reconstruction formulas to irregular sampling formulas, for example, those developed by Papoulis. We expect that multiple related research foci in this proposal will lead to significant cross fertilization.The questions considered herein address the foundations of communications engineering and are directly relevant for current tasks in data transmission.  For example, the Balian-Low theorem for subspaces shows that avoiding critical density does not fully mitigate the Balian-Low phenomenon. This may have impact on the fifth generation mobile communications where time-frequency transmission methods such as orthogonal frequency division multiplexing are employed. We are guided by these considerations and hope to benefit from our collaboration with electrical engineers working in sampling theory and communications.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/437115893",
    "project_id": "437115893"
  },
  {
    "title": "Adapted converter topologies for GaN power electronics",
    "abstract": "Efficient energy conversion with power electronics is of continuously increasing importance in different areas as industry and automation, consumer electronics, transportation and electric grids, here especially concerning the integration of regenerative energy sources. Due to their excellent conducting and switching properties, power semiconductors based on Galliumnitride (GaN) offer the possibility to realize highly compact and at the same time highly efficient power converters. The technological option to manufacture bidirectional conducting and blocking transistors is promising in order to simplify existing and develop new converter topologies. In this research project, the limits of hard-switching GaN-converters in the kW power range is evaluated, making use of the bidirectional conduction behaviour of GaN normally-off transistors (HFETs) and applying optimized driver concepts and circuits. Bidirectional blocking GaN HFETs will be developed, manufactured and tested adapting the driver concept. Finally, the devices will be modelled. Using these models, alternative converter topologies will be simulated, evaluated and a demonstrator will be realized to show the potential of this new technology.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/277751567",
    "project_id": "277751567"
  },
  {
    "title": "Economics of Adaptation: Transitions of Autonomous Nodes in Consideration of User and Provider Preferences\r\n\r\n\r\n          (B03)",
    "abstract": "Subproject B3 investigates transitions in wireless communication systems at the edge of the Internet from an economic per-spective under the assumption of autonomously acting nodes. In phase II, the decentralized analysis and planning of proac-tive transitions based on game theory and Machine Learning were extended by incorporating environmental conditions and empirically determined user preferences. In phase III, the preferences of all players - users, infrastructure providers and ser-vice providers - will be investigated by means of large-scale user studies and expert interviews, from which additional boundary conditions for autonomous transition decisions and incentive mechanisms will be derived. In addition, novel game theoretical methods for applications with crucial requirements and decisions under uncertainty will be researched.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/233031105",
    "project_id": "233031105"
  },
  {
    "title": "Completed projects",
    "abstract": "How will the Internet of the future look like? Which forms of communications – as we know them today – will prevail, which novel forms of communications will emerge? What are the challenges faced regarding the constantly increasing mobile use of networks? To summarize: A grand challenge in communication systems stems from an increase in dynamics and variations of the conditions in which they operate, the constantly increasing amount of changes of use cases, and the growing quality re-quirements. The Collaborative Research Centre MAKI (Multi-Mechanism-Adaption for the Future Internet) addresses this challenge. In par-ticular, it investigates all kinds of mechanisms in communication systems, the adaptation, interaction, constant optimization, and evolution thereof. The term mechanism describes both, communication protocols and parts thereof – defining the func-tionality of communication systems – and the functional aspects of the distributed systems realized on top. We witness a con-stant development of novel mechanisms. Yet, mechanisms providing equivalent functionality under different conditions coex-ist, since an adaptation of legacy mechanisms to traffic conditions, bandwidth, etc. is limited. Particularly mobile usage induces highly fluctuating conditions, which would require the online adaptation of the communication system by means of transitions between functionally equivalent mechanisms – which is mostly impossible as of today. Interactions between mechanisms that jointly depend on each other are more complex still and require coordinated transitions in groups of equivalent mechanisms, so-called multi-mechanisms-adaptation.Goal of the CRC is to enable such automated transitions between functionally equivalent mechanisms in communication sys-tems at runtime. It includes the coordination of multiple concurrent transitions, which influence each other. We face this chal-lenge in the context of the international research efforts towards a “future Internet”. We consider the plentiful coexistence of mechanisms a great opportunity rather than a curse, stimulating innovation. However, significant advances in research are re-quired to enable individually as well as jointly coordinated (multi-) transitions between mechanisms at system runtime. We aim at a paradigm shift in the global Internet research. We believe that a targeted effort of the given CRC-scale size is required to deal with the ever increasing complexity, variability, and dynamics of the Internet that coincide with a deluge of novel applica-tions and constantly increasing quality requirements.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/210487104",
    "project_id": "210487104"
  },
  {
    "title": "Adaptive Millimetre-wave Integrated TranSmitters",
    "abstract": "Millimetre-waves enable ultra-high data rates. However, the high propagation loss limits the coverage range. At the expense of a large dc power, the coverage range and the data rate can be massively increased by using antenna transmitters featuring a large number of active paths. In ADAMIS we want to explore novel architectures and methodologies for millimetre-wave systems allowing an optimum trade-off regarding data rate, transmission distance and dc power consumption by applying adaptivity at system, circuit and device level. For this purpose, an adaptive transmitter frontend is developed, which features multiple switchable and tuneable active paths. At very low coverage range up to a few centimetres (e.g. for on-board communication) and/or low data rates, only one active antenna path with low directivity is activated. The circuits operate in a low power mode and the vector modulators are deactivated. For large distances (up to 10 m) and/or large data rates (up to 50 Gb/s) all active antenna paths incl. vector modulators for beamforming are activated. In this mode, the circuits operate at maximum gain and output power. At millimetre-wave frequencies, the variable gain amplifiers required within the vector modulators strongly change their phase versus gain requiring a complex control. We will investigate advanced topologies solving this problem, e.g. by cascading stages with inverse errors. To better understand and optimise the circuits we derive analytical expressions for the relevant transfer functions. For the adjustment of the parameters (number of paths, power and vectors), we study and compare two approaches: First, by scanning the parameters at millimetre-wave frequencies and measuring the receive strength or bit error rate, and second, by employing a low-power 2/5 GHz radar for positioning of the transmitter and the receiver. Hence, the optimum transmission angles and distances can be reliably extracted up to large distances. The latest IHP BiCMOS technology is used for the development of the frontend operating at 220-270 GHz. Each path consists of an antenna, a power amplifier, a vector modulator, a mixer, a frequency quadrupler and a binary phase modulator. Several antenna structures and packaging concepts will be investigated. To test the developed transmitter frontend, a receiver using existing lab-equipment will be designed. To minimize the power consumption and to allow the realisation of a fully integrated transmitter within the limited resources of this project we will focus on BPSK (binary phase shift keying) modulation, which can be realised with almost negligible dc power consumption by exploiting the differential circuit phases. Hence, no power consuming data converters are required. Due to the large available bandwidth of up to 50 GHz, a high data rate of 50 Gb/s is possible. In the low data rate and/or low distance mode, ultra-low dc power consumption is possible.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/394221495",
    "project_id": "394221495"
  },
  {
    "title": "Adaptive Mehrbereichs-Sensorarrays zur Vibrationsanalyse\r\n\r\n\r\n          (A 04)",
    "abstract": "Project DetailsBackProjektAdaptive Mehrbereichs-Sensorarrays zur Vibrationsanalyse\r\n\r\n\r\n          (A 04)Subject AreaElectronic Semiconductors, Components and Circuits, Integrated Systems, Sensor Technology, Theoretical Electrical EngineeringTermfrom 1998 to 2006Project identifierDeutsche Forschungsgemeinschaft (DFG) - Project number 5479322Project DescriptionNo abstract availableDFG ProgrammeCollaborative Research CentresSubproject ofSFB 379: \nMicromechanical Sensor and Actuator ArraysApplicant InstitutionTechnische Universität ChemnitzProject HeadProfessor Dr.-Ing. Jan  Mehner",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/5084472",
    "project_id": "5084472"
  },
  {
    "title": "Adaptive Multi-scale Transient Modeling and Efficient Simulation of Wide-area AC/DC Power Systems",
    "abstract": "The theory of frequency-adaptive simulation of transients（FAST）offers a methodological framework of multi-scale simulation of AC power systems. It relies on the addition of an orthogonal imaginary part to the real AC waveforms and so allowing the Fourier spectra of the resulting analytic signals to be shifted in the frequency domain. Without shifting, the real part of the analytic signal represents the original waveform. By shifting the spectrum of the analytic signal by the carrier of 50 Hertz towards lower frequencies, the carrier is effectively eliminated, and the envelope can be efficiently tracked at a large time step size. However, future power systems do not only rely on AC, but increasingly also on DC signals. AC/DC power systems with integrated AC and HVDC technologies including power electronic converters are of increasing interest, in particular also in China and Europe. The operation, control, and protection of AC/DC power systems are significantly more complex compared with the AC-only system.This project aims at pushing forward the state of art in multi-scale transient modeling and simulation of AC/DC power systems. The accurate and efficient simulation of diverse AC/DC transients across large time scales will support the in-depth analysis and opens the opportunity of real-time applications to ensure operational security and stability of AC/DC power systems. By developing multi-scale models of components with strong nonlinearities, such as power electronic converters or transformers in saturation, the modeling method based on the FAST frequency-shifting theory becomes fully capable of emulating large-scale AC/DC power grids.Taking full advantage of fine-grained parallel computing and the FAST method, a high-performance simulation technique and platform is researched and developed for speeding up multi-scale simulation to enable very fast and accurate AC/DC power system analysis. The platform is further enriched through cloud computing capabilities. The resulting functionality offers a novel paradigm of cooperative work on simulation. The concept will first be put into evidence by international collaboration between the project partners in Europe and China. It is then extended to contribute to broader collaboration of power-area academia and industry in both countries by offering highly scalable and efficient analytic capabilities.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/410829522",
    "project_id": "410829522"
  },
  {
    "title": "Adaptive Quality of Service Provisioning for an Efficient and Resilient Operation of Smart Distribution Grids",
    "abstract": "The operation of modern energy systems is based on a large number of measurement, control and automation tasks for monitoring and operating extensively distributed resources. For these tasks, e.g. voltage stability monitoring or state estimation, different quality of service (QoS) requirements must be guaranteed, as they serve as the basis for higher optimization functions that realize reliable, efficient and forward-looking overall system operation. In transmission systems, a dedicated and high-performance communication infrastructure allows a parallel execution of these communication-intensive functions and services. In the course of the expansion of renewable energies at lower voltage levels of the distribution networks and the shift of system responsibility to (operators of) these plants and systems, similar functions and services must also be implemented at the distribution network level in Smart Grids – so-called ”Smart Grid Services” (SGSs). A comparable digitalization as in the transmission grid does not exist due to different planning approaches, but mainly for cost reasons. Therefore, in addition to the optimization of energy-related processes in the distribution networks, reliable, efficient, adaptive and forward-looking planning and operation of SGSs via heterogeneous and more resource-limited communication systems are required. To our knowledge, there is currently no suitable method for an adaptive QoS provisioning that both takes into account dynamically changing QoS requirements and priorities of SGSs and is able to guarantee the QoS requirements of critical services. In this project, we will therefore conduct research on online reconfiguration methods based on a two-step QoS-provisioning approach: At a first level, discrete optimization is used to find an allocation of SGSs to available servers and allocation of flows to paths through the communication network based on a topological view of the compute, storage, and communication facilities. At this level, all flows are simply characterized by bit rates. At a second level, Network Calculus is used to ensure analytically that all critical SGSs can meet their QoS requirements. For this purpose, traffic characterizations of flows are more detailed and incorporate also burstiness and the behavior of network elements can be described in more detail but still on an abstract level by service curves. If QoS requirements of critical SGSs are violated, iterations over the two steps are necessary. The overall effect of the two-step approach will then be assessed by simulation in order to validate whether the two-step QoS-provisioning approach works well and to check the impact of the allocation on the non-critical SGSs. The approach then needs to be extended in order to take the conditions during reconfiguration into account as well.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/470145579",
    "project_id": "470145579"
  },
  {
    "title": "Flexible image sensor with adaptive high-speed wireless connectivity",
    "abstract": "The aim of the proposed work is the realization of high-speed wireless data transmission from a compact, mechanically flexible and electromagnetically adaptive module comprising: (i) a mechanically flexible image sensor generating large amount of data which require high-speed transmission, (ii) a mechanically flexible silicon CMOS integrated circuit for data processing and wireless data transmission at frequency around 5.5 GHz, (iii) a mechanically flexible and adaptive antenna. Besides supporting mechanical flexibility, the adaptivity of the antenna, which is supported and controlled by the flexible radio frequency transmitter circuit, adapts the module to varying electromagnetic environment, such as a dielectric body of low or high permittivity or a metallic surface where the module attaches. A particular focus will be set on overall system energy efficiency in view of suitability of a future, battery-powered, implementation. The enabling functionality of the proposed flexible and adaptive module will span its applicability over wireless sensor network / IoT application areas as various as medicine, logistics, sensing.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/273042208",
    "project_id": "273042208"
  },
  {
    "title": "Additive Manufacturing of electric machines: Research on the potential of additive\nmanufacturing of PM synchronous machine rotors",
    "abstract": "Additive manufacturing processes produce components and assemblies layer by layer without using formative tools. This process generates additional and new degrees of freedom in designing the geometry of the components as well as in designing the material properties. The focus of this research project is to use these new degrees of freedom for improving the design and manufacturing of electrical machines, especially of rotors of permanent magnet excited synchronous machines (PMSM). In previous research, fundamental knowledge on different material systems for AM, their characterization and their application in electrical machines were achieved in tight cooperation between the University of Paderborn's Direct Manufacturing Research Center (DMRC) and the Institute for Drive Systems and Power Electronics (IAL) of Leibniz Universität Hannover. The research project proposed here addresses the fields 'material research for AM', 'rotor design', 'rotor manufacturing' and 'rotor test'. On the field of material research, suitable soft magnetic materials for electrical machines and the respective process parameters for AM are identified by means of systematic parameter studies. The focus lies on one FeCo and two FeSi alloys. In order to characterize these materials, their electrical, magnetic and structural mechanic properties shall be determined on AM test specimen. These results shall be used in the second phase of the project for designing rotors of PMSM. The identified material properties and the new degrees of freedom in design due to AM shall be used to improve the manufacturability and the technical parameters of PMSM, e.g. by rotor skewing without increasing the PM leakage flux and by reducing eddy currents on the rotor surface with a special surface shaping. For these new AM rotor concepts, design rules are required for both, electromagnetical and mechanical design. These shall be elaborated in order to care for robust design and easy manufacturability.In the third phase of the project, prototype rotors shall be manufactured by AM and, if required, mechanical or thermal postprocessing. Finally, these rotors will be evaluated by experiment in order to validate the predicted electromagnetical and mechanical properties and operational behaviour, e.g. torque density, efficiency, and torsional strength. In order to demonstrate the benefits of AM for electrical machine manufacturing, comparisons shall be made to conventionally manufactured rotors by simulation as well as by measurement.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/406108415",
    "project_id": "406108415"
  },
  {
    "title": "Additive manufacturing of a multiplexed impedimetric\nbiosensing system: laser-boosted nanolithography for\ntargeted bacteria detection",
    "abstract": "The proposed project aims to design and investigate a multiplexed (bio)sensing platform based on additively manufactured carbonaceous nanostructures on elastic biopolymer functional substrates and selectively tailored with phospholipid membranes. The nanostructures will be assembled by laser-induced graphitisation and scanning probe lithography. Phospholipids have shown higher mobility on graphene compared to other commonly used substrates such as silica, making this an attractive route for non-covalent immobilisation of various functional groups and recognition elements on graphene for biosensing applications. The proposed approach allows rapid and simultaneous fabrication of a variety of different carbon nanostructures on small areas, which can be directly functionalised with tailor-made phospholipid membranes and specific receptors, paving the way for inexpensive and readily available biosensors. The project goes beyond the current state of the art in several areas.The additive nanomanufacturing (ANM) process will be developed to induce one-step graphitisation and to modify natural materials lacking intrinsic aromatic structures, such as cellulose. By selective tuning of process parameters and substrate pretreatment, complex 3D mesostructures with tunable pore diameters, surface functional groups and good wettability will be formed, which are crucial for enhancing (bio)sensor capabilities by increasing the electrochemical surface area. The freedom of multielectrode arrays (MEA) design and fabrication enables a multiplex recognition of biomolecular interactions upon their surface functionalisation with different recognition elements - either directly or on lipid layers depending on type - for specific pathogen markers. Pathogenic  E. coli strains will be selected as a proof-of-concept analyte for the studies. The multiplexed approach will allow a more thorough detection and enable distinction of the target to other strains with overlapping markers by fingerprinting the signal for all target markers instead of relying on only one. The mechanism of chemical-to-electrical signal processing within customisable receptor layers will be investigated and elucidated through experiment, simulation, and multivariate data analysis, where the multiplexed geometry will allow a deeper understanding of the substrate/lipid interface and push towards rapid screening and optimisation of substrate nanoarchitecture from the chemical to the morphological scale. Finally, multiparametric impedance discriminant analysis is applied to the second generation of optimised multiplexed MEA sensors for simultaneous multi-analyte diagnostics. The novelty starts with the coupling of MEA to the lipid layer a sa versatile tool for subsequent functionalisation, and culminates in the application of the multisine impedance tool, whichallows on-line in-situ monitoring and analysis of non-stationary chemical/physical binding processes at the analyte/lipid interfaces.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/544666650",
    "project_id": "544666650"
  },
  {
    "title": "Additive Technology for 3D-Shapeable Millimeter-Wave Passive Components",
    "abstract": "Performance of millimeter-wave passive components, which are needed, for instance, for wireless communication and sensing, is widely influenced by the materials and manufacturing technologies these components are based of. There is a strong need for innovative cost-efficient, high-performant techniques to realize such components. The project aims to explore ground laying aspects for the cost-efficient manufacturing of 3D-shapeable millimeter-wave passive components using additive manufacturing, that is, printing technology. The project will address single-layer and multi-layer manufacturing of 3D-shapeable interconnects and circuits by several different printing technologies. The project will explore the combination of printed dielectric and printed metal structures, together with their requirements and performances for millimeter-wave passive circuit components. It will determine possibilities and limitations of inkjet, dispensing and 3D filament printing. Materials and test structures will be thoroughly investigated with respect to technological usability and millimeter-wave performance. Example structures that will be designed and characterized, for operation between 30 GHz and 140 GHz, will include a variety of transmission lines, antennas and planar-to-waveguide transitions.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/528098204",
    "project_id": "528098204"
  },
  {
    "title": "Additive manufacturing of dielectric phased array antennas with liquid crystal beam-steering for future integrated millimeter wave systems",
    "abstract": "In the W-band and at higher frequencies, tunable planar RF components can no longer be used reasonably due to their high losses. In the previous research project the foundation was therefore already been laid for novel, low-loss, tunable RF components based on dielectric image lines (DIL) filled with special microwave liquid crystals (LCs). Initial phase-shifting test structures demonstrate the functional principle, but since they are individually milled and have open cavities, their integration into larger system turns out to be difficult. Closure of the cavities of these LC-based dielectric components in turn requires adhesive, which causes additional losses. Accompanied with adhesion problems that sometimes even lead to failures due to LC leakage, making broader and reliable usage of this dielectric technology difficult.Innovative additive manufacturing methods, on the other hand, eliminate troublesome air gaps by printing the dielectric material directly onto a metallic ground plate and do not require lossy adhesives to stick them to the metallic ground plate or to seal the resulting LC cavity. In addition, this method allows subsequent patterning of metallized structures on top of the DIL for the controlling electrodes to orient the liquid crystals.Therefore, within the scope of this targeted research project, basic principles, innovative concepts and methods for additively manufactured, integrable, electrically tunable components based on DIL topology in the millimeter-wave range are to be created, respectively developed. The research and testing of innovative additive manufacturing methods is exemplified by individual components and a complete dielectric phased array antenna in the W-band, consisting of the individual antenna elements, liquid crystal phase shifters and a feed network. One goal is to demonstrate the feasibility of tunable DIL components by using this new fabrication method, to explore the current limitations of additive manufacturing of RF components as well as to develop appropriate and dedicated design methods. The knowledge gained will be used to ensure future reliable manufacturing and design rules. In this context, the following tasks are planned: 1.) the investigation of printed, non-tunable antenna elements, which are, however, already compatible with LC integration and 2.) the extension of this process to the production of closed dielectric mirror lines with LC cavity as well as 3.) the exploration of integrated electrode structures, which are directly applied to the printed dielectric mirror line. Finally, 4.) the analysis and testing of a fully printed steerable phased-array antenna will be carried out in a dielectric mirror line topology.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/398656024",
    "project_id": "398656024"
  },
  {
    "title": "Additively manufactured multi-spectral NIR-THz sensor systems",
    "abstract": "The proposed project aims for the development of an additively manufactured, multi-spectral sensor system with a low cost, disposable or reusable sensor element for applications in spectroscopy and life sciences. The compact, photonic-Tearhertz (THz; 100 GHz-10 THz) co-integrated sensor will synchronously capture spectroscopic data in the near infrared range (~1550 nm; NIR) and in the THz range (0.1 THz- 1.25 THz with potential extension towards 2 THz) whilst using only one NIR laser system driving both parts of the sensor. The THz system will be a homodyne photomixing setup. The sensor system will be composed of additively manufactured dielectric waveguide circuitry for both the near infrared as well as the Terahertz range. Both the actual sensor element as well as the photonic backbone will be composed of such waveguide structures and components like splitters or in- and outcoupling optics that will be developed in WP1. THz waveguide materials will be TOPAS, polyethylene, polypropylene or high impact polystyrene. For the NIR domain PLA, HD glass or ABS will be used. The substrate will be polyethylene, quartz or metallized quartz glass. WP2 focuses on the sensor elements with sufficient sensitivity. Three different system architectures are targeted: Architecture i will be tailored to samples under test with low or medium absorption, such as oils. Resonator structures will be implemented. Architecture ii will focus on samples under test with high THz absorption. The sensor will be a microfluidic cell. The sensor element of architecture i and ii will be disposable. Architecture iii will be a reusable transmission, total internal reflection, or reflection-based setup, with an active sensor element integrated at the tip of a co-parallel NIR and THz waveguide. In WP3, the system will be integrated with active structures (sources and receivers) in order to carry out benchmarking applications. To verify the capabilities of the system we focus on life-science-relevant substances such asvitamins in oils, sugars in water and also more complex substances. Analytical modelswill be implemented in order to discriminate several mixtures of lifescience-relevant substances. The technologies developed in this project will have large potential for further sensor technologies and integrated NIR & THz systems. The project will be carried out in a collaboration between the Terahertz Devices and Systems Laboratory of TU Darmstadt (Sascha Preu) with profound experience in THz spectroscopy and dielectric THz waveguides and the TH Ostwestfalen-Lippe (Oliver Stübbe) with a long-term background in additive manufacturing of optical components and in optical communication and sensor systems.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/502254396",
    "project_id": "502254396"
  },
  {
    "title": "Adiabatic frequency conversion driven by the electro-optic response of potassium tantalate niobate mixed crystals",
    "abstract": "In this project, we plan to realize and investigate an optical frequency converter that shifts the frequency of laser light by several 10 THz (> 50 nm at 1 micrometer wavelength). Here, 100 % of the pump photons shall be converted on the nanosecond time scale and in a single system for all wavelengths from the visible to the edge of the mid infrared. The magnitude of the frequency shift follows an applied electric voltage such that almost arbitrary temporally varying shifts can be realized by voltage modulation, e.g. linear frequency chirps.This shall be enabled by adiabatic frequency conversion. Its acoustic analog is well known: If one plugs a guitar string and varies its length during the ring-down time, the pitch of the tone changes accordingly. This concept can be transferred to optics: Here, light is coupled into a resonator and the optical size of the latter is changed during the ring-down time. The frequency of the circulating light strictly follows the one of the varying resonance frequency. This scheme for optical frequency conversion has significant advantages over conventional methods. All intracavity photons are converted, i.e. the internal efficiency is 100 %, independent of the light intensity. This process works without taking care of phase matching, i.e. for light at all wavelengths that can circulate in the resonator. So far, only relatively small frequency shifts of the order of 100 GHz have been realized (1 nm at 1 µm wavelength). We plan to increase this value by two orders of magnitude. This shall be achieved by employing whispering gallery resonators made of potassium tantalate niobate crystals (KTN). They possess a temperature controllable transition between a ferroelectric and a paraelectric phase. Close to this phase transition, KTN crystals have extraordinarily large electro-optic coefficients. They might pave the way for a 10 % refractive-index change at electric fields of only a few kV/mm.Electro-optically driven adiabatic frequency conversion is almost unexplored. In order to achieve our ambitious goal – the realization of the abovementioned frequency converter – first, fundamental scientific questions have to be answered: What is the spatial distribution of the intracavity electric field built up by applying a voltage to the electrodes? Is there a difference between the ferroelectric and the paraelectric phases regarding the internal electric field? How close to the phase transition the system can be operated? Is there a limit for the external electric field beyond which charges are injected into the crystal? The latter might influence the internal electric field or reduce the rind-down time. In which wavelength and power range adiabatic frequency conversion can be achieved?We expect that this project will strongly inspire the scientific investigation, the technical development and the application of novel frequency converters. They might be employed for distance measurement and fast spectroscopy.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/451963068",
    "project_id": "451963068"
  },
  {
    "title": "Advanced Physical Layer Techniques for Wireless Communication Networks - A Factorization Approach",
    "abstract": "The research project addresses the potential benefits of Advanced Physical Layer Techniques in wireless communication networks. In the previous part of the project, we analyzed a Network Utility Maximization problem on the basis of Shannon Rate Models for describing error-free information transfer in a network. This led to decomposition approach, referred to as Network Factorization, which is tightly related to Scheduling as the Medium Access Technique of first choice. The proposed approach thus inherently corresponds to an inner approximation of the unknown capacity region of the respective network. In this renewal project we rely on a conceptionally new model based on a different understanding how to model the Wireless Broadcast Advantage in network coded communication networks. The new concept is based on the introduction of abstract Broadcast Functions for describing the information flow from a transmitting node in a network over its outgoing links. It has been shown that an appropriately defined broadcast function and its respective rate region is tightly related with a Polymatroid Formulation known from graph theory. The goal of this renewal project is thus to understand Polymatriod Flow Models for network coded communication systems in its most general conception and to analyze the joint optimization of the information flow, the Medium Access Control mechanism, and the underlying Physical Layer Parameters in a wireless communication network simultaenously based on the suggested polymatroid flow models. In contrast to the first part of the project we extend our focus on Non-Shannon Rate Broadcast Models, Random Access Techniques, and Physical Layer Techniques beyond pure broadcast channels.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/140965227",
    "project_id": "140965227"
  },
  {
    "title": "Aggregation of the ancillary service potentials of the distribution system level at multiple vertical system interfaces in the context of hierarchical multi-level grid control strategies",
    "abstract": "The transition of the electric power system results in a massive integration of decentralized energy resources (DER), especially in the distribution grids, as well as to a temporary displacement of large thermal power plants in the transmission grids with a resulting reduction of their ancillary service potentials. This leads to an increasing number of e.g. cost-intensive redispatch measures and to a need for grid expansion measures in the future. In contrast, the distribution system operators (DSOs) have access to the ancillary service potentials of the DER and electrical energy storage systems as distributed active and reactive power flexibilities that can be controlled according to demand. These flexibility potentials can be used by the DSOs to optimize their own system operation as well as for the provision of ancillary service potentials to the higher-level system operator, e.g. a transmission system operator (TSO). An intensification of TSO/DSO- and DSO/DSO-interactions at the vertical system interfaces is necessary to enable the use of these flexibility potentials in the different system levels. For this purpose, hierarchical multi-level grid control strategies represent a suitable concept. Hierarchical approaches are based on the aggregation of all distributed flexibility potentials of a DSOs system at a single system interface to a corresponding active and reactive power flexibility region (PQ-polygon), the so-called Feasible Operation Region (FOR). The FOR represents the flexibility potentials of the DSO for adjusting the vertical active and reactive power flows within a specific operating point. Within the operational management of the TSO the flexibility demand required from the lower-level system is determined within the limits of the FOR and communicated to the DSO. Within the framework of a cascading process, distributed flexibility potentials can thus be made available to the higher-level system operators at the vertical TSO/DSO- or DSO/DSO-system interfaces to ensure the stability of the overall system. Methods for the determination of the FOR discussed in literature so far are only applicable for a single vertical system interface. In the case of multiple vertical system interfaces, e.g. between a TSO and a DSO, complex vertical and horizontal dependencies between the interface variables arise due to the meshed grid structure. Thus, there are also corresponding dependencies between the FORs of the interface busses. The objective of the proposed research project is the development of methods and procedures for the aggregation of the flexibility potentials of flexibility-providing DER in lower-level systems at multiple vertical system interfaces as multidimensional FORs. A second objective is the implementation of these multidimensional FORs in the operational management of the higher-level system operator in the context of hierarchical multi-level grid control strategies.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/497762376",
    "project_id": "497762376"
  },
  {
    "title": "Active damping of filter based line side harmonics for matrix converter as drive converter with direct and space vector modulated control strategies",
    "abstract": "In the continuance application the LC-filter based line side system perturbation takes centre stage.The filter capacitor voltage and the line side current show unacceptable harmonic content independent of the control strategy. These harmonics result out of the of resonance behaviour of the line side LC-filter in combination with line side voltage harmonics and current harmonics produced by the matrix converter modulation. By adding active damping methods to different control strategies the quality of the line side current should be improved with respect to national standards. Because of the reduction of passive filter components the efficiency of the matrix converter will be increased. The efficiency of the electrical machine will decrease because of additional losses. Furthermore the matrixconverter will work more stable and a reduction of the space needed by the filter will be possible.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/157988629",
    "project_id": "157988629"
  },
  {
    "title": "Active Millimeter-Wave On-Wafer Measurement Probe",
    "abstract": "The characterization of millimeter-wave integrated circuits (MMICs) requires a highly expensive setup using a network analyzer, frequency extension modules and an on-wafer measurement. The waveguide connecting the on-wafer probe to the extension module, as well as the extension module itself, are significantly limiting factors for the achievable instantaneous frequency range. Hence, a full characterization of a very broadband state-of-the-art MMIC requires an impractical multiple number of measurements with different frequency extension modules and on-wafer probes for the different frequency ranges. In addition, the large size of the extension modules prohibits their use together with probe cards, which includes a high number of probes. This severely limits the development of fast and low-cost verification methods for modern multi-channel radar and communication transceivers.In ActiOnPro we want to explore novel architectures and methodologies for millimeter-wave on-wafer measurement techniques where several frequency extension modules are integrated together with multiplexers into the on-wafer probes. The new architecture will have the following advantages:-\tUltra-broad bandwidth from DC to several 100 GHz-\tNo limitation of instantaneous bandwidth by wave-guide bands-\tVery compact size allowing integration in probe cards or just more flexibility on the probe stationOne very interesting application of the new architecture is to generate a sustainable low-cost extension of an existing DC-110 GHz broadband network analyzer system to DC-220 GHz. In ActiOnPro we will explore the feasibility of the new concept and realize a first demonstration of this DC-220 GHz solution.For this purpose, the latest IHP BiCMOS technology is used to develop frequency extension module circuits consisting of frequency multipliers, mixers, amplifiers and couplers between 110 GHz and 220 GHz. These frequency extension modules are mounted into the probe and all connected to the same probe tip via a multiplexer. In addition, the multiplexer routes low frequency signals from DC to 110 GHz directly to the commercial frequency extension module of the existing vector network analyzer through a 1 mm coax connector. A novel ultra-broadband connector based on coplanar lines will allow replacement of probe tips and thus accommodate the different life time of the probe tip and the rest of the new probe. In parallel to the practical designs a study of the system behavior depending on the number of used frequency bands considering the required chip space, IC performance and the multiplexer’s insertion loss will help to optimize the detailed system architecture. With ActiOnPro all functionalities will be packaged into the probe housing resulting in a compact, fully integrated ultra-broadband on-wafer measurement probe with integrated frequency extension modules.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/446397162",
    "project_id": "446397162"
  },
  {
    "title": "Active Probe for On-Wafer SiGe HBT Device Characterization up 750 GHz (APSiCa)",
    "abstract": "The project APSiCa aims at developing active mm-wave probes for the frequency range 220 to 750GHz. These probes will then be used for characterization, modeling and verification of the developed models of HBTs. In contrast to the currently used probing approach, the proposed solution uses a novel contacting. Additionally, the necessary frequency extenders (alternatively reflectometers), will be integrated directly into the proposed probing device. Thus, a difficult measurement setup using bulky, external frequency extenders can be avoided. The special design allows for a compact contacting of the on-wafer structures to be measured and avoids crosstalk or coupling from one port to the other. Due to the arrangement of the probe tips, a higher placement accuracy as well as repeatability for on-wafer measurements can be achieved. By integration of the frequency extenders directly into the proposed probing device, no difficult measurement setup or any special equipment is needed anymore. By following this idea, a network analyzer can be connected directly to the proposed probing device instead of bulky external frequency extenders. For the probing device with integrated reflectometers, the expensive network analyzer can be replaced by a simple processing electronic. In parallel to the development of the proposed probing device, existent compact transistor models will be extended to higher frequencies. The currently existing models are deduced from low frequency measurements and are usually not verified for frequencies above 110GHz. The models extended to higher frequencies can then be evaluated by measurements with the proposed probing device. For lower frequencies, for which the currently used probing approach is available, measurements can be performed with both solutions. Thus, a performance evaulation as well as a comparison to the currently used probing approach becomes possible.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/409756603",
    "project_id": "409756603"
  },
  {
    "title": "Active THz Transceiver Components",
    "abstract": "Compared to radios operating at purely optical wavelengths or RF/microwave frequencies, the combination of extremely high absolute bandwidths and high relative bandwidths in the THz frequency regime, paired with the severe performance limitations of technologies operating in the so-called \"THz-gap\", imposes unique challenges on modern digital transmission schemes relying on high signal integrity. Since no direct DSP is yet possible at THz frequencies, signals need to be frequency-shifted into and from the THz range. This frequency-shifting is performed by the transceiver, which can be implemented based either on fully electronic, fully photonic or mixed electronic-photonic technologies. The latter approach is today the most promising way forward since it allows to combine the unique advantages of both domains, namely the low receiver noise, high transmit power and high functional integration density of electronics-based THz transceivers, with the high spectral purity and high quality phase and frequency control of photonics-based THz signal generation.Project B2 of Meteracom aims at developing a theoretical and experimental understanding of the design of THz transceivers based on electronic and photonic technologies, as well as circuit design and simulation methods of optimizing their application-specific characteristics, in view of pushing their data rate capability, modulation format versatility and system gain. The project will also provide a technology platform for the experimental validation of the Terahertz metrology concepts investigated in the frame of the other projects.Electronic THz transceiver circuits operating within the WR3 frequency range from 220 to 325 GHz will be investigated, with a particular focus on ultra-wideband (> 60 GHz) channel bandwidths, as encountered in THz communication, radar and metrology applications. In an application-oriented top-down design approach based on theoretical analysis and system-level CAD simulations, the sensitivity of the vectorial signal degradation of communication signals on the impairments of heterodyne, quadrature electronic THz transmit receive frontends will be studied, experimentally evaluated, and finally minimized in dedicated transceiver circuit design.Complementing the active THz transceivers, highly stable and spectrally pure photonics-based signal generation with the help of mode-locked lasers will be investigated, serving, both, as a tunable THz signal source and as a stable local oscillator to the electronic transceivers.Experimental validation in this project will comprise the time and frequency domain characterisation of the individual electronic and photonic transceiver components, as well as complete data transmission experiments using combined photonic-electronic transceivers in a back-to-back configuration, as well as existing THz transceivers with air interface from prior art.",
    "dfg_label": "4.42",
    "fachkollegium": "42",
    "source_url": "https://gepris.dfg.de/gepris/projekt/424608191",
    "project_id": "424608191"
  },
  {
    "title": "2C-NOW: Collaboration and Coordination in Networks of Work - Phase 2: Hybrid Workgroups and Workspaces",
    "abstract": "In Phase 2 of our project, we extend and deepen our existing research findings in two main directions. First, we build on our trace analytics work to extend our methodological toolkit through the design of trace ethnographic methods and tools. Second, we develop in-depth empirical studies of recent transformations to work routines and work practices arising from the growth in hybrid work and hybrid workgroups in organisations. Together, these provide both empirical evidence and insights into how new arrangements for hybrid work are transforming working worlds and enable rich contextual analyses of hybrid workgroups and emerging coordinative practices. Our goals are to 1) develop and apply digital ethnographic methods to provide rich contextual analyses of the rhythms and flows of everyday work in hybrid and distributed work settings, 2) analyse and understand emerging sequences of coordination work to identify emerging work routines and patterns of interaction in hybrid and distributed workgroups, and 3) to examine the ways that technologies and artefacts are mobilised in the design of digital workspaces. Through our university-industry research initiative (IndustryConnect) we have, over the past ten years, been following the emergence and design of digital workplaces in a group of more than 35 DACH organisations. In Phase 2, we continue to work closely with these organisations to develop longitudinal digital workplace case studies. Through further interviews, surveys and focus group methods, we gather organisational data about hybrid workgroups and hybrid working arrangements. In addition, innovative digital ethnographic methods in the form of digital hybrid work diaries and work visualisation methods will be developed and used to capture, visualise and analyse new forms of rich, longitudinal data about the everyday rhythms and work routines of distributed and hybrid workgroups. In the context of the overarching framework of the Priority Programme SPP2267, our work contributes to understandings at the micro- and meso-levels of activity, examining transformations to technologies, work practices and routines as they arise for individuals, workgroups and organisations. In terms of the three motion dynamics, we address all three dynamics by investigating 1) how work practices are being shaped (and are shaping) the use of collaboration technologies to organise and coordinate everyday work (permeating); 2) how organisations assemble their collaboration platforms and the ways that collaboration technologies are adopted and diffuse across organisations (making available) and 3) how work practices evolve and whether (or not) they become standardised and embedded as organisational-level work routines (perpetuating). In Phase 2, we extend the interdisciplinary nature of our inquiries and contribute important methods, datasets and case studies to the planned joint work with the WZB, University of Bielefeld and TU Berlin.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/442171294",
    "project_id": "442171294"
  },
  {
    "title": "2D Map Displays to Support Neurosurgical Interventions",
    "abstract": "For the planning of complex surgical interventions, 3D models of relevant anatomical and pathological structures are used. Primarily, these models were developed for preoperative surgery planning. Due to the often very high geometric complexity and the associated interpretation and interaction effort for the viewer, the potential of 3D models during surgical interventions can only be exploited in a limited way.During a 12-month research stay at the Surgical Planning Laboratory, Department of Radiology, Brigham and Womens Hospital, Harvard Medical School, Boston, USA, this problem shall be analyzed in more detail for neurosurgical interventions. Therefore, a new method for 2D map display for navigational support during neurosurgical interventions shall be designed, developed, and evaluated. During the concept and prototype development, potential users of this method will be involved in a user-centered development process. A close cooperation is intended with the neurosurgeons at Brigham and Womens Hospital, especially with the Neurosurgical Brain Mapping Laboratory. This concerns the analysis and definition of requirements, and the evaluation of the methods in a clinical surrounding. During the research stay, algorithms that provide classified, weighted neurosurgical data for a 2D map display shall be explored. Based on these algorithms, a prototype for the visualization of relevant neurosurgical data in the form of a 2D map display shall be created.The project results shall deliver findings about additional advantages of the new 2D illustration techniques over conventional visualization techniques. It shall be investigated which visualization parameters are adequate for precise and secure neurosurgical interventions. The findings can be used to improve visual navigation support for neurosurgical interventions and to reduce the risk of medical interventions in the future. Furthermore, the results could build an important basis for subsequent studies in the field of intraoperative visualization.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/348271461",
    "project_id": "348271461"
  },
  {
    "title": "3D-Modelling of seafloor structures from ROV-based video sequences",
    "abstract": "In underwater imaging and underwater 3D reconstruction, most researchers still use the perspective camera model, even though refraction at the glass interface of the underwater housing occurs [SK11]. It can easily be shown, that the single-view-point camera model (SVP model) is invalid due to refractive effects. Even though this has been known for a while, no Structure-from-Motion system (SfM system) explicitly models refraction effects. Therefore, the overall goal of this project is to evaluate the use of refractive image formation and to compare it to the classical perspective SfM approaches. Preliminary studies and our results of the first project phase already indicated that the systematic model error caused by using the perspective camera model leads to a pose estimation error, when reconstructing the camera path of an underwater image sequence [SK11]. We expect that the correct physical modeling of refractive image formation will lead to improved camera models that will eliminate the systematic errors in perspective 3D modeling. The resulting 3D models can then be used for improved volumetric measurements of seafloor structures.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/68506282",
    "project_id": "68506282"
  },
  {
    "title": "3D-Surface Reconstruction",
    "abstract": "The focus of P5 is the estimation of dense and high-resolution 3D reconstruction from the available image data.  To this end, we pursue a two-stage strategy:(1) Based on the onboard stereo camera, we aim at computing a crude semi-dense visual SLAM (depth maps, geometry and camera motion).  It is computed at video frame rate on the quadrotor and takes into account the statistical uncertainty of 3D locations and image information.(2) On the ground station, we improve the semi-dense 3D reconstruction toward a high-resolution dense 3D reconstruction by also taking into account the high-resolution images from the main sensor. More specifically we plan to generate dense depth maps which are then fused to a dense 3D model. This step will also take into account 3D point clouds from bundle adjustment and 3D point clouds from the laser scanner.  In this second phase of the project, we will emphasize robustness to perturbations through reflections, homogeneous surfaces and over-exposure.A central advantage of this two-stage strategy is that we will have a rudimentary self-localization and semi-dense 3D reconstruction of the scene computed onboard in a manner that does not depend on the communication with the ground station.The resulting semi-dense 3D reconstruction can for example be used for an adaptive viewpoint planning: During the flight, the system can immediately identify for which locations it has not obtained sufficient visual information yet.  This information can in turn be used to adapt the flight trajectory so as to assure an optimal exploration of unknown territory.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/200549338",
    "project_id": "200549338"
  },
  {
    "title": "3D+t Terabyte Image Analysis",
    "abstract": "The project will develop methods for processing time series of high resolution 3D images. The goal is to obtain very high performance both with respect to result quality and computational efficiency on modern hardware. The exemplary application domain is tracking of objects (e.g., cell nuclei, cytoplasm, nanoparticles) in microscopic images where different object classes are labeled with particular fluorescent dyes. These tracking problems are highly important in biological research and challenging because the known computational approaches can only scratch the surface of the wealth of information available in the huge datasets currently being acquired. We also view this as a case study how algorithm engineering for large datasets can help in a concrete, important application domain.Our strategy is to use high performance (e.g., graph based) algorithms for 3D image processing to extract objects annotated with uncertainty information. Since these results in great reduction of data volumes, tracking algorithms can then afford to take a global view integrating uncertainty information into a consistent overall result. Fuzzy logic will be used as an overarching framework for uncertainty estimation and propagation. Achieving this will require significant progress in uncertainty modelling and propagation, in generalizing methods from 2D to 3D images, and designing parallel algorithms in a context of highly pronounced memory hierarchies. Some of the sub-problems have never been systematically solved before. For example, a rather classical pipeline of image preprocessing, foreground detection, and image segmentation will produce a graph of possible objects in each time frame (e.g., cell nuclei) and edges connecting objects expressing possible movements or splits of the object. For grasping the development of the whole organism, we have to extract likely subtrees from this graph. So far, it is unknown how to even phrase this problem as a well-defined optimization problem, let alone how to solve it with provably high quality.We will demonstrate the performance of our methods using large real world inputs of developing zebrafish embryos generated by light-sheet microscopy. These datasets reach more than 10 Terabytes per embryo and will be two orders of magnitude larger than previously reported tools can handle. Large realistic, simulated inputs including ground truth will be used to quantitatively assess result quality.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/268484869",
    "project_id": "268484869"
  },
  {
    "title": "4D-YouTube: 4D Reconstruction from Casual Videos with Deep Space-Time Representations",
    "abstract": "While camera-based reconstruction has evolved dramatically, the reconstruction of dynamic worlds from casual videos such as those on platforms like YouTube remains a significant open challenge. In this project, we will tackle this challenge in three stages:  First, we will develop a framework for metric multi-view representation learning.  Second, we will develop uncalibrarted visual SLAM techniques for static worlds that generalize existing SLAM methods so as to handle cameras with unknown calibration.  And third, we will generalize these methods to the reconstruction of dynamic worlds where the 3D motion of objects in the world will be represented by means of ordinary differential equations.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/555335814",
    "project_id": "555335814"
  },
  {
    "title": "5D Adaptive Light Field Sampling (FiDALiS)",
    "abstract": "The dramatic increase in as well the spatial as the temporal resolution of current image sensors led to the desire to evolve the classical 2-dimensional (in case of motion pictures 3-dimensional) sampling raster, known and nearly unchanged since the time of the camera obscura. Light fields, which capture an excerpt of the plenoptic function, play a significant role in those developments. Such light fields are described by a 4-dimensional (in case of motion pictures 5-dimensional) sampling raster.The project aims at the ideal and dynamic adaptation of the 5-dimensional sampling raster to the content of the captured scene. All sensors resp. sensory systems have a limited data-rate (measured in rays / second) and hence the captured information content is highly dependent on the distribution of the rays over the 4 spatial plus the temporal coordinate. The project will fundamentally investigate and describe this adaptive 5-dimensional sampling. Restrictions founded in the physics of the underlying sensory system (typically rays can only be generated in groups and at discrete points in time) will be considered as constraints.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/429078454",
    "project_id": "429078454"
  },
  {
    "title": "A3: Scalability of Geometric Clustering Algorithms",
    "abstract": "Due to vast amounts of sea surface height data and very large geographical data sets, there is an increasing need for highly scalable clustering methods that deal with geometric data representations.Therefore, main objective of this project within the RU is to develop and analyze new algorithmic concepts to improve scalability of geometric clustering algorithms with provable guarantees.  In order to achieve this goal, we will develop new concepts of dimension reduction for geometrically represented objects such as polygonal curves and corresponding distance measures such as the Fr\\'echet distance. For center-based clustering methods with complex geometric centers such as subspace clustering, we will develop new sampling approaches to reduce the number of input points and for clustering of geometric objects we will develop new data reduction methods that combine simplification, dimension reduction and sampling methods  to improve scalability of algorithms.We will implement and engineer the most promising approaches and provide them as new tools to projects C1 and C2 to study problems in the context of map aggregation andsea level height analysis, representation and reconstruction.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/498596082",
    "project_id": "498596082"
  },
  {
    "title": "Aachen Dynamic Optimization Environment (ADE): Modeling and numerical methods for higher-order sensitivity analysis of differential-algebraic equation systems with optimization criteria",
    "abstract": "The objective of the ADE project is to develop modeling and novel numerical methods for differential-algebraic equations systems with optimality criteria (DAEO).  In the first funding period, the key methodology for the numerical simulation of DAEOs was the substitution of the embedded nonlinear program of the DAEO by its associated Karush-Kuhn-Tucker (KKT) necessary conditions of optimality. This approach transforms DAEOs into special nonsmooth differential-algebraic equation (DAE) systems. In particular, the task of AVT.SVT part was to adapt methods for simulation/sensitivity analysis of nonsmooth DAE systems for DAEOs, while the STCE part focused on the automatic generation of higher-order derivatives and McCormick relaxations of the model residuals. The latter form the basis for a potential second funding period covered by the follow-up application at hand.In the first funding period, numerical methods for the simulation and sensitivity analysis of DAEOs were developed. In the second period we aim to solve optimal control, parameter estimation or model-based experimental design problems. To solve the upper level NLP, we intent to use gradient-based numerical optimization algorithms such as sequential quadratic programming (SQP) or interior point methods. If required, the lower level embedded NLP shall be solved to global optimality, e. g. by means of Branch & Bound methods.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/281932795",
    "project_id": "281932795"
  },
  {
    "title": "Dependence and Independence, Quantitative Aspects and Counting Constructs in Logic and Games",
    "abstract": "The combination of mathematical logic, automata theory and the theoryof infinite games is the basis of a successful methodology for the synthesisand verification of reactive systems.The main goal of this research project is to extend this methodologyby some relevant components and to strengthen the connections between logics and games with regard to such applications.We focus on two main aspects for such extensions, and on theircombination. On the one hand, we want to develop and strengthenquantitative aspects in logics and the associated game-theoretical models,emphasizing in particular counting constructs of various forms. On the other hand, we investigate logical formalisms and game-theoretical methodsfor dependence and independence, based on the team semantics introduced by Hodges and the logicals systems, initiated by Väänänen, in which notions of dependence and independence are treated as atomic statements. The game models relevant for such logics are, on the one hand, games with imperfect information, and on the other hand, the second-order reachability games that we introduced in our work.Finally, we shall combine these two aspects and integrate quantitative operators and counting constructs in logics for dependence and independence, and into team semantics in general, as well as into the associated game models.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/270058382",
    "project_id": "270058382"
  },
  {
    "title": "Securing Neural Network Accelerators against Electrical-Level Attacks (SecureNN)",
    "abstract": "Artificial Neural Network (ANN) algorithms are increasingly used across various fields, ranging from analysis in the natural sciences to applications in mobile phones, over autonomous cars, to medical evaluations and marketing purposes. These algorithms benefit greatly from being accelerated through customized hardware, which increases processing speed and reduces total energy for higher efficiency. Thus far, the main research focus on ANN accelerator hardware has been to increase the computing efficiency, while security against malicious users or external attackers is not yet well explored, compared to traditional computer architectures. A few publications have already shown proof-of-concept that the hardware of ANN accelerators can be attacked. Among other attack vectors, they are vulnerable to side-channel and fault attacks on the electrical level. Fault attacks use active influence through power supply or power management logic, and side-channels use statistical methods on power measurements to extract information. In some multi-user systems, these attacks can be performed remotely through software, and in other cases measurement equipment found in electronic labs can be used. Traditional architectures and cryptosystems typically need to protect secret encryption keys, processed in small time frames and only a small amount of data to be protected. In contrast, neural networks are vulnerable within longer time windows and often process larger data sets where privacy is a concern. Furthermore, their various internal model parameters also need protection from reverse engineering, since they might contain company secrets. Under these circumstances, novel countermeasures have to be found.The goal of this proposal is to find appropriate countermeasures for side-channel and fault attacks on hardware neural network accelerators, to protect against known and unknown attack vectors. We aim to protect privacy and safety and thus trustworthiness in such accelerator devices, which is especially demanded in critical application scenarios. First of all, we will analyze existing attacks and extend them with new attack vectors. We will develop defenses against all of the attack vectors through circuit-level, system-level, and user-level techniques, applied during design time, deployment time, or runtime. When combining our resulting techniques as a whole, the chance of a successful attack will be diminished and the resilience of the whole system will be increased. In circuit-level and system-level techniques we will mainly apply knowledge from the hardware architecture side, while in user-level techniques we will additionally incorporate machine learning knowledge. Our results will be an important key aspect to allow secure deployment of neural network accelerator hardware in critical application domains.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/501300923",
    "project_id": "501300923"
  },
  {
    "title": "Securing Cyber-physical Systems with Organic Computing Techniques(CYPHOC)",
    "abstract": "Cyber-Physical Systems (CPS) connect two quite different worlds, the world of embedded systems (with real-time requirements, sensors and actuators, dependability, deterministic behavior, etc.) with the world of digital networks (with globally available services, data clouds, multi-modal man-machine interfaces, etc.). CPS are exposed to different security threats, many are not known at the design-time of a CPS. In general, the physical surrounding of the CPS may be endangered, but also the components of the CPS or the communication between spatially distributed components, for instance. In the CYPHOC project, we address these security problems by means of Organic Computing (OC) techniques. OC focuses on adaptive technical systems, typically empowered with learning abilities, to solve complex problems. Properties such as self-learning, self-adaptation, self-coordination, self-organization, or self-healing play an important role. In CYPHOC, \"security-by-design\" is complemented by \"security-at-runtime\", that is, the components of a CPS are enabled to detect new kinds of security threats collectively and to react accordingly. In particular, solving this involves three important research topics that are addressed in the CYPHOC project (Securing Cyber-physical Systems with Organic Computing Techniques): collaborative detection and modeling of threatening situations based on effective and efficient communication mechanisms (group of Prof. Sick), mechanisms to detect dependencies between components of the CPS and to react appropriately in such situations (group of Prof. Hähner), and guaranteed protection against compromised components of the CPS including protection of the above mechanisms (group of Prof. Wacker). The project includes three case studies to demonstrate the applicability of the proposed techniques (distributed intrusion detection, smart camera network, and an industry 4.0 scenario).",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/253136448",
    "project_id": "253136448"
  },
  {
    "title": "AbstractMine: Privacy-aware Abstraction of Event Data for Distributed Process Mining",
    "abstract": "Process mining enables the analysis of process-oriented systems based on events recorded during their execution. However, existing techniques typically assume that an event denotes the execution of a single activity as part of a single case; and that all events are available as part of a log at a single location. Once process mining is adopted for events sourced from sensor networks, however, these assumptions are no longer valid. Events capture low-level information and first need to be abstracted to facilitate their interpretation in terms of the process to analyze. Also, events stem from distributed sources, which calls for explicit handling of data exchange between the involved entities. However, event abstraction and data exchange also open opportunities to address the emerging need for privacy-awareness in process mining. Controlling the level and location of event abstraction, guarantees on the privacy of involved process participants may be achieved, without imposing any assumption on the analysis to be conducted. In AbstractMine, we aim at providing the algorithmic foundations to incorporate privacy guarantees in the abstraction of events that are continuously generated by distributed sources. This includes a formalism to describe the distributed abstraction of events and link it to attacks on the privacy of process participants as well as the utility of the resulting data for operational analysis. Based thereon, we contribute algorithms for abstraction of events that give privacy guarantees, while maximizing the data utility. We consider these algorithms for centralized and distributed settings, as well as for static and streaming data. The collaborations within SOURCED enable us to link event abstractions to approaches for uncertainty management and explainability in process mining, as well as achieving scalability in particular in distributed application scenarios.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/521549021",
    "project_id": "521549021"
  },
  {
    "title": "Abstract Cognitive Models",
    "abstract": "The project will provide the foundation for the formal, semantics-based analysis of models in Cognitive Science. Specifically we are interested in automated methods based on model checking and SMT solving for the analysis of psychological theories and of hybrid cognitive models. A psychological theory can be viewed as the informal description of a high-level model for human behaviour in problem solving tasks. A hybrid cognitive model can be viewed as a low-level implementation of a psychological theory. In Cognitive Science, one uses the simulation of a hybrid cognitive model (in, say, ACT-R) in order to validate a psychological theory against empirical data from behavioural experiments. The analysis approach envisioned by the project can possibly enhance or complement the existing, simulation-based approach. We will develop the notion of an abstract cognitive model which allows us to describe a psycho- logical theory by a formal model (a model on which we can apply formal, semantics-based analysis methods). We will investigate an approach for the analysis of abstract cognitive models (an analysis based on hybrid system model checking and SMT solving). The analysis can be used for a first check of a psychological theory before the implementation and the simulation of hybrid cognitive models. We will also investigate how the approach, by the synthesis of numerical parameters in an ab- stract cognitive model, can automatically synthesise a `correct-by-construction' hybrid cognitive model for a given psychological theory.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/316490981",
    "project_id": "316490981"
  },
  {
    "title": "Abstract Techniques for Programming Languages and Secure Compilation",
    "abstract": "Reasoning about imperative and higher-order programming languages in the context of security and verification is known to be a notoriously difficult task, which can be facilitated by factoring through such abstract general properties as compositionality, adequacy and full abstraction. However, these properties are also very hard to establish in practice and they moreover tend to be fragile and sensitive to various factors including syntax, language features, and notions of observable behaviour and program equivalence. In ATLaS, we will build on the recently emerged notion of higher-order abstract GSOS to develop an integrated framework for the semantics of higher-order and imperative languages with applications to the verification of secure compilers. Higher-order abstract GSOS is a recent pivotal generalization of the well-established first-order counterpart of Turi and Plotkin. Much like the latter, higher-order abstract GSOS is compositional w.r.t. strong variants of Abramsky's applicative bisimilarity, yet it is considerably more sophisticated than the first-order notion -- unleashing its full power is thus one of our goals in ATLaS. More specifically, we first aim to reconcile the call-by-value evaluation strategy with higher-order abstract GSOS as well as define a unifying metalanguage based on Levy's subsuming paradigm of call-by-push-value. We will subsequently investigate weaker notions of equivalence in higher-order abstract GSOS, prominently Abramsky's weak applicative bisimilarity. To that end, we are planing to develop a categorical generalization of Howe's method. A further goal will be to extend higher-order abstract GSOS for typed languages and languages with computational effects such as probability, non-determinism and store. As an important and complex example, we will specifically address presheaf models of dynamic memory allocation, which should particularly benefit from the abstract, axiomatic nature of our approach. In ATLaS we put special emphasis on formalizing our results in the proof assistant Agda; this will provide reusability and a formal guarantee of correctness as well as compliance with the foundational principles of type theory. The main intended application domain for our developments is the emerging field of secure compilation, which deals with requirements and techniques to detect and prevent the introduction of security vulnerabilities during the compilation process, such as buffer overflows, memory leaks, or other common security flaws. We intend to address these issues by modelling the security properties of languages within abstract GSOS and associating abstraction-preserving compilers, i.e. secure compilers, with the formal notion of a morphism across abstract GSOS specifications.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/527481841",
    "project_id": "527481841"
  },
  {
    "title": "Skeleton-based Clustering in Big and Streaming Social Networks",
    "abstract": "We devise novel methods to cluster large-scale static and dynamic online social networks. Our approach is based on skeleton structures that represent and amplify variation in local cohesion, and that are defined locally to facilitate efficient computation. In addition to simplifying the clustering problem, they shall also provide a novel understanding of community dynamics, capturing more directly the agency of social actors.Finding patterns in online social relationships and interactions is one of the most prominent applications of big data today, largely driven by the relative ease of data collection and its economic and political value. While this process-generated data is massive, it stems from the actions of individuals with bounded knowledge of the entire system. Our working hypothesis is therefore that local structures capture major trends to an extent sufficient to inform algorithms for partitioning or overlapping clusters. Moreover, we expect the integration of individual attribute data to boost empirical relevance, and the definition of persistent skeleton structures to yield more reliable concepts of community dynamics.Combining sparsification with imputation and nodal attributes, we will advance recent approaches to locally-determined skeleton structures and study their utility for novel and approximate graph clustering algorithms that scale to big data. We are aiming at algorithms with near-linear worst-case running times by exploiting special characteristics of social networks or settling for approximate results. While overall algorithmic efficiency is important, we will place additional emphasis on algorithm engineering to increase and exploit locality. Consideration of streaming data will be a necessary requirement as online social networks typically generate sequences of dyadic events. In order to cope with massive graphs we also develop external memory algorithms for graph clustering and related problems. In support of the validation and experimental evaluation of algorithms we place particular emphasis on generative models for social networks. Due to the pervasive nature of clustering problems, the expected outcome of this project includes tools for big data analysis in other application areas.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/254952906",
    "project_id": "254952906"
  },
  {
    "title": "Wide Synthetic Aperture Sampling for Motion Classification",
    "abstract": "With Airborne Optical Sectioning (AOS) we have introduced a wide synthetic aperture imaging technique that employs drones to sample images within large areas from above forests. These images are computationally combined to integral images which suppress strong occlusion and make visible hidden targets. The main advantages of AOS over alternatives, such as LiDAR or Synthetic Aperture Radar, are its real-time performance; its applicability to other wavelengths, such as far infrared for wildlife observations or search and rescue, or near infrared for agriculture and forestry applications; and its high spatial resolution. AOS and its successful applications to fully autonomous search and rescue drones is the overall result of two subsequent FWF projects: In Directional Super-resolution through Coded Sampling and Guided Up-Sampling we have investigated directional super-resolution techniques for sparse sampling devices (camera array and light-stages) that do not require scene depth, disparity estimation, or exact image correspondences. In Wide Synthetic Aperture Sampling we then extended these scientific findings to AOS with the goal to maximize spatial and directional resolut ions as well as de-focusing efficiency while minimizing depth of field and flying time for wide synthetic aperture sampling. Objectives: The sequential sampling nature of AOS, however, currently limits applications to static targets. Moving targets, such as walking people or running animals lead to motion blur in integral images that are nearly impossible to classify. Yet, the detection and interpretation of motion is essential for tracking and counting animals or people, and for finding hiding or lost people which walk, run, or move. The goal of this follow-up project is to investigate wide synthetic aperture sampling principles for motion detection and interpretation. In short, we are seeking novel solutions for enabling AOS to deal with moving targets, and to consequently open new application fields. This, however, requires gaining entirely new insights to wide synthetic aperture sampling strategies in theory and in practice. Approach: We want to investigate sequential sampling strategies together with adapted deblurring and anomaly detection techniques, novel parallel sampling strategies with first aerial camera arrays, dynamically reconfigurable drone swarms, as well as efficient combinations of sequential and parallel sampling to reduce complexity and to avoid undersampling. Motion itself could be an important feature for target classification. Innovation: New AOS sampling approaches for identifying moving targets will enable entirely new applications for areas such as wild-life observation, search and rescue, border control, surveillance, and others.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/502167710",
    "project_id": "502167710"
  },
  {
    "title": "Aby gets digital: ARAby -An adaptive Retrieval- and Analysistool for the support of image-oriented scientific research",
    "abstract": "The project Aby gets digital: ARAby. An adaptive Retrieval- and Analysistool for the support of image-oriented scientific research describes the proposal of the development of an Software-Tool for the digitized research process in the humanities. It aims to improve the efficiency of Image-Retrieval in databases to enhance the analysis of image data within scientific work in order to facilitate new theory formation. The tool tends to increase the performance of national and international scientific information systems. The original idea is based on Aby Warburgs method of comparing and analyzing pictures out of different contexts simultaneously together. For his so called Mnemoyne Bilderatlas he arranged pictures on wooden panels covered with canvas in an ephemeral way and constantly re-arranged an edited his selection. The resulting compositions of images were as well a working method as a publication of results and they allowed innovative new research questions. The e-Research-Tool ARAby intends to carry Warburgs procedure forward to the digital age and even to expand it with current information technology. The analysis of digital images based on the criterion of similarity should be undertaken by ARAby in an automated way, complemented by additional functions. Essential for the implementation of ARAby are the three functionalities pattern recognition, clustering and (user)adaption. One fundamental function is the pattern recognition of pre-defined concepts and the annotation of the resulting information within the metadata of the images. Search queries can be made by keywords (text) as well as content based (Image). The results of queries processed by ARAby are then displayed in a particular form of ranking, in which the user analysis feature is integrated. As an e-Research-Tool, ARAby should enable scientist in the humanities to search huge (image) databases by using their common browser on the web. Standardized interface functions are taken into consideration to obtain transferability to other databases. ARAby should enable easier image retrieval for scientist by using comprehensible, meaningful and transparent ways of displaying the results.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/389247364",
    "project_id": "389247364"
  },
  {
    "title": "ACCROSS: Approximate Computing aCROs the System Stack",
    "abstract": "Computing systems have reached a point where significant improvements in computational performance and efficiency have become very hard to achieve. The main reason are power (density) and efficiency limitations due to the discontinuation of Dennard Scaling. as well as increased reliability concerns.Approximate Computing trades off precision against power, energy, storage, bandwidth or performance, and can be applied to hardware, software and algorithms. It promises to re-gain efficient computing by providing additional, adjustable design and runtime parameters to find pareto-optimal solutions. However, its application domain is still rather limited and a significant extension of the scope of applications is required, including applications that are not necessarily inherently error-tolerant.The ACCROSS project targets to tackle this challenge with a cross-layer approach to analysis and optimization, which considers the several layers (though not all) of the system stack from the application down to the hardware. At the higher levels, ACCROSS covers the analysis of applications from different computational problem classes, which are suited to act as enablers for mainstream approximate computing. This includes the development of new methods for the analysis of approximation potentials in applications, the adaptation of existing applications to approximation and the quantification and exploitation of efficiency gains. Moreover, new methods for combining suitable approximation techniques at various system layers will be provided to maximize efficiency during runtime with respect to performance and energy. Furthermore, new error metrics and methods for lightweight runtime monitoring of accuracy will be developed to ensure the amenability of approximate computing of the targeted applications. At the lower abstraction levels, ACCROSS covers the systematic evaluation of the impact of narrowing design margins which will lead to approximate behavior and increased efficiency. New models linking hardware and software will be provided, enabling designers to accurately quantify the error and efficiency tradeoff and its impact of approximation computing across the system stack.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/428566201",
    "project_id": "428566201"
  },
  {
    "title": "Accurate and efficient non-projective dependency parsing",
    "abstract": "The goal of the proposed research project is to develop accurate and efficient methods for non-projective, data-driven dependency parsing. The purpose of parsing is the automatic analysis of the syntactic structure of natural language. Data-driven dependency parsing is distinguished from other approaches in that it employs syntactic representations based on word-to-word dependencies, and makes essential use of empirical data. Most of the previous work on dependency parsing has been confined to dependency analyses that satisfy a structural constraint called projectivity. While this facilitates efficient computations, it does so at the cost of accuracy, as it rules out many analyses that occur in the data. Recent work has tried to identify classes of dependency structures that strike a better balance between accuracy and efficiency. In this project, I will develop and evaluate a data-driven parsing framework for such ‘mildly’ non-projective dependency structures. The project is the first comprehensive investigation of parsing methods based on these structures.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/72394720",
    "project_id": "72394720"
  },
  {
    "title": "ACHIEVE: A Common Evaluation Method for Simultaneous Privacy Protection and Collision Detection Performance of CooperativeCollision Avoidance Architectures for Vulnerable Road Users",
    "abstract": "In 2019, 862 Vulnerable Road Users (VRUs), including pedestrians and bicyclists, died and 116,000 were injured due to road traffic accidents in Germany. To reduce these numbers in the future, the deployment of cooperative collision avoidance systems, in which both VRU and car driver are equipped with a device that can warn them about upcoming collisions, appears to be a promising solution. For the realization of such a cooperative protection system, many different architectures are possible. For example, they range from Peer-to-Peer (P2P) architectures with Device-to-Device (D2D) communication and local processing to architectures based on hybrid communication (cellular and D2D), with processing distributed over the car, VRU, and server. These different architectures not only influence the collision detection performance, but also cause different threats to users’ privacy. This results from the collection, processing, and exchange of information about these users across the architecture. Protecting users’ privacy is not only mandatory from a legal perspective, but we expect that it will also contribute to the acceptance of this technology by future users. While different architecture designs have been proposed and evaluated in isolation, the state of the art does, however, not allow to determine which architecture(s) offer(s) both the best collision detection performance and privacy protection, i.e. no method to compare the different architectures with respect to collision performance and/or privacy protection is available yet. This leads to the main research question of our project: How can we evaluate and compare the performance of the possible architectures for a cooperative collision avoidance system in terms of both collision detection and privacy protection? In ACHIEVE, we will therefore develop a new method to assess and compare different architectures based on these two key aspects. To reach this goal, we will first build the basis of this proposal by identifying the multiple architecture variants and conducting a thorough privacy threat analysis of these architectures. We will further analyze the impact of the introduction of privacy-preserving solutions on the collision detection performance. We will next focus on the definition and analysis of key performance indicators that will reflect both the collision detection performances and privacy protection and will be integrated in our common method. In addition, to provide this new method, we will apply it to the architectures of interest and conduct a comprehensive evaluation of their performance. By leveraging our method and the results of our evaluation, it will be possible to compare the possible architecture variants and hence take informed decisions based on their performance in terms of both collision detection and privacy protection.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/516946933",
    "project_id": "516946933"
  },
  {
    "title": "ACoF - Approximate Computing on FPGAs",
    "abstract": "Approximate Computing systematically exploits the trade-off between accuracy, power/energy consumption, performance, and cost of many applications of daily life, e.g., computer vision, machine learning, multimedia, big data analysis and gaming.  Computing results approximately is a viable approach here thanks to inherent human perceptual limitations, redundancy, or noise in input data.In this project, we want to investigate novel techniques for the design and optimization of approximate logic circuits for FPGA (field-programmable gate array) targets.  These devices are known to perfectly combine high performance of hardware designs with the re-programmability of software and are used in many products of daily life and even cloud servers.   The goal of our research is a) to investigate novel techniques for function approximation exploiting FPGA artifacts, i.e., DPS blocks and BRAM, b) to study new error metrics and a calculus for error propagation in networks of approximate arithmetic modules, c) to develop novel FPGA-specific optimization techniques for design space exploration and synthesis of approximate multi-output Boolean functions, and d) study how to integrate error modeling and analysis techniques into existing high-level programming languages and subsequent synthesis of approximate Verilog or VHDL designs.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/450987171",
    "project_id": "450987171"
  },
  {
    "title": "Acquisition of Large 3D Scenes - Dealing with Complexity and Incompleteness",
    "abstract": "In this renewal application for a research grant, we propose to continue our project that aims at a photo-realistic representation (modelling, editing, rendering) of real-world scenes acquired by 3d-scanning devices to achieve the goal of doing the pioneering work on the way to virtual 3d photography and 3d video. In the first period of the grant we developed novel data structures to handle the large amount of data in real-world scans. We implemented a comprehensive software framework (XGRT) that we share with our project partners. With this framework we developed algorithms to process large datasets automatically and reconstruct surfaces in the best way in a statistical sense. We also had successes and a publication that established a new research direction in the field of animation reconstruction, where we will continue our work. We showed how redundancies in real-world scans can be found, and we will investigate in our future work how this can be utilized for reconstruction.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/17957768",
    "project_id": "17957768"
  },
  {
    "title": "ADA-FS - Advanced Data Placement via Ad-hoc File Systems at Extreme Scales",
    "abstract": "The proposed ADA-FS project aims at improving the I/O performance for extreme-scale parallel applications. It will introduce three novel components to the system software. First, it proposes the use of an ad-hoc overlay file system concept. Second, a central I/O planner component is envisioned. The third component integrates a concept for application monitoring, with emphasis on its resource usage and I/O behavior. The ad-hoc overlay file system will be deployed as a separate instance for every parallel application on the same compute nodes that the application is running on. This file system will use traditional and novel system components such as RAM, local SSDs, or NVRAM as data caches for the I/O subsystem provided that these are not in use by the particular application. This approach will increase the effective I/O bandwidth and reduce the latency of I/O operations. Parallel applications will require no modifications to make use of this ad-hoc file system. The central I/O planner will coordinate all data transfers to and from all instances of the overlay file system. The planner will prevent a random mix of I/O requests in which no application can anticipate how much of the total I/O bandwidth is available at any given point in time in the globally shared I/O infrastructure. Instead, the central I/O planning will allow appropriate predictions about transfer times to and from the ad-hoc overlay file systems. As long as an application reads and writes only within its private ad-hoc overlay file system, it will use dedicated I/O resources in an exclusive manner. In addition, information about an application I/O behavior will be extracted. Such information is useful for planning the staging-in and staging-out of data as well as to optimize the data distribution within the ad-hoc overlay file system. This information will be provided by integrated monitoring components at the application level. The performance advantage by the proposed solution increases with the parallelism, provided that the combined bandwidths of local storage caches will always surpass the total bandwidth of central storage systems. The solutions proposed by ADA-FS will incorporate novel node-local storage locations forecasted for upcoming HPC installations.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/279334509",
    "project_id": "279334509"
  },
  {
    "title": "ADAMANT: Adaptive Data Management in Evolving Heterogeneous Hardware/Software Systems",
    "abstract": "Heterogeneous system architectures consisting of CPUs, GPUs and FPGAs offer a variety of optimization possibilities for database systems compared to pure CPU-based systems. However, it has been shown that it is not sufficient to just map existing software concepts one-to-one to non von-Neumann hardware architectures such as FPGAs to fully exploit their optimization potential. Rather, new processing capabilities require the design of novel processing concepts, which have to be considered at the planning level of query processing. A basic processing concept has already been developed in the first project phase by considering device-specific features in our plug’n’play system architecture. In fact, more advanced concepts are required to achieve an optimal exploitation of the capabilities of the hardware architectures. While significant speed-ups were achieved on the level of individual operators mapped to GPUs and FPGAs, the performance gain at the level of complete queries was unsatisfying. Hence, we derived the hypothesis for the second project phase that standard query-mapping approaches with their consideration of queries on the level of individual operators is not sufficient to explore the extended processing features of heterogeneous system architectures.We will address this shortcoming by researching new processing and query mapping methods for heterogeneous systems, which question the commonly used granularity level of operators. Therefore, we will provide processing entities that encapsulate a greater functionality than standard database operators and may span multiple hardware devices. Thus, processing entities are intrinsically heterogeneous and combine the specific features of individual devices.  As a result, our heterogeneous system architecture enables database operations and features that are not available or cannot be implemented efficiently in classical database systems. To explore this extended feature set, we have identified three application domains that are still challenging for classical database systems and for which we assume that they will benefit greatly from heterogeneous system architectures: High-volume data feeds, approximate query processing and dynamic multi-query processing. The stream-based nature of high-volume data feeds asks for a hardware architecture where processing can be done on the fly without the need to store data beforehand. Hence, FPGAs are a promising hardware platform for processing high-volume data feed applications. Furthermore, FPGAs as well as GPUs are good platforms for approximate query processing, as they allow for approximate arithmetics and hardware-influenced sampling techniques. Dynamic multi-query processing is very challenging from the system management point of view, as query plans that have performed well for one workload can be inefficient for a different workload. Here, the multi-level parallelism of heterogeneous systems offers better opportunities to handle heavy workloads.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/361499466",
    "project_id": "361499466"
  },
  {
    "title": "Adaptive Algorithms for Graph Views and View Transitions\r\n\r\n\r\n          (B06*)",
    "abstract": "This project aims at visualizing complex graph data in an adaptive manner, guided by quality aspects and user input. The new focus is on consistent view ensemble creation for high-dimensional input data, as e.g. derived from evolving neural networks. Our main idea is to use, extend, and (for the first time) combine the notions of regret (which is an established measure for subset quality based on user preference models) and dimensionality reduction to design scalable graph drawing and view selection algorithms that come with quality guarantees.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/426054675",
    "project_id": "426054675"
  },
  {
    "title": "Adaptive Algorithms for Motion Estimation\r\n\r\n\r\n          (B04)",
    "abstract": "We aim at the development of accurate, robust, and stable algorithms for motion estimation. To this end, neural networks shall be developed for estimating the 3D motion from stereo sequences (scene flow) by adaptively integrating all available information. In this context, also the stability of such networks shall be investigated along with the integration of 3D information into 2D motion estimation (optical flow). The creation of a flexible novel open-source data set shall support the development of the algorithms. Finally, the developed methods shall be adapted such that they can be used for a variety of applications in the context of visualization, human-machine interaction, and cognitive sciences.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/276833589",
    "project_id": "276833589"
  },
  {
    "title": "Adaptive Query Compilation for Stream Processing",
    "abstract": "Over the last decades, the requirements of data processing workloads significantly changed. Nowadays, real-time analytics requires the execution of long-running queries over unbounded, continuously changing, high-velocity data streams. Common SPEs such as Flink and Storm scale-out execution to achieve high throughput and low-latency. However, recent research revealed that these SPEs cannot fully utilize available hardware resources. First, they do not take the particular hardware resources into account for optimization. Second, they do not take changing data characteristics intro account, which hinders a variety of adaptive optimizations. Third, they rely heavily on user-defined functions, which introduce a high processing overhead due to data serialization and transformation. In this project, we want to face these challenges to enable efficient processing of complex stream processing pipelines on modern hardware. To this end, we propose a novel adaptive query compiler for stream processing techniques to optimize code with regards to the hardware resources and changing data characteristics. Furthermore, we study possibilities to embed complex user-defined functions into compiled pipelines efficiently to support a wide range of advanced analytical data processing workloads.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/447268056",
    "project_id": "447268056"
  },
  {
    "title": "Adaptive Application-Specific Invasive Micro-Architectures\r\n\r\n\r\n          (B01)",
    "abstract": "The i-Core is a processor with a run-time adaptive micro architecture (uArch, e.g. dynamic L1 cache configuration) and a run-time reconfigurable fabric for appl.-specific Special Instr. (SIs). In the first two phases, we investigated invading its reconfigurable fabric and uArch, generating SIs automatically on-the-fly, extending it to a reconfigurable multi-core processor, reallocating the intra-tile cache dynamically, and developing a WCET analysis. The Phase III focus is on run-time requirement enforcement (enforcing WCETs and security requirements), and optimisations (e.g. by using approximated accelerators and control flow within SIs).",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/179125668",
    "project_id": "179125668"
  },
  {
    "title": "Adaptive explanation generation\r\n\r\n\r\n          (A01)",
    "abstract": "Project DetailsBackProjektAdaptive explanation generation\r\n\r\n\r\n          (A01)Subject AreaImage and Language Processing,  Computer Graphics and Visualisation, Human Computer Interaction, Ubiquitous and Wearable ComputingApplied Linguistics,  Computational LinguisticsDevelopmental and Educational PsychologyTermsince 2021Project identifierDeutsche Forschungsgemeinschaft (DFG) - Project number 438445824Project DescriptionNo abstract availableDFG ProgrammeCRC/TransregiosSubproject ofTRR 318: \nConstructing explainabilityApplicant InstitutionUniversität PaderbornProject HeadsProfessorin Dr. Heike M.  Buhl;Professor Dr.-Ing. Stefan  Kopp;Professorin Dr. Katharina  Rohlfing",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/466785907",
    "project_id": "466785907"
  },
  {
    "title": "Adaptive Grid Implementation for Parallel Continuum Mechanics Methods in Particle Simulations\r\n\r\n\r\n          (D08*)",
    "abstract": "Dynamically adaptive computational grids allow for the simulation of significantly larger domains in space and time. Tree-structured grids are particularly memory-efficient and easy to parallelize. The challenge is adopt such grids in a minimally invasive way for existing simulation software without loosing too much of their inherent efficiency. D.8 develops and implements such an integration concept for examples within the SFB. This requires new developments in terms of modelling, discretization, data structures and data access, parallelization, and visualization.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/265685105",
    "project_id": "265685105"
  },
  {
    "title": "Adaptive Hybrid Secondary Storage Systems for Cloud Computing Scenarios",
    "abstract": "The project aims at improving the performance of secondary storage systems in cloud computing scenarios.  This is achieved by using a holistic system architecture in combination with dynamically adapting the data placement and organization in order to better exploit the heterogeneous characteristics of different kinds of storage devices.  The placement is continuously adjusted according to current access patterns and the specific technological characteristics of the storage devices, which differ in performance, capacity, and price.  Additionally, the optimization also takes the requirements of the cloud applications and of the platform operator into account.  By using a holistic system architecture, which is located on the file system layer and which integrates the functionality of the usual storage stack, available information can be exploited more directly, more flexible data organizations can be used, and more fine-grained adaptations can be executed.  The developed solutions are validated by extensive simulations and evaluated in a realistic testbed running on an HPC cluster.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/259252678",
    "project_id": "259252678"
  },
  {
    "title": "Adaptive Learning with Erroneous Examples",
    "abstract": "Correct worked examples have traditionally been used to help students learn mathematics and science problem solving and have proven to be quite beneficial, as demonstrated in many learning science studies. However, erroneous examples have rarely been investigated or used as a learning intervention, either within a technology-enhanced learning (TEL) system or within the classroom. Here, erroneous examples are solutions including one or more errors that the student is asked to detect and to correct. Our hypothesis is that erroneous examples will give students the opportunity to find and reflect upon errors in a way that will lead to deeper, more robust learning, while at the same time not causing students to feel ashamed or demotivated, as is more likely when their own errors are exposed. Our goal in project ALoE is to help students learn mathematics by presenting erroneous examples together with correct examples and exercises in adaptive fashion within the TEL system ACTIVEMATH, a web-based learning environment for mathematics that has proven to be highly successful. We hope to improve students  cognitive competencies in math learning, as well as their meta-cognitive competencies in error discovery and self-monitoring. If students require help in detecting and correcting errors, ACTIVEMATH will provide it. ALoE will not only test the benefits of erroneous examples but will also employ - for the first time - the potential of technology-enhanced learning to make the examples beneficial for more students through tailored problem selection, help, and interaction. We will try to understand better when and how learners benefit from the study of erroneous examples through empirical studies and will use that knowledge to extend ACTIVEMATH to present erroneous examples adapted to the learner s needs. In other words, ACTIVEMATH will adapt the frequency and sequence of its presentation of erroneous examples to learners, the amount and kind of help it provides, and the type of the interactions students will be asked to perform. The domain we will focus on is fractions, a subarea of basic mathematics with a long and well-documented history of difficulty for students. ALoE will make a contribution to cognitive and learning science by further examining the value of and specific use of erroneous examples for learning. Work in this nascent area of cognitive research has not shown conclusively, first, that erroneous examples can be used to support human learning and, second, how and when such examples should be presented to students to enhance learning. Moreover, ALoE will make a contribution to artificial intelligence and educational technology by developing novel and dynamic adaptation within ACTIVEMATH, by extending its student modeling to capture meta-cognitive aspects, and by inventing a semantic knowledge representation that contains enough information for the updating of the student model and that enables different ways of presenting the erroneous examples. The project will extend ACTIVEMATH with a student model that includes the variables related to the effect of erroneous examples, with specific help for the detection of errors, with adaptive interaction choice, and with mechanisms for learner-dependent selection of appropriate erroneous examples in concert with examples and exercises.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/81713970",
    "project_id": "81713970"
  },
  {
    "title": "Adaptive Network Visualization\r\n\r\n\r\n          (B02)",
    "abstract": "We plan to extend stress-minimization approaches for general graph layout. Current algorithms fail on specific classes of input graphs, for instance because of scale, diameter, or skewed degree distributions. Moreover, characteristics of the output device and user interactions are generally ignored. Adaptive algorithms shall be developed from quantitative descriptions of the effects of graph characteristics on layout features. Since extensive algorithmic experimentation will be required to understand empirically the response curves of such algorithms, we will also contribute to methodology in experimental algorithmics.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/276833318",
    "project_id": "276833318"
  },
  {
    "title": "Adaptive Planning and Decision-Making\r\n\r\n\r\n          (A01)",
    "abstract": "Subproject A1 is concerned with research issues around the automated generation and explanation of plans of action. In the requested funding period, the user's perspective on these issues will be explored and integrated into a companion-system's planning components. To this end, we will investigate how a human's planning strategies are affected by his or her understanding of the situation while solving knowledge-rich problems in co-operation with a companion-system. As a result, a psychological model of the understanding of dynamic situations will accordingly be extended. It serves to guide the further development of the user-centered mixed-initiative planning approach as well as the development of new techniques for plan explanation and recognition in view of strategy changes and multiple user goals.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/110611675",
    "project_id": "110611675"
  },
  {
    "title": "Adaptive Self-Consistent Visualization\r\n\r\n\r\n          (B01)",
    "abstract": "Our goal is the adaptation of interactive visualization to make it consistent with the input data and provide information in a reliable and trustworthy way. This will be achieved by employing quantitative models that describe the visualization process, perception, and user interaction to identify, mark, and compensate for differences between data and interpretation by humans. In particular, we plan to develop metrics for emergent visual artifacts, integrate them with adaptive layout methods that reduce such artifacts, and extend our techniques from 2D visualization to 3D in order to support mixed reality applications.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/276833246",
    "project_id": "276833246"
  },
  {
    "title": "Adaptive Walking through Multi-Contact Stabilization and Usage of Partial Contacts for Humanoid Robots",
    "abstract": "Within the last decades the social impact of robots increased steadily. While the manufacturing industry uses extremely specialized and highly efficient systems, different fields of application are targeted by humanoids, i.e. robots designed by mimicking the human anthropology. Potential future applications are rescue operations in disaster areas, home health care scenarios and the entertainment industry. Although humanoid robots often appear quite capable in literature and media, today even the most sophisticated systems can not keep up with the skills of a human being. This also holds for locomotion in unstructured environments outside of the laboratory, e.g. in disaster areas or in the middle of a crowd of humans. The flexibility, i.e. the ability to adapt its behavior to previously unknown and changing environments, proves to be a difficult task. This project aims to improve the locomotion of humanoid robots within such environments. For this purpose especially active arm usage for stabilization, e.g. supporting against walls, and partial foot/arm contact, e.g. while climbing stairs with narrow steps, is in the main focus. The overall problem splits into the areas perception and environment modeling, navigation and motion planning, as well as stabilization control. These areas are divided into subproblems, which are investigated cooperatively by the Chair of Applied Mechanics and the Chair for Computer Aided Medical Procedures & Augmented Reality of the Technical University of Munich. The tight cooperation allows to combine the expertise of both groups in order to achieve a common goal, namely improve locomotion capabilities of humanoid robots. Considering the practical application as a long term goal, special focus lies on efficient, real-time algorithms.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/407378162",
    "project_id": "407378162"
  },
  {
    "title": "Auto-Adaptive Learning from Weak Feedback for Interactive Lecture Translation",
    "abstract": "The goal of the proposed project is to enable the use statistical machine translation (SMT) for the difficult task of translation of university lectures. This is done by enhancing SMT by a mutually beneficial learning cycle, called auto-adaptive SMT, that incorporates the human for post-editing SMT output from which the system can learn immediately. In the ``traditional'' setup, post-editors are instructed to produce a perfect translation, which can be very resource-intensive, not only in terms of editing time but also in terms of a user's required language proficiency. In this project, it is our main goal to explore ways of learning from weaker feedback than a full post-edit. This feedback could consist of partial corrections or merely judgments on the quality of the SMT output. A central point is that in order to guarantee machine learnability, human feedback needs to contain a signal strong enough for statistical learning. This means that we are faced with a trade-off between machine learnability and elicitability of feedback from human users, which we will attempt to solve.  Our research will focus on the design of efficient algorithms that perform learning from weak feedback, and on frontend/backend interfaces that support a practical use of the algorithms in field tests of interactive translation of university lectures.",
    "dfg_label": "4.43",
    "fachkollegium": "43",
    "source_url": "https://gepris.dfg.de/gepris/projekt/326904228",
    "project_id": "326904228"
  },
  {
    "title": "learning-based control for marine systems in transportation",
    "abstract": "This project investigates learning-based control for marine systems in transportation. The proposed approach combines deep reinforcement learning with neural network control to achieve improved accuracy. The research addresses key challenges in PID controller, automation and robust control. We employ particle swarm optimization combined with sliding mode control to tackle uncertainty and disturbances. The proposed system demonstrates significant improvements in precision and accuracy compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0091",
    "source_url": "synthetic://project/project_0091"
  },
  {
    "title": "Development of novel hybrid control strategies techniques for smart grids",
    "abstract": "We develop novel hybrid control strategies techniques for smart grids. Our research focuses on resource constraints while ensuring adaptability. The research addresses key challenges in PID controller, adaptive control and robust control. We employ genetic algorithms combined with adaptive filtering to tackle resource constraints. The proposed system demonstrates significant improvements in precision and performance compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0092",
    "source_url": "synthetic://project/project_0092"
  },
  {
    "title": "nonlinear control for smart grids in transportation",
    "abstract": "This project investigates nonlinear control for smart grids in transportation. The proposed approach combines fault detection with sliding mode control to achieve improved efficiency. The research addresses key challenges in feedback control, control systems and automation. We employ Bayesian optimization combined with predictive maintenance to tackle adaptability. The proposed system demonstrates significant improvements in response time and energy consumption compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0093",
    "source_url": "synthetic://project/project_0093"
  },
  {
    "title": "adaptive algorithms for manufacturing systems in manufacturing",
    "abstract": "This project investigates adaptive algorithms for manufacturing systems in manufacturing. The proposed approach combines Kalman filtering with fault detection to achieve improved accuracy. The research addresses key challenges in optimal control, system identification and adaptive control. We employ Bayesian optimization combined with particle swarm optimization to tackle human-machine interaction. The proposed system demonstrates significant improvements in throughput and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0094",
    "source_url": "synthetic://project/project_0094"
  },
  {
    "title": "presents a comprehensive study of networked control applied to assistive robo...",
    "abstract": "This work presents a comprehensive study of networked control applied to assistive robotics. We address human-machine interaction through innovative state estimation strategies. The research addresses key challenges in robust control, control systems and model predictive control. We employ sliding mode control combined with sliding mode control to tackle human-machine interaction. The proposed system demonstrates significant improvements in precision and safety compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0095",
    "source_url": "synthetic://project/project_0095"
  },
  {
    "title": "Development of novel networked control techniques for medical devices",
    "abstract": "We develop novel networked control techniques for medical devices. Our research focuses on adaptability while ensuring reliability. The research addresses key challenges in system identification, automation and model predictive control. We employ neural network control combined with sliding mode control to tackle time delays. The proposed system demonstrates significant improvements in throughput and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0096",
    "source_url": "synthetic://project/project_0096"
  },
  {
    "title": "learning-based control for medical devices in healthcare",
    "abstract": "This project investigates learning-based control for medical devices in healthcare. The proposed approach combines genetic algorithms with fault detection to achieve improved accuracy. The research addresses key challenges in PID controller, automation and adaptive control. We employ fuzzy control combined with predictive maintenance to tackle robustness. The proposed system demonstrates significant improvements in throughput and accuracy compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0097",
    "source_url": "synthetic://project/project_0097"
  },
  {
    "title": "Development of novel nonlinear control techniques for manufacturing systems",
    "abstract": "We develop novel nonlinear control techniques for manufacturing systems. Our research focuses on energy efficiency while ensuring real-time performance. The research addresses key challenges in feedback control, PID controller and system identification. We employ genetic algorithms combined with Kalman filtering to tackle safety requirements. The proposed system demonstrates significant improvements in throughput and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0098",
    "source_url": "synthetic://project/project_0098"
  },
  {
    "title": "presents a comprehensive study of stochastic control applied to process control",
    "abstract": "This work presents a comprehensive study of stochastic control applied to process control. We address adaptability through innovative fuzzy control strategies. The research addresses key challenges in PID controller, system identification and model predictive control. We employ particle swarm optimization combined with predictive maintenance to tackle safety requirements. The proposed system demonstrates significant improvements in response time and throughput compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0099",
    "source_url": "synthetic://project/project_0099"
  },
  {
    "title": "learning-based control for autonomous vehicles in environmental monitoring",
    "abstract": "This project investigates learning-based control for autonomous vehicles in environmental monitoring. The proposed approach combines adaptive filtering with fuzzy control to achieve improved stability. The research addresses key challenges in adaptive control, automation and control systems. We employ adaptive filtering combined with Bayesian optimization to tackle robustness. The proposed system demonstrates significant improvements in stability and throughput compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0100",
    "source_url": "synthetic://project/project_0100"
  },
  {
    "title": "Development of novel stochastic control techniques for aerospace systems",
    "abstract": "We develop novel stochastic control techniques for aerospace systems. Our research focuses on real-time constraints while ensuring adaptability. The research addresses key challenges in PID controller, robust control and model predictive control. We employ Kalman filtering combined with genetic algorithms to tackle adaptability. The proposed system demonstrates significant improvements in response time and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0101",
    "source_url": "synthetic://project/project_0101"
  },
  {
    "title": "presents a comprehensive study of distributed control applied to smart grids",
    "abstract": "This work presents a comprehensive study of distributed control applied to smart grids. We address multi-objective optimization through innovative deep reinforcement learning strategies. The research addresses key challenges in system identification, automation and feedback control. We employ adaptive filtering combined with deep reinforcement learning to tackle scalability. The proposed system demonstrates significant improvements in throughput and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0102",
    "source_url": "synthetic://project/project_0102"
  },
  {
    "title": "presents a comprehensive study of event-triggered control applied to energy s...",
    "abstract": "This work presents a comprehensive study of event-triggered control applied to energy systems. We address energy efficiency through innovative genetic algorithms strategies. The research addresses key challenges in model predictive control, feedback control and PID controller. We employ predictive maintenance combined with deep reinforcement learning to tackle adaptability. The proposed system demonstrates significant improvements in robustness and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0103",
    "source_url": "synthetic://project/project_0103"
  },
  {
    "title": "Development of novel hierarchical control techniques for medical devices",
    "abstract": "We develop novel hierarchical control techniques for medical devices. Our research focuses on scalability while ensuring adaptability. The research addresses key challenges in robust control, feedback control and PID controller. We employ deep reinforcement learning combined with deep reinforcement learning to tackle robustness. The proposed system demonstrates significant improvements in stability and robustness compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0104",
    "source_url": "synthetic://project/project_0104"
  },
  {
    "title": "Development of novel distributed control techniques for energy systems",
    "abstract": "We develop novel distributed control techniques for energy systems. Our research focuses on scalability while ensuring robustness. The research addresses key challenges in automation, adaptive control and optimal control. We employ genetic algorithms combined with state estimation to tackle human-machine interaction. The proposed system demonstrates significant improvements in precision and precision compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0105",
    "source_url": "synthetic://project/project_0105"
  },
  {
    "title": "hierarchical control for manufacturing systems in construction",
    "abstract": "This project investigates hierarchical control for manufacturing systems in construction. The proposed approach combines Kalman filtering with fault detection to achieve improved throughput. The research addresses key challenges in model predictive control, control systems and feedback control. We employ fault detection combined with fault detection to tackle real-time constraints. The proposed system demonstrates significant improvements in energy consumption and efficiency compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0106",
    "source_url": "synthetic://project/project_0106"
  },
  {
    "title": "learning-based control for industrial automation in healthcare",
    "abstract": "This project investigates learning-based control for industrial automation in healthcare. The proposed approach combines deep reinforcement learning with adaptive filtering to achieve improved accuracy. The research addresses key challenges in optimal control, feedback control and adaptive control. We employ fuzzy control combined with predictive maintenance to tackle energy efficiency. The proposed system demonstrates significant improvements in safety and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0107",
    "source_url": "synthetic://project/project_0107"
  },
  {
    "title": "Development of novel nonlinear control techniques for energy systems",
    "abstract": "We develop novel nonlinear control techniques for energy systems. Our research focuses on uncertainty and disturbances while ensuring adaptability. The research addresses key challenges in control systems, model predictive control and PID controller. We employ Bayesian optimization combined with particle swarm optimization to tackle nonlinear dynamics. The proposed system demonstrates significant improvements in throughput and precision compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0108",
    "source_url": "synthetic://project/project_0108"
  },
  {
    "title": "distributed control for marine systems in service robotics",
    "abstract": "This project investigates distributed control for marine systems in service robotics. The proposed approach combines state estimation with state estimation to achieve improved stability. The research addresses key challenges in PID controller, adaptive control and optimal control. We employ particle swarm optimization combined with state estimation to tackle robustness. The proposed system demonstrates significant improvements in response time and energy consumption compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0109",
    "source_url": "synthetic://project/project_0109"
  },
  {
    "title": "Development of novel model-based design techniques for building automation",
    "abstract": "We develop novel model-based design techniques for building automation. Our research focuses on safety requirements while ensuring robustness. The research addresses key challenges in feedback control, model predictive control and control systems. We employ state estimation combined with particle swarm optimization to tackle safety requirements. The proposed system demonstrates significant improvements in robustness and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "automation_control",
    "project_id": "project_0110",
    "source_url": "synthetic://project/project_0110"
  },
  {
    "title": "This project focuses on data-driven approaches in building automation, addres...",
    "abstract": "This project focuses on data-driven approaches in building automation, addressing challenges in energy efficiency through innovative sensor-actuator integration. The research addresses key challenges in motion control, servo systems and sensors. We employ Bayesian optimization combined with genetic algorithms to tackle real-time constraints. The proposed system demonstrates significant improvements in precision and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0111",
    "source_url": "synthetic://project/project_0111"
  },
  {
    "title": "Advanced networked control for medical devices in mechatronic systems",
    "abstract": "This research develops advanced networked control for medical devices in mechatronic systems. We integrate predictive maintenance with deep reinforcement learning to enhance stability. The research addresses key challenges in embedded systems, precision engineering and servo systems. We employ adaptive filtering combined with genetic algorithms to tackle robustness. The proposed system demonstrates significant improvements in response time and precision compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0112",
    "source_url": "synthetic://project/project_0112"
  },
  {
    "title": "This project focuses on stochastic control in aerospace systems, addressing c...",
    "abstract": "This project focuses on stochastic control in aerospace systems, addressing challenges in nonlinear dynamics through innovative sensor-actuator integration. The research addresses key challenges in real-time control, motion control and precision engineering. We employ particle swarm optimization combined with neural network control to tackle multi-objective optimization. The proposed system demonstrates significant improvements in performance and accuracy compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0113",
    "source_url": "synthetic://project/project_0113"
  },
  {
    "title": "a novel mechatronic design for marine systems that incorporates fault detection",
    "abstract": "We propose a novel mechatronic design for marine systems that incorporates fault detection. The system achieves accuracy through nonlinear control. The research addresses key challenges in embedded systems, sensors and real-time control. We employ sliding mode control combined with Bayesian optimization to tackle safety requirements. The proposed system demonstrates significant improvements in throughput and safety compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0114",
    "source_url": "synthetic://project/project_0114"
  },
  {
    "title": "Advanced adaptive algorithms for assistive robotics in mechatronic s...",
    "abstract": "This research develops advanced adaptive algorithms for assistive robotics in mechatronic systems. We integrate adaptive filtering with particle swarm optimization to enhance energy consumption. The research addresses key challenges in motion control, sensors and real-time control. We employ adaptive filtering combined with neural network control to tackle robustness. The proposed system demonstrates significant improvements in performance and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0115",
    "source_url": "synthetic://project/project_0115"
  },
  {
    "title": "a novel mechatronic design for building automation that incorporates adaptive...",
    "abstract": "We propose a novel mechatronic design for building automation that incorporates adaptive filtering. The system achieves safety through distributed control. The research addresses key challenges in embedded systems, real-time control and servo systems. We employ predictive maintenance combined with fault detection to tackle multi-objective optimization. The proposed system demonstrates significant improvements in accuracy and efficiency compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0116",
    "source_url": "synthetic://project/project_0116"
  },
  {
    "title": "a novel mechatronic design for marine systems that incorporates genetic algor...",
    "abstract": "We propose a novel mechatronic design for marine systems that incorporates genetic algorithms. The system achieves accuracy through stochastic control. The research addresses key challenges in precision engineering, motion control and servo systems. We employ sliding mode control combined with sliding mode control to tackle real-time constraints. The proposed system demonstrates significant improvements in reliability and precision compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0117",
    "source_url": "synthetic://project/project_0117"
  },
  {
    "title": "This project focuses on stochastic control in autonomous vehicles, addressing...",
    "abstract": "This project focuses on stochastic control in autonomous vehicles, addressing challenges in multi-objective optimization through innovative sensor-actuator integration. The research addresses key challenges in motion control, actuators and electromechanical. We employ fuzzy control combined with adaptive filtering to tackle time delays. The proposed system demonstrates significant improvements in accuracy and throughput compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0118",
    "source_url": "synthetic://project/project_0118"
  },
  {
    "title": "Advanced networked control for marine systems in mechatronic systems",
    "abstract": "This research develops advanced networked control for marine systems in mechatronic systems. We integrate predictive maintenance with neural network control to enhance performance. The research addresses key challenges in embedded systems, servo systems and precision engineering. We employ predictive maintenance combined with fuzzy control to tackle safety requirements. The proposed system demonstrates significant improvements in response time and throughput compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0119",
    "source_url": "synthetic://project/project_0119"
  },
  {
    "title": "a novel mechatronic design for building automation that incorporates Bayesian...",
    "abstract": "We propose a novel mechatronic design for building automation that incorporates Bayesian optimization. The system achieves safety through model-based design. The research addresses key challenges in real-time control, electromechanical and motion control. We employ Bayesian optimization combined with adaptive filtering to tackle multi-objective optimization. The proposed system demonstrates significant improvements in stability and performance compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0120",
    "source_url": "synthetic://project/project_0120"
  },
  {
    "title": "Advanced event-triggered control for agricultural machinery in mecha...",
    "abstract": "This research develops advanced event-triggered control for agricultural machinery in mechatronic systems. We integrate genetic algorithms with Bayesian optimization to enhance safety. The research addresses key challenges in electromechanical, precision engineering and sensors. We employ predictive maintenance combined with sliding mode control to tackle scalability. The proposed system demonstrates significant improvements in efficiency and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0121",
    "source_url": "synthetic://project/project_0121"
  },
  {
    "title": "Advanced data-driven approaches for medical devices in mechatronic s...",
    "abstract": "This research develops advanced data-driven approaches for medical devices in mechatronic systems. We integrate fault detection with deep reinforcement learning to enhance response time. The research addresses key challenges in real-time control, actuators and mechatronic systems. We employ adaptive filtering combined with particle swarm optimization to tackle uncertainty and disturbances. The proposed system demonstrates significant improvements in reliability and accuracy compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0122",
    "source_url": "synthetic://project/project_0122"
  },
  {
    "title": "Advanced event-triggered control for building automation in mechatro...",
    "abstract": "This research develops advanced event-triggered control for building automation in mechatronic systems. We integrate neural network control with Bayesian optimization to enhance performance. The research addresses key challenges in motion control, actuators and sensors. We employ Bayesian optimization combined with adaptive filtering to tackle multi-objective optimization. The proposed system demonstrates significant improvements in energy consumption and accuracy compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0123",
    "source_url": "synthetic://project/project_0123"
  },
  {
    "title": "This project focuses on stochastic control in agricultural machinery, address...",
    "abstract": "This project focuses on stochastic control in agricultural machinery, addressing challenges in safety requirements through innovative sensor-actuator integration. The research addresses key challenges in actuators, sensors and servo systems. We employ Kalman filtering combined with fault detection to tackle nonlinear dynamics. The proposed system demonstrates significant improvements in safety and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0124",
    "source_url": "synthetic://project/project_0124"
  },
  {
    "title": "a novel mechatronic design for smart grids that incorporates fault detection",
    "abstract": "We propose a novel mechatronic design for smart grids that incorporates fault detection. The system achieves safety through distributed control. The research addresses key challenges in precision engineering, actuators and sensors. We employ deep reinforcement learning combined with state estimation to tackle energy efficiency. The proposed system demonstrates significant improvements in precision and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0125",
    "source_url": "synthetic://project/project_0125"
  },
  {
    "title": "Advanced hybrid control strategies for industrial automation in mech...",
    "abstract": "This research develops advanced hybrid control strategies for industrial automation in mechatronic systems. We integrate fault detection with neural network control to enhance stability. The research addresses key challenges in motion control, mechatronic systems and real-time control. We employ adaptive filtering combined with deep reinforcement learning to tackle time delays. The proposed system demonstrates significant improvements in stability and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0126",
    "source_url": "synthetic://project/project_0126"
  },
  {
    "title": "This project focuses on model-based design in smart grids, addressing challen...",
    "abstract": "This project focuses on model-based design in smart grids, addressing challenges in real-time constraints through innovative sensor-actuator integration. The research addresses key challenges in motion control, servo systems and embedded systems. We employ genetic algorithms combined with deep reinforcement learning to tackle uncertainty and disturbances. The proposed system demonstrates significant improvements in stability and accuracy compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0127",
    "source_url": "synthetic://project/project_0127"
  },
  {
    "title": "This project focuses on model-based design in medical devices, addressing cha...",
    "abstract": "This project focuses on model-based design in medical devices, addressing challenges in resource constraints through innovative sensor-actuator integration. The research addresses key challenges in servo systems, sensors and actuators. We employ adaptive filtering combined with fuzzy control to tackle multi-objective optimization. The proposed system demonstrates significant improvements in response time and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0128",
    "source_url": "synthetic://project/project_0128"
  },
  {
    "title": "a novel mechatronic design for assistive robotics that incorporates deep rein...",
    "abstract": "We propose a novel mechatronic design for assistive robotics that incorporates deep reinforcement learning. The system achieves precision through model-based design. The research addresses key challenges in embedded systems, mechatronic systems and precision engineering. We employ Kalman filtering combined with particle swarm optimization to tackle adaptability. The proposed system demonstrates significant improvements in precision and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0129",
    "source_url": "synthetic://project/project_0129"
  },
  {
    "title": "This project focuses on optimization methods in autonomous vehicles, addressi...",
    "abstract": "This project focuses on optimization methods in autonomous vehicles, addressing challenges in safety requirements through innovative sensor-actuator integration. The research addresses key challenges in motion control, mechatronic systems and real-time control. We employ fault detection combined with particle swarm optimization to tackle scalability. The proposed system demonstrates significant improvements in energy consumption and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "mechatronics",
    "project_id": "project_0130",
    "source_url": "synthetic://project/project_0130"
  },
  {
    "title": "Distributed control for assistive robotics in robotic systems",
    "abstract": "This work investigates distributed control for assistive robotics in robotic systems. We develop algorithms for energy efficiency using sliding mode control and neural network control. The research addresses key challenges in manipulation, human-robot interaction and autonomous navigation. We employ Kalman filtering combined with particle swarm optimization to tackle scalability. The proposed system demonstrates significant improvements in performance and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0131",
    "source_url": "synthetic://project/project_0131"
  },
  {
    "title": "We present a novel approach to assistive robotics in robotics, combining pred...",
    "abstract": "We present a novel approach to assistive robotics in robotics, combining predictive maintenance with state estimation to improve precision. The research addresses key challenges in human-robot interaction, SLAM and autonomous navigation. We employ fault detection combined with genetic algorithms to tackle multi-objective optimization. The proposed system demonstrates significant improvements in energy consumption and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0132",
    "source_url": "synthetic://project/project_0132"
  },
  {
    "title": "We present a novel approach to process control in robotics, combining adaptiv...",
    "abstract": "We present a novel approach to process control in robotics, combining adaptive filtering with sliding mode control to improve response time. The research addresses key challenges in mobile robots, autonomous navigation and SLAM. We employ particle swarm optimization combined with particle swarm optimization to tackle real-time constraints. The proposed system demonstrates significant improvements in robustness and throughput compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0133",
    "source_url": "synthetic://project/project_0133"
  },
  {
    "title": "We present a novel approach to medical devices in robotics, combining neural ...",
    "abstract": "We present a novel approach to medical devices in robotics, combining neural network control with adaptive filtering to improve safety. The research addresses key challenges in SLAM, robotic systems and path planning. We employ predictive maintenance combined with deep reinforcement learning to tackle adaptability. The proposed system demonstrates significant improvements in safety and accuracy compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0134",
    "source_url": "synthetic://project/project_0134"
  },
  {
    "title": "We present a novel approach to energy systems in robotics, combining adaptive...",
    "abstract": "We present a novel approach to energy systems in robotics, combining adaptive filtering with predictive maintenance to improve efficiency. The research addresses key challenges in path planning, robotic systems and manipulation. We employ genetic algorithms combined with Bayesian optimization to tackle nonlinear dynamics. The proposed system demonstrates significant improvements in performance and safety compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0135",
    "source_url": "synthetic://project/project_0135"
  },
  {
    "title": "We present a novel approach to manufacturing systems in robotics, combining K...",
    "abstract": "We present a novel approach to manufacturing systems in robotics, combining Kalman filtering with predictive maintenance to improve precision. The research addresses key challenges in path planning, mobile robots and robotic systems. We employ Kalman filtering combined with adaptive filtering to tackle resource constraints. The proposed system demonstrates significant improvements in safety and robustness compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0136",
    "source_url": "synthetic://project/project_0136"
  },
  {
    "title": "Model-based design for assistive robotics in robotic systems",
    "abstract": "This work investigates model-based design for assistive robotics in robotic systems. We develop algorithms for nonlinear dynamics using state estimation and state estimation. The research addresses key challenges in manipulation, SLAM and robotic systems. We employ Kalman filtering combined with sliding mode control to tackle multi-objective optimization. The proposed system demonstrates significant improvements in performance and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0137",
    "source_url": "synthetic://project/project_0137"
  },
  {
    "title": "addresses time delays in process control through advanced adaptive algorithms",
    "abstract": "This research addresses time delays in process control through advanced adaptive algorithms. Our system demonstrates reliability in real-world scenarios. The research addresses key challenges in manipulation, localization and robotic systems. We employ Kalman filtering combined with genetic algorithms to tackle scalability. The proposed system demonstrates significant improvements in accuracy and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0138",
    "source_url": "synthetic://project/project_0138"
  },
  {
    "title": "Nonlinear control for marine systems in robotic systems",
    "abstract": "This work investigates nonlinear control for marine systems in robotic systems. We develop algorithms for energy efficiency using sliding mode control and deep reinforcement learning. The research addresses key challenges in path planning, human-robot interaction and SLAM. We employ Bayesian optimization combined with genetic algorithms to tackle human-machine interaction. The proposed system demonstrates significant improvements in precision and precision compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0139",
    "source_url": "synthetic://project/project_0139"
  },
  {
    "title": "addresses resource constraints in smart grids through advanced event-triggere...",
    "abstract": "This research addresses resource constraints in smart grids through advanced event-triggered control. Our system demonstrates robustness in real-world scenarios. The research addresses key challenges in autonomous navigation, mobile robots and robot learning. We employ deep reinforcement learning combined with neural network control to tackle multi-objective optimization. The proposed system demonstrates significant improvements in response time and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0140",
    "source_url": "synthetic://project/project_0140"
  },
  {
    "title": "We present a novel approach to medical devices in robotics, combining genetic...",
    "abstract": "We present a novel approach to medical devices in robotics, combining genetic algorithms with sliding mode control to improve robustness. The research addresses key challenges in mobile robots, localization and path planning. We employ neural network control combined with neural network control to tackle multi-objective optimization. The proposed system demonstrates significant improvements in throughput and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0141",
    "source_url": "synthetic://project/project_0141"
  },
  {
    "title": "addresses real-time constraints in industrial automation through advanced sto...",
    "abstract": "This research addresses real-time constraints in industrial automation through advanced stochastic control. Our system demonstrates throughput in real-world scenarios. The research addresses key challenges in mobile robots, SLAM and robotic systems. We employ fuzzy control combined with fuzzy control to tackle time delays. The proposed system demonstrates significant improvements in throughput and accuracy compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0142",
    "source_url": "synthetic://project/project_0142"
  },
  {
    "title": "Hybrid control strategies for smart grids in robotic systems",
    "abstract": "This work investigates hybrid control strategies for smart grids in robotic systems. We develop algorithms for energy efficiency using genetic algorithms and fuzzy control. The research addresses key challenges in robotic systems, localization and manipulation. We employ neural network control combined with predictive maintenance to tackle time delays. The proposed system demonstrates significant improvements in precision and efficiency compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0143",
    "source_url": "synthetic://project/project_0143"
  },
  {
    "title": "We present a novel approach to industrial automation in robotics, combining p...",
    "abstract": "We present a novel approach to industrial automation in robotics, combining particle swarm optimization with adaptive filtering to improve reliability. The research addresses key challenges in robotic systems, manipulation and robot learning. We employ fault detection combined with predictive maintenance to tackle robustness. The proposed system demonstrates significant improvements in precision and performance compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0144",
    "source_url": "synthetic://project/project_0144"
  },
  {
    "title": "Optimization methods for assistive robotics in robotic systems",
    "abstract": "This work investigates optimization methods for assistive robotics in robotic systems. We develop algorithms for human-machine interaction using fault detection and sliding mode control. The research addresses key challenges in robotic systems, manipulation and path planning. We employ genetic algorithms combined with neural network control to tackle uncertainty and disturbances. The proposed system demonstrates significant improvements in efficiency and safety compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0145",
    "source_url": "synthetic://project/project_0145"
  },
  {
    "title": "addresses adaptability in medical devices through advanced networked control",
    "abstract": "This research addresses adaptability in medical devices through advanced networked control. Our system demonstrates precision in real-world scenarios. The research addresses key challenges in path planning, manipulation and SLAM. We employ deep reinforcement learning combined with state estimation to tackle multi-objective optimization. The proposed system demonstrates significant improvements in stability and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0146",
    "source_url": "synthetic://project/project_0146"
  },
  {
    "title": "We present a novel approach to industrial automation in robotics, combining f...",
    "abstract": "We present a novel approach to industrial automation in robotics, combining fault detection with particle swarm optimization to improve safety. The research addresses key challenges in SLAM, robot learning and human-robot interaction. We employ Kalman filtering combined with Bayesian optimization to tackle time delays. The proposed system demonstrates significant improvements in stability and safety compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0147",
    "source_url": "synthetic://project/project_0147"
  },
  {
    "title": "Learning-based control for autonomous vehicles in robotic systems",
    "abstract": "This work investigates learning-based control for autonomous vehicles in robotic systems. We develop algorithms for scalability using deep reinforcement learning and particle swarm optimization. The research addresses key challenges in SLAM, autonomous navigation and mobile robots. We employ fault detection combined with fault detection to tackle time delays. The proposed system demonstrates significant improvements in performance and performance compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0148",
    "source_url": "synthetic://project/project_0148"
  },
  {
    "title": "We present a novel approach to medical devices in robotics, combining fault d...",
    "abstract": "We present a novel approach to medical devices in robotics, combining fault detection with deep reinforcement learning to improve performance. The research addresses key challenges in path planning, robotic systems and SLAM. We employ state estimation combined with particle swarm optimization to tackle scalability. The proposed system demonstrates significant improvements in performance and robustness compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0149",
    "source_url": "synthetic://project/project_0149"
  },
  {
    "title": "We present a novel approach to manufacturing systems in robotics, combining f...",
    "abstract": "We present a novel approach to manufacturing systems in robotics, combining fuzzy control with deep reinforcement learning to improve response time. The research addresses key challenges in robotic systems, robot learning and localization. We employ state estimation combined with predictive maintenance to tackle safety requirements. The proposed system demonstrates significant improvements in response time and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "robotics",
    "project_id": "project_0150",
    "source_url": "synthetic://project/project_0150"
  },
  {
    "title": "presents novel hybrid control strategies approaches for energy systems, combi...",
    "abstract": "This research presents novel hybrid control strategies approaches for energy systems, combining fault detection with fuzzy control to enhance measurement accuracy. The research addresses key challenges in sensor fusion, measurement technology and calibration. We employ fuzzy control combined with Kalman filtering to tackle adaptability. The proposed system demonstrates significant improvements in safety and safety compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0151",
    "source_url": "synthetic://project/project_0151"
  },
  {
    "title": "presents novel learning-based control approaches for aerospace systems, combi...",
    "abstract": "This research presents novel learning-based control approaches for aerospace systems, combining predictive maintenance with fuzzy control to enhance measurement accuracy. The research addresses key challenges in instrumentation, calibration and sensor fusion. We employ fuzzy control combined with particle swarm optimization to tackle nonlinear dynamics. The proposed system demonstrates significant improvements in reliability and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0152",
    "source_url": "synthetic://project/project_0152"
  },
  {
    "title": "presents novel adaptive algorithms approaches for industrial automation, comb...",
    "abstract": "This research presents novel adaptive algorithms approaches for industrial automation, combining state estimation with sliding mode control to enhance measurement accuracy. The research addresses key challenges in precision measurement, calibration and sensor fusion. We employ adaptive filtering combined with Bayesian optimization to tackle nonlinear dynamics. The proposed system demonstrates significant improvements in precision and performance compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0153",
    "source_url": "synthetic://project/project_0153"
  },
  {
    "title": "This project develops advanced adaptive algorithms for assistive robotics in ...",
    "abstract": "This project develops advanced adaptive algorithms for assistive robotics in measurement systems. We achieve accuracy through particle swarm optimization. The research addresses key challenges in instrumentation, measurement technology and calibration. We employ fault detection combined with state estimation to tackle adaptability. The proposed system demonstrates significant improvements in response time and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0154",
    "source_url": "synthetic://project/project_0154"
  },
  {
    "title": "presents novel hierarchical control approaches for marine systems, combining ...",
    "abstract": "This research presents novel hierarchical control approaches for marine systems, combining state estimation with deep reinforcement learning to enhance measurement accuracy. The research addresses key challenges in sensor fusion, metrology and calibration. We employ fuzzy control combined with predictive maintenance to tackle adaptability. The proposed system demonstrates significant improvements in efficiency and efficiency compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0155",
    "source_url": "synthetic://project/project_0155"
  },
  {
    "title": "presents novel nonlinear control approaches for process control, combining sl...",
    "abstract": "This research presents novel nonlinear control approaches for process control, combining sliding mode control with neural network control to enhance measurement accuracy. The research addresses key challenges in data acquisition, precision measurement and instrumentation. We employ adaptive filtering combined with sliding mode control to tackle nonlinear dynamics. The proposed system demonstrates significant improvements in energy consumption and robustness compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0156",
    "source_url": "synthetic://project/project_0156"
  },
  {
    "title": "presents novel data-driven approaches approaches for building automation, com...",
    "abstract": "This research presents novel data-driven approaches approaches for building automation, combining sliding mode control with deep reinforcement learning to enhance measurement accuracy. The research addresses key challenges in precision measurement, measurement technology and uncertainty analysis. We employ sliding mode control combined with adaptive filtering to tackle nonlinear dynamics. The proposed system demonstrates significant improvements in throughput and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0157",
    "source_url": "synthetic://project/project_0157"
  },
  {
    "title": "We investigate networked control techniques for industrial automation, focusi...",
    "abstract": "We investigate networked control techniques for industrial automation, focusing on safety requirements and safety. The research addresses key challenges in calibration, instrumentation and measurement technology. We employ particle swarm optimization combined with fuzzy control to tackle multi-objective optimization. The proposed system demonstrates significant improvements in precision and efficiency compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0158",
    "source_url": "synthetic://project/project_0158"
  },
  {
    "title": "This project develops advanced distributed control for smart grids in measure...",
    "abstract": "This project develops advanced distributed control for smart grids in measurement systems. We achieve throughput through adaptive filtering. The research addresses key challenges in calibration, instrumentation and measurement technology. We employ Bayesian optimization combined with Kalman filtering to tackle scalability. The proposed system demonstrates significant improvements in response time and safety compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0159",
    "source_url": "synthetic://project/project_0159"
  },
  {
    "title": "This project develops advanced data-driven approaches for marine systems in m...",
    "abstract": "This project develops advanced data-driven approaches for marine systems in measurement systems. We achieve response time through Bayesian optimization. The research addresses key challenges in metrology, instrumentation and data acquisition. We employ genetic algorithms combined with deep reinforcement learning to tackle time delays. The proposed system demonstrates significant improvements in accuracy and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0160",
    "source_url": "synthetic://project/project_0160"
  },
  {
    "title": "We investigate data-driven approaches techniques for industrial automation, f...",
    "abstract": "We investigate data-driven approaches techniques for industrial automation, focusing on uncertainty and disturbances and user-friendliness. The research addresses key challenges in data acquisition, metrology and uncertainty analysis. We employ fuzzy control combined with Bayesian optimization to tackle uncertainty and disturbances. The proposed system demonstrates significant improvements in performance and safety compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0161",
    "source_url": "synthetic://project/project_0161"
  },
  {
    "title": "We investigate nonlinear control techniques for manufacturing systems, focusi...",
    "abstract": "We investigate nonlinear control techniques for manufacturing systems, focusing on time delays and robustness. The research addresses key challenges in instrumentation, signal processing and calibration. We employ particle swarm optimization combined with Kalman filtering to tackle robustness. The proposed system demonstrates significant improvements in stability and robustness compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0162",
    "source_url": "synthetic://project/project_0162"
  },
  {
    "title": "This project develops advanced adaptive algorithms for energy systems in meas...",
    "abstract": "This project develops advanced adaptive algorithms for energy systems in measurement systems. We achieve robustness through state estimation. The research addresses key challenges in precision measurement, uncertainty analysis and data acquisition. We employ Bayesian optimization combined with sliding mode control to tackle nonlinear dynamics. The proposed system demonstrates significant improvements in reliability and energy consumption compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0163",
    "source_url": "synthetic://project/project_0163"
  },
  {
    "title": "We investigate distributed control techniques for aerospace systems, focusing...",
    "abstract": "We investigate distributed control techniques for aerospace systems, focusing on human-machine interaction and robustness. The research addresses key challenges in instrumentation, calibration and uncertainty analysis. We employ particle swarm optimization combined with state estimation to tackle human-machine interaction. The proposed system demonstrates significant improvements in throughput and efficiency compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0164",
    "source_url": "synthetic://project/project_0164"
  },
  {
    "title": "presents novel hybrid control strategies approaches for aerospace systems, co...",
    "abstract": "This research presents novel hybrid control strategies approaches for aerospace systems, combining fault detection with genetic algorithms to enhance measurement accuracy. The research addresses key challenges in precision measurement, measurement technology and sensor fusion. We employ neural network control combined with Bayesian optimization to tackle resource constraints. The proposed system demonstrates significant improvements in stability and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0165",
    "source_url": "synthetic://project/project_0165"
  },
  {
    "title": "presents novel data-driven approaches approaches for agricultural machinery, ...",
    "abstract": "This research presents novel data-driven approaches approaches for agricultural machinery, combining fuzzy control with genetic algorithms to enhance measurement accuracy. The research addresses key challenges in calibration, precision measurement and instrumentation. We employ Bayesian optimization combined with fuzzy control to tackle scalability. The proposed system demonstrates significant improvements in response time and safety compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0166",
    "source_url": "synthetic://project/project_0166"
  },
  {
    "title": "We investigate model-based design techniques for building automation, focusin...",
    "abstract": "We investigate model-based design techniques for building automation, focusing on multi-objective optimization and cost-effectiveness. The research addresses key challenges in instrumentation, metrology and sensor fusion. We employ Bayesian optimization combined with sliding mode control to tackle time delays. The proposed system demonstrates significant improvements in stability and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0167",
    "source_url": "synthetic://project/project_0167"
  },
  {
    "title": "presents novel event-triggered control approaches for aerospace systems, comb...",
    "abstract": "This research presents novel event-triggered control approaches for aerospace systems, combining sliding mode control with deep reinforcement learning to enhance measurement accuracy. The research addresses key challenges in signal processing, measurement technology and data acquisition. We employ fault detection combined with state estimation to tackle safety requirements. The proposed system demonstrates significant improvements in robustness and performance compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0168",
    "source_url": "synthetic://project/project_0168"
  },
  {
    "title": "presents novel hybrid control strategies approaches for manufacturing systems...",
    "abstract": "This research presents novel hybrid control strategies approaches for manufacturing systems, combining Bayesian optimization with Bayesian optimization to enhance measurement accuracy. The research addresses key challenges in precision measurement, signal processing and calibration. We employ fuzzy control combined with particle swarm optimization to tackle time delays. The proposed system demonstrates significant improvements in efficiency and stability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0169",
    "source_url": "synthetic://project/project_0169"
  },
  {
    "title": "This project develops advanced event-triggered control for medical devices in...",
    "abstract": "This project develops advanced event-triggered control for medical devices in measurement systems. We achieve accuracy through deep reinforcement learning. The research addresses key challenges in measurement technology, signal processing and metrology. We employ particle swarm optimization combined with adaptive filtering to tackle real-time constraints. The proposed system demonstrates significant improvements in energy consumption and throughput compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "measurement_systems",
    "project_id": "project_0170",
    "source_url": "synthetic://project/project_0170"
  },
  {
    "title": "Development of optimization methods approaches for medical devices, leveragin...",
    "abstract": "We develop optimization methods approaches for medical devices, leveraging deep reinforcement learning to address resource constraints. The research addresses key challenges in fuzzy logic, neural networks and artificial intelligence. We employ genetic algorithms combined with genetic algorithms to tackle time delays. The proposed system demonstrates significant improvements in throughput and accuracy compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0171",
    "source_url": "synthetic://project/project_0171"
  },
  {
    "title": "explores data-driven approaches for industrial automation in intelligent tech...",
    "abstract": "This work explores data-driven approaches for industrial automation in intelligent technical systems. We integrate neural network control with genetic algorithms to achieve stability. The research addresses key challenges in fuzzy logic, neural networks and artificial intelligence. We employ particle swarm optimization combined with fuzzy control to tackle safety requirements. The proposed system demonstrates significant improvements in accuracy and precision compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0172",
    "source_url": "synthetic://project/project_0172"
  },
  {
    "title": "explores event-triggered control for autonomous vehicles in intelligent techn...",
    "abstract": "This work explores event-triggered control for autonomous vehicles in intelligent technical systems. We integrate genetic algorithms with Bayesian optimization to achieve reliability. The research addresses key challenges in optimization, decision support and neural networks. We employ adaptive filtering combined with neural network control to tackle multi-objective optimization. The proposed system demonstrates significant improvements in stability and efficiency compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0173",
    "source_url": "synthetic://project/project_0173"
  },
  {
    "title": "Development of hybrid control strategies approaches for manufacturing systems...",
    "abstract": "We develop hybrid control strategies approaches for manufacturing systems, leveraging fault detection to address energy efficiency. The research addresses key challenges in fuzzy logic, decision support and intelligent control. We employ sliding mode control combined with Bayesian optimization to tackle scalability. The proposed system demonstrates significant improvements in response time and robustness compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0174",
    "source_url": "synthetic://project/project_0174"
  },
  {
    "title": "explores networked control for marine systems in intelligent technical systems",
    "abstract": "This work explores networked control for marine systems in intelligent technical systems. We integrate fuzzy control with genetic algorithms to achieve throughput. The research addresses key challenges in neural networks, expert systems and fuzzy logic. We employ particle swarm optimization combined with predictive maintenance to tackle uncertainty and disturbances. The proposed system demonstrates significant improvements in precision and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0175",
    "source_url": "synthetic://project/project_0175"
  },
  {
    "title": "Stochastic control in process control, combining classical contr...",
    "abstract": "This research investigates stochastic control in process control, combining classical control theory with fault detection for improved reliability. The research addresses key challenges in intelligent control, expert systems and cognitive systems. We employ fuzzy control combined with adaptive filtering to tackle scalability. The proposed system demonstrates significant improvements in reliability and precision compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0176",
    "source_url": "synthetic://project/project_0176"
  },
  {
    "title": "Optimization methods in energy systems, combining classical cont...",
    "abstract": "This research investigates optimization methods in energy systems, combining classical control theory with neural network control for improved safety. The research addresses key challenges in machine learning, decision support and expert systems. We employ fuzzy control combined with Kalman filtering to tackle uncertainty and disturbances. The proposed system demonstrates significant improvements in safety and robustness compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0177",
    "source_url": "synthetic://project/project_0177"
  },
  {
    "title": "Event-triggered control in smart grids, combining classical cont...",
    "abstract": "This research investigates event-triggered control in smart grids, combining classical control theory with state estimation for improved efficiency. The research addresses key challenges in cognitive systems, expert systems and decision support. We employ neural network control combined with particle swarm optimization to tackle energy efficiency. The proposed system demonstrates significant improvements in throughput and energy consumption compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0178",
    "source_url": "synthetic://project/project_0178"
  },
  {
    "title": "Development of hybrid control strategies approaches for assistive robotics, l...",
    "abstract": "We develop hybrid control strategies approaches for assistive robotics, leveraging neural network control to address uncertainty and disturbances. The research addresses key challenges in decision support, machine learning and cognitive systems. We employ sliding mode control combined with neural network control to tackle real-time constraints. The proposed system demonstrates significant improvements in reliability and energy consumption compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0179",
    "source_url": "synthetic://project/project_0179"
  },
  {
    "title": "Stochastic control in energy systems, combining classical contro...",
    "abstract": "This research investigates stochastic control in energy systems, combining classical control theory with genetic algorithms for improved response time. The research addresses key challenges in expert systems, decision support and cognitive systems. We employ adaptive filtering combined with state estimation to tackle adaptability. The proposed system demonstrates significant improvements in robustness and efficiency compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0180",
    "source_url": "synthetic://project/project_0180"
  },
  {
    "title": "Learning-based control in manufacturing systems, combining class...",
    "abstract": "This research investigates learning-based control in manufacturing systems, combining classical control theory with neural network control for improved throughput. The research addresses key challenges in neural networks, cognitive systems and optimization. We employ fuzzy control combined with Kalman filtering to tackle time delays. The proposed system demonstrates significant improvements in precision and accuracy compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0181",
    "source_url": "synthetic://project/project_0181"
  },
  {
    "title": "Development of optimization methods approaches for aerospace systems, leverag...",
    "abstract": "We develop optimization methods approaches for aerospace systems, leveraging fault detection to address scalability. The research addresses key challenges in cognitive systems, expert systems and decision support. We employ adaptive filtering combined with Kalman filtering to tackle multi-objective optimization. The proposed system demonstrates significant improvements in stability and robustness compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0182",
    "source_url": "synthetic://project/project_0182"
  },
  {
    "title": "Development of learning-based control approaches for assistive robotics, leve...",
    "abstract": "We develop learning-based control approaches for assistive robotics, leveraging fault detection to address resource constraints. The research addresses key challenges in expert systems, decision support and machine learning. We employ fuzzy control combined with Kalman filtering to tackle adaptability. The proposed system demonstrates significant improvements in safety and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0183",
    "source_url": "synthetic://project/project_0183"
  },
  {
    "title": "Event-triggered control in aerospace systems, combining classica...",
    "abstract": "This research investigates event-triggered control in aerospace systems, combining classical control theory with state estimation for improved throughput. The research addresses key challenges in expert systems, intelligent control and artificial intelligence. We employ predictive maintenance combined with Bayesian optimization to tackle safety requirements. The proposed system demonstrates significant improvements in stability and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0184",
    "source_url": "synthetic://project/project_0184"
  },
  {
    "title": "Networked control in energy systems, combining classical control...",
    "abstract": "This research investigates networked control in energy systems, combining classical control theory with fuzzy control for improved safety. The research addresses key challenges in optimization, decision support and machine learning. We employ neural network control combined with particle swarm optimization to tackle scalability. The proposed system demonstrates significant improvements in precision and response time compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0185",
    "source_url": "synthetic://project/project_0185"
  },
  {
    "title": "Model-based design in autonomous vehicles, combining classical c...",
    "abstract": "This research investigates model-based design in autonomous vehicles, combining classical control theory with Bayesian optimization for improved precision. The research addresses key challenges in expert systems, neural networks and decision support. We employ adaptive filtering combined with particle swarm optimization to tackle scalability. The proposed system demonstrates significant improvements in safety and performance compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0186",
    "source_url": "synthetic://project/project_0186"
  },
  {
    "title": "explores hierarchical control for industrial automation in intelligent techni...",
    "abstract": "This work explores hierarchical control for industrial automation in intelligent technical systems. We integrate genetic algorithms with adaptive filtering to achieve throughput. The research addresses key challenges in decision support, fuzzy logic and neural networks. We employ genetic algorithms combined with deep reinforcement learning to tackle energy efficiency. The proposed system demonstrates significant improvements in robustness and robustness compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0187",
    "source_url": "synthetic://project/project_0187"
  },
  {
    "title": "explores hybrid control strategies for energy systems in intelligent technica...",
    "abstract": "This work explores hybrid control strategies for energy systems in intelligent technical systems. We integrate fuzzy control with fault detection to achieve stability. The research addresses key challenges in machine learning, decision support and artificial intelligence. We employ Kalman filtering combined with sliding mode control to tackle nonlinear dynamics. The proposed system demonstrates significant improvements in precision and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0188",
    "source_url": "synthetic://project/project_0188"
  },
  {
    "title": "Development of data-driven approaches approaches for agricultural machinery, ...",
    "abstract": "We develop data-driven approaches approaches for agricultural machinery, leveraging neural network control to address time delays. The research addresses key challenges in artificial intelligence, intelligent control and neural networks. We employ neural network control combined with deep reinforcement learning to tackle real-time constraints. The proposed system demonstrates significant improvements in safety and reliability compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0189",
    "source_url": "synthetic://project/project_0189"
  },
  {
    "title": "Development of nonlinear control approaches for industrial automation, levera...",
    "abstract": "We develop nonlinear control approaches for industrial automation, leveraging genetic algorithms to address time delays. The research addresses key challenges in machine learning, expert systems and cognitive systems. We employ adaptive filtering combined with deep reinforcement learning to tackle uncertainty and disturbances. The proposed system demonstrates significant improvements in accuracy and efficiency compared to state-of-the-art approaches.",
    "dfg_label": "4.41",
    "fachkollegium": "441",
    "source": "synthetic",
    "topic": "intelligent_systems",
    "project_id": "project_0190",
    "source_url": "synthetic://project/project_0190"
  }
]